/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package AkAudio.

/// Class /Script/AkAudio.AkPortalComponent
/// Size: 0x00C0 (0x000200 - 0x0002C0)
class UAkPortalComponent : public USceneComponent
{ 
public:
	bool                                               bDynamic;                                                   // 0x01F8   (0x0001)  
	AkAcousticPortalState                              InitialState;                                               // 0x01F9   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x01FA   (0x0002)  MISSED
	float                                              ObstructionRefreshInterval;                                 // 0x01FC   (0x0004)  
	TEnumAsByte<ECollisionChannel>                     ObstructionCollisionChannel;                                // 0x0200   (0x0001)  
	unsigned char                                      UnknownData01_6[0xBF];                                      // 0x0201   (0x00BF)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkPortalComponent.PortalPlacementValid
	bool PortalPlacementValid();                                                                                             // [0x1456e20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkPortalComponent.OpenPortal
	void OpenPortal();                                                                                                       // [0x1456e00] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkPortalComponent.GetPrimitiveParent
	UPrimitiveComponent* GetPrimitiveParent();                                                                               // [0x934830] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkPortalComponent.GetCurrentState
	AkAcousticPortalState GetCurrentState();                                                                                 // [0x1456c00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkPortalComponent.ClosePortal
	void ClosePortal();                                                                                                      // [0x1456ac0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkAcousticPortal
/// Size: 0x0010 (0x000258 - 0x000268)
class AAkAcousticPortal : public AVolume
{ 
public:
	UAkPortalComponent*                                Portal;                                                     // 0x0258   (0x0008)  
	AkAcousticPortalState                              InitialState;                                               // 0x0260   (0x0001)  
	bool                                               bRequiresStateMigration;                                    // 0x0261   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0262   (0x0006)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkAcousticPortal.OpenPortal
	void OpenPortal();                                                                                                       // [0x1456de0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkAcousticPortal.GetCurrentState
	AkAcousticPortalState GetCurrentState();                                                                                 // [0x1456bd0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkAcousticPortal.ClosePortal
	void ClosePortal();                                                                                                      // [0x1456aa0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkAudioType
/// Size: 0x0018 (0x000028 - 0x000040)
class UAkAudioType : public UObject
{ 
public:
	uint32_t                                           ShortID;                                                    // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	TArray<UObject*>                                   UserData;                                                   // 0x0030   (0x0010)  
};

/// Class /Script/AkAudio.AkAcousticTexture
/// Size: 0x0000 (0x000040 - 0x000040)
class UAkAcousticTexture : public UAkAudioType
{ 
public:
};

/// Class /Script/AkAudio.AkAcousticTextureSetComponent
/// Size: 0x0010 (0x000200 - 0x000210)
class UAkAcousticTextureSetComponent : public USceneComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0200   (0x0010)  MISSED
};

/// Class /Script/AkAudio.AkAmbientSound
/// Size: 0x0040 (0x000220 - 0x000260)
class AAkAmbientSound : public AActor
{ 
public:
	UAkAudioEvent*                                     AkAudioEvent;                                               // 0x0220   (0x0008)  
	UAkComponent*                                      AkComponent;                                                // 0x0228   (0x0008)  
	bool                                               StopWhenOwnerIsDestroyed;                                   // 0x0230   (0x0001)  
	bool                                               AutoPost;                                                   // 0x0231   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2E];                                      // 0x0232   (0x002E)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkAmbientSound.StopAmbientSound
	void StopAmbientSound();                                                                                                 // [0x1457fb0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkAmbientSound.StartAmbientSound
	void StartAmbientSound();                                                                                                // [0x1457f90] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkAndroidInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkAndroidInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkAndroidAdvancedInitializationSettings           AdvancedSettings;                                           // 0x00C0   (0x0038)  


	/// Functions
	// Function /Script/AkAudio.AkAndroidInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x1456d50] Final|Native|Public  
};

/// Class /Script/AkAudio.AkPlatformInfo
/// Size: 0x0048 (0x000028 - 0x000070)
class UAkPlatformInfo : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x48];                                      // 0x0028   (0x0048)  MISSED
};

/// Class /Script/AkAudio.AkAndroidPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkAndroidPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkAssetBase
/// Size: 0x0010 (0x000040 - 0x000050)
class UAkAssetBase : public UAkAudioType
{ 
public:
	UAkAssetPlatformData*                              PlatformAssetData;                                          // 0x0040   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0048   (0x0008)  MISSED
};

/// Class /Script/AkAudio.AkAssetData
/// Size: 0x0050 (0x000028 - 0x000078)
class UAkAssetData : public UObject
{ 
public:
	uint32_t                                           CachedHash;                                                 // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	FString                                            BankLanguage;                                               // 0x0030   (0x0010)  
	unsigned char                                      UnknownData01_6[0x38];                                      // 0x0040   (0x0038)  MISSED
};

/// Class /Script/AkAudio.AkAssetDataWithMedia
/// Size: 0x0010 (0x000078 - 0x000088)
class UAkAssetDataWithMedia : public UAkAssetData
{ 
public:
	TArray<UAkMediaAsset*>                             MediaList;                                                  // 0x0078   (0x0010)  
};

/// Class /Script/AkAudio.AkAssetPlatformData
/// Size: 0x0008 (0x000028 - 0x000030)
class UAkAssetPlatformData : public UObject
{ 
public:
	UAkAssetData*                                      CurrentAssetData;                                           // 0x0028   (0x0008)  
};

/// Class /Script/AkAudio.AkAssetDataSwitchContainerData
/// Size: 0x0050 (0x000028 - 0x000078)
class UAkAssetDataSwitchContainerData : public UObject
{ 
public:
	TWeakObjectPtr<UAkGroupValue*>                     GroupValue;                                                 // 0x0028   (0x0028)  
	UAkGroupValue*                                     DefaultGroupValue;                                          // 0x0050   (0x0008)  
	TArray<UAkMediaAsset*>                             MediaList;                                                  // 0x0058   (0x0010)  
	TArray<UAkAssetDataSwitchContainerData*>           Children;                                                   // 0x0068   (0x0010)  
};

/// Class /Script/AkAudio.AkAssetDataSwitchContainer
/// Size: 0x0068 (0x000088 - 0x0000F0)
class UAkAssetDataSwitchContainer : public UAkAssetDataWithMedia
{ 
public:
	TArray<UAkAssetDataSwitchContainerData*>           SwitchContainers;                                           // 0x0088   (0x0010)  
	UAkGroupValue*                                     DefaultGroupValue;                                          // 0x0098   (0x0008)  
	unsigned char                                      UnknownData00_6[0x50];                                      // 0x00A0   (0x0050)  MISSED
};

/// Class /Script/AkAudio.AkAudioEventData
/// Size: 0x01A0 (0x0000F0 - 0x000290)
class UAkAudioEventData : public UAkAssetDataSwitchContainer
{ 
public:
	float                                              MaxAttenuationRadius;                                       // 0x00F0   (0x0004)  
	bool                                               IsInfinite;                                                 // 0x00F4   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x00F5   (0x0003)  MISSED
	float                                              MinimumDuration;                                            // 0x00F8   (0x0004)  
	float                                              MaximumDuration;                                            // 0x00FC   (0x0004)  
	TMap<FString, UAkAssetDataSwitchContainer*>        LocalizedMedia;                                             // 0x0100   (0x0050)  
	TSet<UAkAudioEvent*>                               PostedEvents;                                               // 0x0150   (0x0050)  
	TSet<UAkAuxBus*>                                   UserDefinedSends;                                           // 0x01A0   (0x0050)  
	TSet<UAkTrigger*>                                  PostedTriggers;                                             // 0x01F0   (0x0050)  
	TSet<UAkGroupValue*>                               GroupValues;                                                // 0x0240   (0x0050)  
};

/// Class /Script/AkAudio.AkAudioBank
/// Size: 0x00C8 (0x000050 - 0x000118)
class UAkAudioBank : public UAkAssetBase
{ 
public:
	bool                                               AutoLoad;                                                   // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0051   (0x0007)  MISSED
	TMap<FString, UAkAssetPlatformData*>               LocalizedPlatformAssetDataMap;                              // 0x0058   (0x0050)  
	TSet<TWeakObjectPtr>                               LinkedAkEvents;                                             // 0x00A8   (0x0050)  
	UAkAssetPlatformData*                              CurrentLocalizedPlatformAssetData;                          // 0x00F8   (0x0008)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x0100   (0x0018)  MISSED
};

/// Class /Script/AkAudio.AkAudioEvent
/// Size: 0x0080 (0x000050 - 0x0000D0)
class UAkAudioEvent : public UAkAssetBase
{ 
public:
	TMap<FString, UAkAssetPlatformData*>               LocalizedPlatformAssetDataMap;                              // 0x0050   (0x0050)  
	UAkAudioBank*                                      RequiredBank;                                               // 0x00A0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x00A8   (0x0008)  MISSED
	UAkAssetPlatformData*                              CurrentLocalizedPlatformData;                               // 0x00B0   (0x0008)  
	float                                              MaxAttenuationRadius;                                       // 0x00B8   (0x0004)  
	bool                                               IsInfinite;                                                 // 0x00BC   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00BD   (0x0003)  MISSED
	float                                              MinimumDuration;                                            // 0x00C0   (0x0004)  
	float                                              MaximumDuration;                                            // 0x00C4   (0x0004)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x00C8   (0x0008)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkAudioEvent.GetMinimumDuration
	float GetMinimumDuration();                                                                                              // [0x1456cc0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkAudioEvent.GetMaximumDuration
	float GetMaximumDuration();                                                                                              // [0x1456c90] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkAudioEvent.GetMaxAttenuationRadius
	float GetMaxAttenuationRadius();                                                                                         // [0x1456c60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkAudioEvent.GetIsInfinite
	bool GetIsInfinite();                                                                                                    // [0x1456c30] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkGameObject
/// Size: 0x0020 (0x000200 - 0x000220)
class UAkGameObject : public USceneComponent
{ 
public:
	UAkAudioEvent*                                     AkAudioEvent;                                               // 0x01F8   (0x0008)  
	FString                                            EventName;                                                  // 0x0200   (0x0010)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0210   (0x0010)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkGameObject.Stop
	void Stop();                                                                                                             // [0x145dd00] BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkGameObject.SetRTPCValue
	void SetRTPCValue(UAkRtpc* RTPCValue, float Value, int32_t InterpolationTimeMs, FString RTPC);                           // [0x145d1a0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|Const 
	// Function /Script/AkAudio.AkGameObject.PostAssociatedAkEventAsync
	void PostAssociatedAkEventAsync(UObject* WorldContextObject, int32_t CallbackMask, FDelegateProperty& PostEventCallback, TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo, int32_t& PlayingID); // [0x145b570] BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkGameObject.PostAssociatedAkEvent
	int32_t PostAssociatedAkEvent(int32_t CallbackMask, FDelegateProperty& PostEventCallback, TArray<FAkExternalSourceInfo>& ExternalSources); // [0x145b3d0] BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkGameObject.PostAkEventAsync
	void PostAkEventAsync(UObject* WorldContextObject, UAkAudioEvent* akEvent, int32_t& PlayingID, int32_t CallbackMask, FDelegateProperty& PostEventCallback, TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo); // [0x145ac10] BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkGameObject.PostAkEvent
	int32_t PostAkEvent(UAkAudioEvent* akEvent, int32_t CallbackMask, FDelegateProperty& PostEventCallback, TArray<FAkExternalSourceInfo>& ExternalSources, FString in_EventName); // [0x145a9e0] BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkGameObject.GetRTPCValue
	void GetRTPCValue(UAkRtpc* RTPCValue, ERTPCValueType InputValueType, float& Value, ERTPCValueType& OutputValueType, FString RTPC, int32_t PlayingID); // [0x1459f50] Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkComponent
/// Size: 0x01C0 (0x000220 - 0x0003E0)
class UAkComponent : public UAkGameObject
{ 
public:
	bool                                               bUseSpatialAudio;                                           // 0x0218   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0219   (0x0007)  MISSED
	TEnumAsByte<ECollisionChannel>                     OcclusionCollisionChannel;                                  // 0x0220   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0221   (0x0003)  MISSED
	bool                                               EnableSpotReflectors;                                       // 0x0224:0 (0x0001)  
	unsigned char                                      UnknownData02_4[0x3];                                       // 0x0225   (0x0003)  MISSED
	float                                              OuterRadius;                                                // 0x0228   (0x0004)  
	float                                              InnerRadius;                                                // 0x022C   (0x0004)  
	UAkAuxBus*                                         EarlyReflectionAuxBus;                                      // 0x0230   (0x0008)  
	FString                                            EarlyReflectionAuxBusName;                                  // 0x0238   (0x0010)  
	int32_t                                            EarlyReflectionOrder;                                       // 0x0248   (0x0004)  
	float                                              EarlyReflectionBusSendGain;                                 // 0x024C   (0x0004)  
	float                                              EarlyReflectionMaxPathLength;                               // 0x0250   (0x0004)  
	float                                              roomReverbAuxBusGain;                                       // 0x0254   (0x0004)  
	int32_t                                            diffractionMaxEdges;                                        // 0x0258   (0x0004)  
	int32_t                                            diffractionMaxPaths;                                        // 0x025C   (0x0004)  
	float                                              diffractionMaxPathLength;                                   // 0x0260   (0x0004)  
	bool                                               DrawFirstOrderReflections;                                  // 0x0264:0 (0x0001)  
	bool                                               DrawSecondOrderReflections;                                 // 0x0264:1 (0x0001)  
	bool                                               DrawHigherOrderReflections;                                 // 0x0264:2 (0x0001)  
	bool                                               DrawDiffraction;                                            // 0x0264:3 (0x0001)  
	unsigned char                                      UnknownData03_4[0x3];                                       // 0x0265   (0x0003)  MISSED
	bool                                               StopWhenOwnerDestroyed;                                     // 0x0268   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0269   (0x0003)  MISSED
	float                                              AttenuationScalingFactor;                                   // 0x026C   (0x0004)  
	float                                              OcclusionRefreshInterval;                                   // 0x0270   (0x0004)  
	bool                                               bUseReverbVolumes;                                          // 0x0274   (0x0001)  
	unsigned char                                      UnknownData05_6[0x16B];                                     // 0x0275   (0x016B)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkComponent.UseReverbVolumes
	void UseReverbVolumes(bool inUseReverbVolumes);                                                                          // [0x14581c0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.UseEarlyReflections
	void UseEarlyReflections(UAkAuxBus* AuxBus, int32_t Order, float BusSendGain, float MaxPathLength, bool SpotReflectors, FString AuxBusName); // [0x1457fd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetSwitch
	void SetSwitch(UAkSwitchValue* SwitchValue, FString SwitchGroup, FString SwitchState);                                   // [0x1457de0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetStopWhenOwnerDestroyed
	void SetStopWhenOwnerDestroyed(bool bStopWhenOwnerDestroyed);                                                            // [0x1457d50] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetOutputBusVolume
	void SetOutputBusVolume(float BusVolume);                                                                                // [0x1457cd0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetListeners
	void SetListeners(TArray<UAkComponent*>& Listeners);                                                                     // [0x1457c20] Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetGameObjectRadius
	void SetGameObjectRadius(float in_outerRadius, float in_innerRadius);                                                    // [0x1457ac0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetEarlyReflectionsVolume
	void SetEarlyReflectionsVolume(float SendVolume);                                                                        // [0x1457a40] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetEarlyReflectionsAuxBus
	void SetEarlyReflectionsAuxBus(FString AuxBusName);                                                                      // [0x14579a0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetAttenuationScalingFactor
	void SetAttenuationScalingFactor(float Value);                                                                           // [0x14578a0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostTrigger
	void PostTrigger(UAkTrigger* TriggerValue, FString Trigger);                                                             // [0x1457630] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostAssociatedAkEventAndWaitForEndAsync
	void PostAssociatedAkEventAndWaitForEndAsync(int32_t& PlayingID, TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo); // [0x1457460] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostAssociatedAkEventAndWaitForEnd
	int32_t PostAssociatedAkEventAndWaitForEnd(TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo); // [0x14572f0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostAkEventByName
	int32_t PostAkEventByName(FString in_EventName);                                                                         // [0x1457240] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostAkEventAndWaitForEndAsync
	void PostAkEventAndWaitForEndAsync(UAkAudioEvent* akEvent, int32_t& PlayingID, TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo); // [0x1457070] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostAkEventAndWaitForEnd
	int32_t PostAkEventAndWaitForEnd(UAkAudioEvent* akEvent, FString in_EventName, TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo); // [0x1456e80] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.GetAttenuationRadius
	float GetAttenuationRadius();                                                                                            // [0x1456b70] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkAudioInputComponent
/// Size: 0x0030 (0x0003E0 - 0x000410)
class UAkAudioInputComponent : public UAkComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x30];                                      // 0x03E0   (0x0030)  MISSED
};

/// Class /Script/AkAudio.AkAuxBus
/// Size: 0x0008 (0x000050 - 0x000058)
class UAkAuxBus : public UAkAssetBase
{ 
public:
	UAkAudioBank*                                      RequiredBank;                                               // 0x0050   (0x0008)  
};

/// Class /Script/AkAudio.AkCheckBox
/// Size: 0x09B8 (0x000120 - 0x000AD8)
class UAkCheckBox : public UContentWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x348];                                     // 0x0120   (0x0348)  MISSED
	ECheckBoxState                                     CheckedState;                                               // 0x0468   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0469   (0x0003)  MISSED
	FDelegateProperty                                  CheckedStateDelegate;                                       // 0x046C   (0x0010)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x047C   (0x0004)  MISSED
	FCheckBoxStyle                                     WidgetStyle;                                                // 0x0480   (0x0580)  
	TEnumAsByte<EHorizontalAlignment>                  HorizontalAlignment;                                        // 0x0A00   (0x0001)  
	bool                                               IsFocusable;                                                // 0x0A01   (0x0001)  
	unsigned char                                      UnknownData03_5[0x6];                                       // 0x0A02   (0x0006)  MISSED
	FAkBoolPropertyToControl                           ThePropertyToControl;                                       // 0x0A08   (0x0010)  
	FAkWwiseItemToControl                              ItemToControl;                                              // 0x0A18   (0x0040)  
	FMulticastInlineDelegate                           AkOnCheckStateChanged;                                      // 0x0A58   (0x0010)  
	FMulticastInlineDelegate                           OnItemDropped;                                              // 0x0A68   (0x0010)  
	FMulticastInlineDelegate                           OnPropertyDropped;                                          // 0x0A78   (0x0010)  
	unsigned char                                      UnknownData04_6[0x50];                                      // 0x0A88   (0x0050)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkCheckBox.SetIsChecked
	void SetIsChecked(bool InIsChecked);                                                                                     // [0x1457b90] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkCheckBox.SetCheckedState
	void SetCheckedState(ECheckBoxState InCheckedState);                                                                     // [0x1457920] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkCheckBox.SetAkItemId
	void SetAkItemId(FGuid& ItemId);                                                                                         // [0x1457800] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/AkAudio.AkCheckBox.SetAkBoolProperty
	void SetAkBoolProperty(FString ItemProperty);                                                                            // [0x1457760] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkCheckBox.IsPressed
	bool IsPressed();                                                                                                        // [0x1456d20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkCheckBox.IsChecked
	bool IsChecked();                                                                                                        // [0x1456cf0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkCheckBox.GetCheckedState
	ECheckBoxState GetCheckedState();                                                                                        // [0x1456ba0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkCheckBox.GetAkProperty
	FString GetAkProperty();                                                                                                 // [0x1456b20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkCheckBox.GetAkItemId
	FGuid GetAkItemId();                                                                                                     // [0x1456ae0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.DrawPortalComponent
/// Size: 0x0000 (0x000450 - 0x000450)
class UDrawPortalComponent : public UPrimitiveComponent
{ 
public:
};

/// Class /Script/AkAudio.DrawRoomComponent
/// Size: 0x0000 (0x000450 - 0x000450)
class UDrawRoomComponent : public UPrimitiveComponent
{ 
public:
};

/// Class /Script/AkAudio.AkFolder
/// Size: 0x0078 (0x000040 - 0x0000B8)
class UAkFolder : public UAkAudioType
{ 
public:
	FString                                            UnrealFolderPath;                                           // 0x0040   (0x0010)  
	FString                                            WwiseFolderPath;                                            // 0x0050   (0x0010)  
	unsigned char                                      UnknownData00_6[0x58];                                      // 0x0060   (0x0058)  MISSED
};

/// Class /Script/AkAudio.AkGameplayStatics
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkGameplayStatics : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkCallbackInfo
/// Size: 0x0008 (0x000028 - 0x000030)
class UAkCallbackInfo : public UObject
{ 
public:
	UAkComponent*                                      AkComponent;                                                // 0x0028   (0x0008)  
};

/// Class /Script/AkAudio.AkEventCallbackInfo
/// Size: 0x0008 (0x000030 - 0x000038)
class UAkEventCallbackInfo : public UAkCallbackInfo
{ 
public:
	int32_t                                            PlayingID;                                                  // 0x0030   (0x0004)  
	int32_t                                            EventId;                                                    // 0x0034   (0x0004)  
};

/// Class /Script/AkAudio.AkMIDIEventCallbackInfo
/// Size: 0x0010 (0x000038 - 0x000048)
class UAkMIDIEventCallbackInfo : public UAkEventCallbackInfo
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0038   (0x0010)  MISSED
};

/// Class /Script/AkAudio.AkMarkerCallbackInfo
/// Size: 0x0018 (0x000038 - 0x000050)
class UAkMarkerCallbackInfo : public UAkEventCallbackInfo
{ 
public:
	int32_t                                            Identifier;                                                 // 0x0038   (0x0004)  
	int32_t                                            position;                                                   // 0x003C   (0x0004)  
	FString                                            Label;                                                      // 0x0040   (0x0010)  
};

/// Class /Script/AkAudio.AkDurationCallbackInfo
/// Size: 0x0018 (0x000038 - 0x000050)
class UAkDurationCallbackInfo : public UAkEventCallbackInfo
{ 
public:
	float                                              Duration;                                                   // 0x0038   (0x0004)  
	float                                              EstimatedDuration;                                          // 0x003C   (0x0004)  
	int32_t                                            AudioNodeID;                                                // 0x0040   (0x0004)  
	int32_t                                            MediaID;                                                    // 0x0044   (0x0004)  
	bool                                               bStreaming;                                                 // 0x0048   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0049   (0x0007)  MISSED
};

/// Class /Script/AkAudio.AkMusicSyncCallbackInfo
/// Size: 0x0040 (0x000030 - 0x000070)
class UAkMusicSyncCallbackInfo : public UAkCallbackInfo
{ 
public:
	int32_t                                            PlayingID;                                                  // 0x0030   (0x0004)  
	FAkSegmentInfo                                     SegmentInfo;                                                // 0x0034   (0x0024)  
	EAkCallbackType                                    MusicSyncType;                                              // 0x0058   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0059   (0x0007)  MISSED
	FString                                            UserCueName;                                                // 0x0060   (0x0010)  
};

/// Class /Script/AkAudio.AkGeometryComponent
/// Size: 0x0190 (0x000210 - 0x0003A0)
class UAkGeometryComponent : public UAkAcousticTextureSetComponent
{ 
public:
	AkMeshType                                         MeshType;                                                   // 0x0210   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0211   (0x0003)  MISSED
	int32_t                                            LOD;                                                        // 0x0214   (0x0004)  
	float                                              WeldingThreshold;                                           // 0x0218   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x021C   (0x0004)  MISSED
	TMap<UMaterialInterface*, FAkGeometrySurfaceOverride> StaticMeshSurfaceOverride;                               // 0x0220   (0x0050)  
	FAkGeometrySurfaceOverride                         CollisionMeshSurfaceOverride;                               // 0x0270   (0x0018)  
	bool                                               bEnableDiffraction;                                         // 0x0288:0 (0x0001)  
	bool                                               bEnableDiffractionOnBoundaryEdges;                          // 0x0288:1 (0x0001)  
	unsigned char                                      UnknownData02_4[0x7];                                       // 0x0289   (0x0007)  MISSED
	AActor*                                            AssociatedRoom;                                             // 0x0290   (0x0008)  
	unsigned char                                      UnknownData03_5[0x10];                                      // 0x0298   (0x0010)  MISSED
	FAkGeometryData                                    GeometryData;                                               // 0x02A8   (0x0050)  
	TMap<int32_t, double>                              SurfaceAreas;                                               // 0x02F8   (0x0050)  
	unsigned char                                      UnknownData04_6[0x58];                                      // 0x0348   (0x0058)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkGeometryComponent.UpdateGeometry
	void UpdateGeometry();                                                                                                   // [0x1462c00] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkGeometryComponent.SendGeometry
	void SendGeometry();                                                                                                     // [0x1462be0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkGeometryComponent.RemoveGeometry
	void RemoveGeometry();                                                                                                   // [0x1462bc0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkGeometryComponent.ConvertMesh
	void ConvertMesh();                                                                                                      // [0x14625c0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkGroupValue
/// Size: 0x0028 (0x000040 - 0x000068)
class UAkGroupValue : public UAkAudioType
{ 
public:
	TArray<TWeakObjectPtr>                             MediaDependencies;                                          // 0x0040   (0x0010)  
	uint32_t                                           GroupShortID;                                               // 0x0050   (0x0004)  
	unsigned char                                      UnknownData00_6[0x14];                                      // 0x0054   (0x0014)  MISSED
};

/// Class /Script/AkAudio.AkHololensInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkHololensInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkHololensAdvancedInitializationSettings          AdvancedSettings;                                           // 0x00C0   (0x0034)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00F4   (0x0004)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkHololensInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x1456d50] Final|Native|Public  
};

/// Class /Script/AkAudio.AkHololensPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkHololensPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkInitBankAssetData
/// Size: 0x0010 (0x000088 - 0x000098)
class UAkInitBankAssetData : public UAkAssetDataWithMedia
{ 
public:
	TArray<FAkPluginInfo>                              PluginInfos;                                                // 0x0088   (0x0010)  
};

/// Class /Script/AkAudio.AkInitBank
/// Size: 0x0020 (0x000050 - 0x000070)
class UAkInitBank : public UAkAssetBase
{ 
public:
	TArray<FString>                                    AvailableAudioCultures;                                     // 0x0050   (0x0010)  
	FString                                            DefaultLanguage;                                            // 0x0060   (0x0010)  
};

/// Class /Script/AkAudio.AkIOSInitializationSettings
/// Size: 0x00D8 (0x000028 - 0x000100)
class UAkIOSInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkAudioSession                                    AudioSession;                                               // 0x0098   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00A4   (0x0004)  MISSED
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x00A8   (0x0028)  
	FAkAdvancedInitializationSettings                  AdvancedSettings;                                           // 0x00D0   (0x002C)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00FC   (0x0004)  MISSED
};

/// Class /Script/AkAudio.AkIOSPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkIOSPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkItemBoolPropertiesConv
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkItemBoolPropertiesConv : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkItemBoolProperties
/// Size: 0x0040 (0x000108 - 0x000148)
class UAkItemBoolProperties : public UWidget
{ 
public:
	FMulticastInlineDelegate                           OnSelectionChanged;                                         // 0x0108   (0x0010)  
	FMulticastInlineDelegate                           OnPropertyDragged;                                          // 0x0118   (0x0010)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0128   (0x0020)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkItemBoolProperties.SetSearchText
	void SetSearchText(FString newText);                                                                                     // [0x1467430] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkItemBoolProperties.GetSelectedProperty
	FString GetSelectedProperty();                                                                                           // [0x1466f80] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkItemBoolProperties.GetSearchText
	FString GetSearchText();                                                                                                 // [0x1466f00] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkItemPropertiesConv
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkItemPropertiesConv : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkItemProperties
/// Size: 0x0040 (0x000108 - 0x000148)
class UAkItemProperties : public UWidget
{ 
public:
	FMulticastInlineDelegate                           OnSelectionChanged;                                         // 0x0108   (0x0010)  
	FMulticastInlineDelegate                           OnPropertyDragged;                                          // 0x0118   (0x0010)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0128   (0x0020)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkItemProperties.SetSearchText
	void SetSearchText(FString newText);                                                                                     // [0x1467430] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkItemProperties.GetSelectedProperty
	FString GetSelectedProperty();                                                                                           // [0x1467000] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkItemProperties.GetSearchText
	FString GetSearchText();                                                                                                 // [0x1466f00] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkLateReverbComponent
/// Size: 0x0080 (0x000200 - 0x000280)
class UAkLateReverbComponent : public USceneComponent
{ 
public:
	bool                                               bEnable;                                                    // 0x01F8:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x01F9   (0x0003)  MISSED
	float                                              SendLevel;                                                  // 0x01FC   (0x0004)  
	float                                              FadeRate;                                                   // 0x0200   (0x0004)  
	float                                              Priority;                                                   // 0x0204   (0x0004)  
	bool                                               AutoAssignAuxBus;                                           // 0x0208   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0209   (0x0007)  MISSED
	UAkAuxBus*                                         AuxBus;                                                     // 0x0210   (0x0008)  
	FString                                            AuxBusName;                                                 // 0x0218   (0x0010)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x0228   (0x0008)  MISSED
	UAkAuxBus*                                         AuxBusManual;                                               // 0x0230   (0x0008)  
	unsigned char                                      UnknownData03_6[0x48];                                      // 0x0238   (0x0048)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkLateReverbComponent.AssociateAkTextureSetComponent
	void AssociateAkTextureSetComponent(UAkAcousticTextureSetComponent* textureSetComponent);                                // [0x1466bc0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkLinuxInitializationSettings
/// Size: 0x00C8 (0x000028 - 0x0000F0)
class UAkLinuxInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings;                                      // 0x00C0   (0x0030)  


	/// Functions
	// Function /Script/AkAudio.AkLinuxInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x1456d50] Final|Native|Public  
};

/// Class /Script/AkAudio.AkLinuxPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkLinuxPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkMacInitializationSettings
/// Size: 0x00C8 (0x000028 - 0x0000F0)
class UAkMacInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings;                                      // 0x00C0   (0x0030)  


	/// Functions
	// Function /Script/AkAudio.AkMacInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x1456d50] Final|Native|Public  
};

/// Class /Script/AkAudio.AkMacPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkMacPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkMediaAssetData
/// Size: 0x0050 (0x000028 - 0x000078)
class UAkMediaAssetData : public UObject
{ 
public:
	bool                                               IsStreamed;                                                 // 0x0028   (0x0001)  
	bool                                               UseDeviceMemory;                                            // 0x0029   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x002A   (0x0006)  MISSED
	FString                                            Language;                                                   // 0x0030   (0x0010)  
	FString                                            AssetPlatform;                                              // 0x0040   (0x0010)  
	unsigned char                                      UnknownData01_6[0x28];                                      // 0x0050   (0x0028)  MISSED
};

/// Class /Script/AkAudio.AkMediaAsset
/// Size: 0x0050 (0x000028 - 0x000078)
class UAkMediaAsset : public UObject
{ 
public:
	uint32_t                                           ID;                                                         // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	FString                                            MediaName;                                                  // 0x0030   (0x0010)  
	bool                                               AutoLoad;                                                   // 0x0040   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0041   (0x0007)  MISSED
	TArray<UObject*>                                   UserData;                                                   // 0x0048   (0x0010)  
	FString                                            Language;                                                   // 0x0058   (0x0010)  
	UAkMediaAssetData*                                 CurrentMediaAssetData;                                      // 0x0068   (0x0008)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0070   (0x0008)  MISSED
};

/// Class /Script/AkAudio.AkLocalizedMediaAsset
/// Size: 0x0000 (0x000078 - 0x000078)
class UAkLocalizedMediaAsset : public UAkMediaAsset
{ 
public:
};

/// Class /Script/AkAudio.AkExternalMediaAsset
/// Size: 0x0060 (0x000078 - 0x0000D8)
class UAkExternalMediaAsset : public UAkMediaAsset
{ 
public:
	unsigned char                                      UnknownData00_1[0x60];                                      // 0x0078   (0x0060)  MISSED
};

/// Class /Script/AkAudio.AkPlatformInitialisationSettingsBase
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkPlatformInitialisationSettingsBase : public UInterface
{ 
public:
};

/// Class /Script/AkAudio.AkPS4InitializationSettings
/// Size: 0x00C8 (0x000028 - 0x0000F0)
class UAkPS4InitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettings                    CommonSettings;                                             // 0x0030   (0x0060)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0090   (0x0028)  
	FAkPS4AdvancedInitializationSettings               AdvancedSettings;                                           // 0x00B8   (0x0038)  


	/// Functions
	// Function /Script/AkAudio.AkPS4InitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x14670b0] Final|Native|Public  
};

/// Class /Script/AkAudio.AkPS4PlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkPS4PlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkPS5InitializationSettings
/// Size: 0x00C8 (0x000028 - 0x0000F0)
class UAkPS5InitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettings                    CommonSettings;                                             // 0x0030   (0x0060)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0090   (0x0028)  
	FAkPS5AdvancedInitializationSettings               AdvancedSettings;                                           // 0x00B8   (0x0034)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00EC   (0x0004)  MISSED
};

/// Class /Script/AkAudio.AkDPXInitializationSettings
/// Size: 0x0000 (0x0000F0 - 0x0000F0)
class UAkDPXInitializationSettings : public UAkPS5InitializationSettings
{ 
public:
};

/// Class /Script/AkAudio.AkPS5PlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkPS5PlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkReverbVolume
/// Size: 0x0038 (0x000258 - 0x000290)
class AAkReverbVolume : public AVolume
{ 
public:
	bool                                               bEnabled;                                                   // 0x0258:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x7];                                       // 0x0259   (0x0007)  MISSED
	UAkAuxBus*                                         AuxBus;                                                     // 0x0260   (0x0008)  
	FString                                            AuxBusName;                                                 // 0x0268   (0x0010)  
	float                                              SendLevel;                                                  // 0x0278   (0x0004)  
	float                                              FadeRate;                                                   // 0x027C   (0x0004)  
	float                                              Priority;                                                   // 0x0280   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0284   (0x0004)  MISSED
	UAkLateReverbComponent*                            LateReverbComponent;                                        // 0x0288   (0x0008)  
};

/// Class /Script/AkAudio.AkRoomComponent
/// Size: 0x0030 (0x000220 - 0x000250)
class UAkRoomComponent : public UAkGameObject
{ 
public:
	bool                                               bEnable;                                                    // 0x0218:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0219   (0x0003)  MISSED
	bool                                               bDynamic;                                                   // 0x021C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x021D   (0x0003)  MISSED
	float                                              Priority;                                                   // 0x0220   (0x0004)  
	float                                              WallOcclusion;                                              // 0x0224   (0x0004)  
	float                                              AuxSendLevel;                                               // 0x0228   (0x0004)  
	bool                                               AutoPost;                                                   // 0x022C   (0x0001)  
	unsigned char                                      UnknownData02_5[0xB];                                       // 0x022D   (0x000B)  MISSED
	UAkAcousticTextureSetComponent*                    GeometryComponent;                                          // 0x0238   (0x0008)  
	unsigned char                                      UnknownData03_6[0x10];                                      // 0x0240   (0x0010)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkRoomComponent.SetGeometryComponent
	void SetGeometryComponent(UAkAcousticTextureSetComponent* textureSetComponent);                                          // [0x1467280] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkRoomComponent.GetPrimitiveParent
	UPrimitiveComponent* GetPrimitiveParent();                                                                               // [0x1466ed0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkRtpc
/// Size: 0x0000 (0x000040 - 0x000040)
class UAkRtpc : public UAkAudioType
{ 
public:
};

/// Class /Script/AkAudio.AkSettings
/// Size: 0x02B8 (0x000028 - 0x0002E0)
class UAkSettings : public UObject
{ 
public:
	char                                               MaxSimultaneousReverbVolumes;                               // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0029   (0x0007)  MISSED
	FFilePath                                          WwiseProjectPath;                                           // 0x0030   (0x0010)  
	FDirectoryPath                                     WwiseSoundDataFolder;                                       // 0x0040   (0x0010)  
	bool                                               bAutoConnectToWAAPI;                                        // 0x0050   (0x0001)  
	TEnumAsByte<ECollisionChannel>                     DefaultOcclusionCollisionChannel;                           // 0x0051   (0x0001)  
	TEnumAsByte<ECollisionChannel>                     DefaultFitToGeometryCollisionChannel;                       // 0x0052   (0x0001)  
	unsigned char                                      UnknownData01_5[0x5];                                       // 0x0053   (0x0005)  MISSED
	TMap<TWeakObjectPtr, FAkGeometrySurfacePropertiesToMap> AkGeometryMap;                                         // 0x0058   (0x0050)  
	float                                              GlobalDecayAbsorption;                                      // 0x00A8   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x00AC   (0x0004)  MISSED
	TWeakObjectPtr<UAkAuxBus*>                         DefaultReverbAuxBus;                                        // 0x00B0   (0x0028)  
	TMap<float, TWeakObjectPtr>                        EnvironmentDecayAuxBusMap;                                  // 0x00D8   (0x0050)  
	FString                                            HFDampingName;                                              // 0x0128   (0x0010)  
	FString                                            DecayEstimateName;                                          // 0x0138   (0x0010)  
	FString                                            TimeToFirstReflectionName;                                  // 0x0148   (0x0010)  
	TWeakObjectPtr<UAkRtpc*>                           HFDampingRTPC;                                              // 0x0158   (0x0028)  
	TWeakObjectPtr<UAkRtpc*>                           DecayEstimateRTPC;                                          // 0x0180   (0x0028)  
	TWeakObjectPtr<UAkRtpc*>                           TimeToFirstReflectionRTPC;                                  // 0x01A8   (0x0028)  
	TWeakObjectPtr<UAkAudioEvent*>                     AudioInputEvent;                                            // 0x01D0   (0x0028)  
	TMap<FGuid, FAkAcousticTextureParams>              AcousticTextureParamsMap;                                   // 0x01F8   (0x0050)  
	bool                                               SplitSwitchContainerMedia;                                  // 0x0248   (0x0001)  
	bool                                               SplitMediaPerFolder;                                        // 0x0249   (0x0001)  
	bool                                               UseEventBasedPackaging;                                     // 0x024A   (0x0001)  
	bool                                               EnableAutomaticAssetSynchronization;                        // 0x024B   (0x0001)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x024C   (0x0004)  MISSED
	FString                                            CommandletCommitMessage;                                    // 0x0250   (0x0010)  
	TMap<FString, FString>                             UnrealCultureToWwiseCulture;                                // 0x0260   (0x0050)  
	bool                                               AskedToUseNewAssetManagement;                               // 0x02B0   (0x0001)  
	bool                                               bEnableMultiCoreRendering;                                  // 0x02B1   (0x0001)  
	bool                                               MigratedEnableMultiCoreRendering;                           // 0x02B2   (0x0001)  
	bool                                               FixupRedirectorsDuringMigration;                            // 0x02B3   (0x0001)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x02B4   (0x0004)  MISSED
	FDirectoryPath                                     WwiseWindowsInstallationPath;                               // 0x02B8   (0x0010)  
	FFilePath                                          WwiseMacInstallationPath;                                   // 0x02C8   (0x0010)  
	unsigned char                                      UnknownData05_6[0x8];                                       // 0x02D8   (0x0008)  MISSED
};

/// Class /Script/AkAudio.AkSettingsPerUser
/// Size: 0x0058 (0x000028 - 0x000080)
class UAkSettingsPerUser : public UObject
{ 
public:
	FDirectoryPath                                     WwiseWindowsInstallationPath;                               // 0x0028   (0x0010)  
	FFilePath                                          WwiseMacInstallationPath;                                   // 0x0038   (0x0010)  
	bool                                               EnableAutomaticAssetSynchronization;                        // 0x0048   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0049   (0x0007)  MISSED
	FString                                            WaapiIPAddress;                                             // 0x0050   (0x0010)  
	uint32_t                                           WaapiPort;                                                  // 0x0060   (0x0004)  
	bool                                               bAutoConnectToWAAPI;                                        // 0x0064   (0x0001)  
	bool                                               AutoSyncSelection;                                          // 0x0065   (0x0001)  
	bool                                               SuppressWwiseProjectPathWarnings;                           // 0x0066   (0x0001)  
	bool                                               SoundDataGenerationSkipLanguage;                            // 0x0067   (0x0001)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x0068   (0x0018)  MISSED
};

/// Class /Script/AkAudio.AkSlider
/// Size: 0x0428 (0x000108 - 0x000530)
class UAkSlider : public UWidget
{ 
public:
	float                                              Value;                                                      // 0x0108   (0x0004)  
	FDelegateProperty                                  ValueDelegate;                                              // 0x010C   (0x0010)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x011C   (0x0004)  MISSED
	FSliderStyle                                       WidgetStyle;                                                // 0x0120   (0x0340)  
	TEnumAsByte<EOrientation>                          Orientation;                                                // 0x0460   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0461   (0x0003)  MISSED
	FLinearColor                                       SliderBarColor;                                             // 0x0464   (0x0010)  
	FLinearColor                                       SliderHandleColor;                                          // 0x0474   (0x0010)  
	bool                                               IndentHandle;                                               // 0x0484   (0x0001)  
	bool                                               Locked;                                                     // 0x0485   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x0486   (0x0002)  MISSED
	float                                              StepSize;                                                   // 0x0488   (0x0004)  
	bool                                               IsFocusable;                                                // 0x048C   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x048D   (0x0003)  MISSED
	FAkPropertyToControl                               ThePropertyToControl;                                       // 0x0490   (0x0010)  
	FAkWwiseItemToControl                              ItemToControl;                                              // 0x04A0   (0x0040)  
	FMulticastInlineDelegate                           OnValueChanged;                                             // 0x04E0   (0x0010)  
	FMulticastInlineDelegate                           OnItemDropped;                                              // 0x04F0   (0x0010)  
	FMulticastInlineDelegate                           OnPropertyDropped;                                          // 0x0500   (0x0010)  
	unsigned char                                      UnknownData04_6[0x20];                                      // 0x0510   (0x0020)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkSlider.SetValue
	void SetValue(float InValue);                                                                                            // [0x1467670] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetStepSize
	void SetStepSize(float InValue);                                                                                         // [0x14675f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetSliderHandleColor
	void SetSliderHandleColor(FLinearColor InValue);                                                                         // [0x1467560] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetSliderBarColor
	void SetSliderBarColor(FLinearColor InValue);                                                                            // [0x14674d0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetLocked
	void SetLocked(bool InValue);                                                                                            // [0x14673a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetIndentHandle
	void SetIndentHandle(bool InValue);                                                                                      // [0x1467310] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetAkSliderItemProperty
	void SetAkSliderItemProperty(FString ItemProperty);                                                                      // [0x14671e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetAkSliderItemId
	void SetAkSliderItemId(FGuid& ItemId);                                                                                   // [0x1467140] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.GetValue
	float GetValue();                                                                                                        // [0x1467080] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkSlider.GetAkSliderItemProperty
	FString GetAkSliderItemProperty();                                                                                       // [0x1466e80] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkSlider.GetAkSliderItemId
	FGuid GetAkSliderItemId();                                                                                               // [0x1466e40] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkSpatialAudioVolume
/// Size: 0x0018 (0x000258 - 0x000270)
class AAkSpatialAudioVolume : public AVolume
{ 
public:
	UAkSurfaceReflectorSetComponent*                   SurfaceReflectorSet;                                        // 0x0258   (0x0008)  
	UAkLateReverbComponent*                            LateReverb;                                                 // 0x0260   (0x0008)  
	UAkRoomComponent*                                  Room;                                                       // 0x0268   (0x0008)  
};

/// Class /Script/AkAudio.AkSpotReflector
/// Size: 0x0028 (0x000220 - 0x000248)
class AAkSpotReflector : public AActor
{ 
public:
	UAkAuxBus*                                         EarlyReflectionAuxBus;                                      // 0x0220   (0x0008)  
	FString                                            EarlyReflectionAuxBusName;                                  // 0x0228   (0x0010)  
	UAkAcousticTexture*                                AcousticTexture;                                            // 0x0238   (0x0008)  
	float                                              DistanceScalingFactor;                                      // 0x0240   (0x0004)  
	float                                              Level;                                                      // 0x0244   (0x0004)  
};

/// Class /Script/AkAudio.AkStadiaInitializationSettings
/// Size: 0x00C8 (0x000028 - 0x0000F0)
class UAkStadiaInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings;                                      // 0x00C0   (0x0030)  
};

/// Class /Script/AkAudio.AkQuailInitializationSettings
/// Size: 0x0000 (0x0000F0 - 0x0000F0)
class UAkQuailInitializationSettings : public UAkStadiaInitializationSettings
{ 
public:
};

/// Class /Script/AkAudio.AkStadiaPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkStadiaPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkQuailPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkQuailPlatformInfo : public UAkStadiaPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkStateValue
/// Size: 0x0000 (0x000068 - 0x000068)
class UAkStateValue : public UAkGroupValue
{ 
public:
};

/// Class /Script/AkAudio.AkSubmixInputComponent
/// Size: 0x0060 (0x000410 - 0x000470)
class UAkSubmixInputComponent : public UAkAudioInputComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0410   (0x0008)  MISSED
	USoundSubmix*                                      SubmixToRecord;                                             // 0x0418   (0x0008)  
	unsigned char                                      UnknownData01_6[0x50];                                      // 0x0420   (0x0050)  MISSED
};

/// Class /Script/AkAudio.AkSurfaceReflectorSetComponent
/// Size: 0x0030 (0x000210 - 0x000240)
class UAkSurfaceReflectorSetComponent : public UAkAcousticTextureSetComponent
{ 
public:
	bool                                               bEnableSurfaceReflectors;                                   // 0x0210:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x7];                                       // 0x0211   (0x0007)  MISSED
	TArray<FAkSurfacePoly>                             AcousticPolys;                                              // 0x0218   (0x0010)  
	bool                                               bEnableDiffraction;                                         // 0x0228:0 (0x0001)  
	bool                                               bEnableDiffractionOnBoundaryEdges;                          // 0x0228:1 (0x0001)  
	unsigned char                                      UnknownData01_4[0x7];                                       // 0x0229   (0x0007)  MISSED
	AActor*                                            AssociatedRoom;                                             // 0x0230   (0x0008)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0238   (0x0008)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkSurfaceReflectorSetComponent.UpdateSurfaceReflectorSet
	void UpdateSurfaceReflectorSet();                                                                                        // [0x146d830] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSurfaceReflectorSetComponent.SendSurfaceReflectorSet
	void SendSurfaceReflectorSet();                                                                                          // [0x146c800] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSurfaceReflectorSetComponent.RemoveSurfaceReflectorSet
	void RemoveSurfaceReflectorSet();                                                                                        // [0x146c7e0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkSwitchInitializationSettings
/// Size: 0x00C8 (0x000028 - 0x0000F0)
class UAkSwitchInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithCommSelection          CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings;                                      // 0x00C0   (0x0030)  


	/// Functions
	// Function /Script/AkAudio.AkSwitchInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x1456d50] Final|Native|Public  
};

/// Class /Script/AkAudio.AkSwitchPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkSwitchPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkSwitchValue
/// Size: 0x0000 (0x000068 - 0x000068)
class UAkSwitchValue : public UAkGroupValue
{ 
public:
};

/// Class /Script/AkAudio.AkTrigger
/// Size: 0x0000 (0x000040 - 0x000040)
class UAkTrigger : public UAkAudioType
{ 
public:
};

/// Class /Script/AkAudio.AkTVOSInitializationSettings
/// Size: 0x00D8 (0x000028 - 0x000100)
class UAkTVOSInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkAudioSession                                    AudioSession;                                               // 0x0098   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00A4   (0x0004)  MISSED
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x00A8   (0x0028)  
	FAkAdvancedInitializationSettings                  AdvancedSettings;                                           // 0x00D0   (0x002C)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00FC   (0x0004)  MISSED
};

/// Class /Script/AkAudio.AkTVOSPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkTVOSPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkWaapiCalls
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkWaapiCalls : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.SAkWaapiFieldNamesConv
/// Size: 0x0000 (0x000028 - 0x000028)
class USAkWaapiFieldNamesConv : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkWaapiJsonManager
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkWaapiJsonManager : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkWaapiUriConv
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkWaapiUriConv : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkWindowsInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkWindowsInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkWindowsAdvancedInitializationSettings           AdvancedSettings;                                           // 0x00C0   (0x0038)  


	/// Functions
	// Function /Script/AkAudio.AkWindowsInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x1456d50] Final|Native|Public  
};

/// Class /Script/AkAudio.AkWin32PlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkWin32PlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkWin64PlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkWin64PlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkWindowsPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkWindowsPlatformInfo : public UAkWin64PlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkWinGDKInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkWinGDKInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkWinGDKAdvancedInitializationSettings            AdvancedSettings;                                           // 0x00C0   (0x0034)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00F4   (0x0004)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkWinGDKInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x1456d50] Final|Native|Public  
};

/// Class /Script/AkAudio.AkWinAnvilInitializationSettings
/// Size: 0x0000 (0x0000F8 - 0x0000F8)
class UAkWinAnvilInitializationSettings : public UAkWinGDKInitializationSettings
{ 
public:
};

/// Class /Script/AkAudio.AkWinGDKPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkWinGDKPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkWinAnvilPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkWinAnvilPlatformInfo : public UAkWinGDKPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkWwiseTree
/// Size: 0x0040 (0x000108 - 0x000148)
class UAkWwiseTree : public UWidget
{ 
public:
	FMulticastInlineDelegate                           OnSelectionChanged;                                         // 0x0108   (0x0010)  
	FMulticastInlineDelegate                           OnItemDragged;                                              // 0x0118   (0x0010)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0128   (0x0020)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkWwiseTree.SetSearchText
	void SetSearchText(FString newText);                                                                                     // [0x1467430] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkWwiseTree.GetSelectedItem
	FAkWwiseObjectDetails GetSelectedItem();                                                                                 // [0x1470f80] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkWwiseTree.GetSearchText
	FString GetSearchText();                                                                                                 // [0x1470f00] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkWwiseTreeSelector
/// Size: 0x0060 (0x000108 - 0x000168)
class UAkWwiseTreeSelector : public UWidget
{ 
public:
	FMulticastInlineDelegate                           OnSelectionChanged;                                         // 0x0108   (0x0010)  
	FMulticastInlineDelegate                           OnItemDragged;                                              // 0x0118   (0x0010)  
	unsigned char                                      UnknownData00_6[0x40];                                      // 0x0128   (0x0040)  MISSED
};

/// Class /Script/AkAudio.AkXboxOneGDKInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkXboxOneGDKInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettings                    CommonSettings;                                             // 0x0030   (0x0060)  
	FAkXboxOneGDKApuHeapInitializationSettings         ApuHeapSettings;                                            // 0x0090   (0x0008)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkXboxOneGDKAdvancedInitializationSettings        AdvancedSettings;                                           // 0x00C0   (0x0034)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00F4   (0x0004)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkXboxOneGDKInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x1456d50] Final|Native|Public  
};

/// Class /Script/AkAudio.AkXboxOneAnvilInitializationSettings
/// Size: 0x0000 (0x0000F8 - 0x0000F8)
class UAkXboxOneAnvilInitializationSettings : public UAkXboxOneGDKInitializationSettings
{ 
public:
};

/// Class /Script/AkAudio.AkXB1InitializationSettings
/// Size: 0x0000 (0x0000F8 - 0x0000F8)
class UAkXB1InitializationSettings : public UAkXboxOneGDKInitializationSettings
{ 
public:
};

/// Class /Script/AkAudio.AkXboxOneGDKPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkXboxOneGDKPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkXboxOneAnvilPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkXboxOneAnvilPlatformInfo : public UAkXboxOneGDKPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkXB1PlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkXB1PlatformInfo : public UAkXboxOneGDKPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkXboxOneInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkXboxOneInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettings                    CommonSettings;                                             // 0x0030   (0x0060)  
	FAkXboxOneApuHeapInitializationSettings            ApuHeapSettings;                                            // 0x0090   (0x0008)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkXboxOneAdvancedInitializationSettings           AdvancedSettings;                                           // 0x00C0   (0x0034)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00F4   (0x0004)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkXboxOneInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x1456d50] Final|Native|Public  
};

/// Class /Script/AkAudio.AkXboxOnePlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkXboxOnePlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkXSXInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkXSXInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettings                    CommonSettings;                                             // 0x0030   (0x0060)  
	FAkXSXApuHeapInitializationSettings                ApuHeapSettings;                                            // 0x0090   (0x0008)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkXSXAdvancedInitializationSettings               AdvancedSettings;                                           // 0x00C0   (0x0038)  


	/// Functions
	// Function /Script/AkAudio.AkXSXInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x1456d50] Final|Native|Public  
};

/// Class /Script/AkAudio.AkMPXInitializationSettings
/// Size: 0x0000 (0x0000F8 - 0x0000F8)
class UAkMPXInitializationSettings : public UAkXSXInitializationSettings
{ 
public:
};

/// Class /Script/AkAudio.AkXSXPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkXSXPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.MovieSceneAkAudioEventSection
/// Size: 0x00E8 (0x0000E8 - 0x0001D0)
class UMovieSceneAkAudioEventSection : public UMovieSceneSection
{ 
public:
	unsigned char                                      UnknownData00_2[0x40];                                      // 0x00E8   (0x0040)  MISSED
	UAkAudioEvent*                                     Event;                                                      // 0x0128   (0x0008)  
	bool                                               RetriggerEvent;                                             // 0x0130   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0131   (0x0003)  MISSED
	int32_t                                            ScrubTailLengthMs;                                          // 0x0134   (0x0004)  
	bool                                               StopAtSectionEnd;                                           // 0x0138   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0139   (0x0007)  MISSED
	FString                                            EventName;                                                  // 0x0140   (0x0010)  
	unsigned char                                      UnknownData03_5[0x20];                                      // 0x0150   (0x0020)  MISSED
	float                                              MaxSourceDuration;                                          // 0x0170   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x0174   (0x0004)  MISSED
	FString                                            MaxDurationSourceID;                                        // 0x0178   (0x0010)  
	unsigned char                                      UnknownData05_6[0x48];                                      // 0x0188   (0x0048)  MISSED
};

/// Class /Script/AkAudio.MovieSceneAkTrack
/// Size: 0x0018 (0x000090 - 0x0000A8)
class UMovieSceneAkTrack : public UMovieSceneTrack
{ 
public:
	TArray<UMovieSceneSection*>                        Sections;                                                   // 0x0090   (0x0010)  
	bool                                               bIsAMasterTrack;                                            // 0x00A0:0 (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00A1   (0x0007)  MISSED
};

/// Class /Script/AkAudio.MovieSceneAkAudioEventTrack
/// Size: 0x0008 (0x0000A8 - 0x0000B0)
class UMovieSceneAkAudioEventTrack : public UMovieSceneAkTrack
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x00A8   (0x0008)  MISSED
};

/// Class /Script/AkAudio.MovieSceneAkAudioRTPCSection
/// Size: 0x0168 (0x0000E8 - 0x000250)
class UMovieSceneAkAudioRTPCSection : public UMovieSceneSection
{ 
public:
	UAkRtpc*                                           RTPC;                                                       // 0x00E8   (0x0008)  
	FString                                            Name;                                                       // 0x00F0   (0x0010)  
	FRichCurve                                         FloatCurve;                                                 // 0x0100   (0x0080)  
	FMovieSceneFloatChannelSerializationHelper         FloatChannelSerializationHelper;                            // 0x0180   (0x0030)  
	FMovieSceneFloatChannel                            RTPCChannel;                                                // 0x01B0   (0x00A0)  
};

/// Class /Script/AkAudio.MovieSceneAkAudioRTPCTrack
/// Size: 0x0008 (0x0000A8 - 0x0000B0)
class UMovieSceneAkAudioRTPCTrack : public UMovieSceneAkTrack
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x00A8   (0x0008)  MISSED
};

/// Class /Script/AkAudio.PostEventAsync
/// Size: 0x0070 (0x000030 - 0x0000A0)
class UPostEventAsync : public UBlueprintAsyncActionBase
{ 
public:
	FMulticastInlineDelegate                           Completed;                                                  // 0x0030   (0x0010)  
	unsigned char                                      UnknownData00_6[0x60];                                      // 0x0040   (0x0060)  MISSED


	/// Functions
	// Function /Script/AkAudio.PostEventAsync.PostEventAsync
	UPostEventAsync* PostEventAsync(UObject* WorldContextObject, UAkAudioEvent* akEvent, AActor* Actor, int32_t CallbackMask, FDelegateProperty& PostEventCallback, TArray<FAkExternalSourceInfo>& ExternalSources, bool bStopWhenAttachedToDestroyed); // [0x14710e0] Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.PostEventAsync.PollPostEventFuture
	void PollPostEventFuture();                                                                                              // [0x14710a0] Final|Native|Private 
};

/// Class /Script/AkAudio.PostEventAtLocationAsync
/// Size: 0x0050 (0x000030 - 0x000080)
class UPostEventAtLocationAsync : public UBlueprintAsyncActionBase
{ 
public:
	FMulticastInlineDelegate                           Completed;                                                  // 0x0030   (0x0010)  
	unsigned char                                      UnknownData00_6[0x40];                                      // 0x0040   (0x0040)  MISSED


	/// Functions
	// Function /Script/AkAudio.PostEventAtLocationAsync.PostEventAtLocationAsync
	UPostEventAtLocationAsync* PostEventAtLocationAsync(UObject* WorldContextObject, UAkAudioEvent* akEvent, FVector Location, FRotator Orientation); // [0x1471370] Final|BlueprintCosmetic|Native|Static|Public|HasDefaults|BlueprintCallable 
	// Function /Script/AkAudio.PostEventAtLocationAsync.PollPostEventFuture
	void PollPostEventFuture();                                                                                              // [0x14710c0] Final|Native|Private 
};

/// Struct /Script/AkAudio.AKWaapiJsonObject
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAKWaapiJsonObject
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/AkAudio.AkWaapiSubscriptionId
/// Size: 0x0008 (0x000000 - 0x000008)
struct FAkWaapiSubscriptionId
{ 
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/AkAudio.AkAdvancedInitializationSettings
/// Size: 0x002C (0x000000 - 0x00002C)
struct FAkAdvancedInitializationSettings
{ 
	uint32_t                                           IO_MemorySize;                                              // 0x0000   (0x0004)  
	uint32_t                                           IO_Granularity;                                             // 0x0004   (0x0004)  
	float                                              TargetAutoStreamBufferLength;                               // 0x0008   (0x0004)  
	bool                                               UseStreamCache;                                             // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x000D   (0x0003)  MISSED
	uint32_t                                           MaximumPinnedBytesInCache;                                  // 0x0010   (0x0004)  
	bool                                               EnableGameSyncPreparation;                                  // 0x0014   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0015   (0x0003)  MISSED
	uint32_t                                           ContinuousPlaybackLookAhead;                                // 0x0018   (0x0004)  
	uint32_t                                           MonitorQueuePoolSize;                                       // 0x001C   (0x0004)  
	uint32_t                                           MaximumHardwareTimeoutMs;                                   // 0x0020   (0x0004)  
	bool                                               DebugOutOfRangeCheckEnabled;                                // 0x0024   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0025   (0x0003)  MISSED
	float                                              DebugOutOfRangeLimit;                                       // 0x0028   (0x0004)  
};

/// Struct /Script/AkAudio.AkAdvancedInitializationSettingsWithMultiCoreRendering
/// Size: 0x0004 (0x00002C - 0x000030)
struct FAkAdvancedInitializationSettingsWithMultiCoreRendering : FAkAdvancedInitializationSettings
{ 
	bool                                               EnableMultiCoreRendering;                                   // 0x002C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x002D   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkAndroidAdvancedInitializationSettings
/// Size: 0x0008 (0x000030 - 0x000038)
struct FAkAndroidAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	uint32_t                                           AudioAPI;                                                   // 0x0030   (0x0004)  
	bool                                               RoundFrameSizeToHardwareSize;                               // 0x0034   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0035   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkAudioSession
/// Size: 0x000C (0x000000 - 0x00000C)
struct FAkAudioSession
{ 
	EAkAudioSessionCategory                            AudioSessionCategory;                                       // 0x0000   (0x0004)  
	uint32_t                                           AudioSessionCategoryOptions;                                // 0x0004   (0x0004)  
	EAkAudioSessionMode                                AudioSessionMode;                                           // 0x0008   (0x0004)  
};

/// Struct /Script/AkAudio.AkExternalSourceInfo
/// Size: 0x0038 (0x000000 - 0x000038)
struct FAkExternalSourceInfo
{ 
	FString                                            ExternalSrcName;                                            // 0x0000   (0x0010)  
	AkCodecId                                          CodecID;                                                    // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0011   (0x0007)  MISSED
	FString                                            Filename;                                                   // 0x0018   (0x0010)  
	UAkExternalMediaAsset*                             ExternalSourceAsset;                                        // 0x0028   (0x0008)  
	bool                                               IsStreamed;                                                 // 0x0030   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Struct /Script/AkAudio.AkSegmentInfo
/// Size: 0x0024 (0x000000 - 0x000024)
struct FAkSegmentInfo
{ 
	int32_t                                            CurrentPosition;                                            // 0x0000   (0x0004)  
	int32_t                                            PreEntryDuration;                                           // 0x0004   (0x0004)  
	int32_t                                            ActiveDuration;                                             // 0x0008   (0x0004)  
	int32_t                                            PostExitDuration;                                           // 0x000C   (0x0004)  
	int32_t                                            RemainingLookAheadTime;                                     // 0x0010   (0x0004)  
	float                                              BeatDuration;                                               // 0x0014   (0x0004)  
	float                                              BarDuration;                                                // 0x0018   (0x0004)  
	float                                              GridDuration;                                               // 0x001C   (0x0004)  
	float                                              GridOffset;                                                 // 0x0020   (0x0004)  
};

/// Struct /Script/AkAudio.AkMidiEventBase
/// Size: 0x0002 (0x000000 - 0x000002)
struct FAkMidiEventBase
{ 
	EAkMidiEventType                                   Type;                                                       // 0x0000   (0x0001)  
	char                                               Chan;                                                       // 0x0001   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiProgramChange
/// Size: 0x0001 (0x000002 - 0x000003)
struct FAkMidiProgramChange : FAkMidiEventBase
{ 
	char                                               ProgramNum;                                                 // 0x0002   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiChannelAftertouch
/// Size: 0x0001 (0x000002 - 0x000003)
struct FAkMidiChannelAftertouch : FAkMidiEventBase
{ 
	char                                               Value;                                                      // 0x0002   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiNoteAftertouch
/// Size: 0x0002 (0x000002 - 0x000004)
struct FAkMidiNoteAftertouch : FAkMidiEventBase
{ 
	char                                               Note;                                                       // 0x0002   (0x0001)  
	char                                               Value;                                                      // 0x0003   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiPitchBend
/// Size: 0x0006 (0x000002 - 0x000008)
struct FAkMidiPitchBend : FAkMidiEventBase
{ 
	char                                               ValueLsb;                                                   // 0x0002   (0x0001)  
	char                                               ValueMsb;                                                   // 0x0003   (0x0001)  
	int32_t                                            FullValue;                                                  // 0x0004   (0x0004)  
};

/// Struct /Script/AkAudio.AkMidiCc
/// Size: 0x0002 (0x000002 - 0x000004)
struct FAkMidiCc : FAkMidiEventBase
{ 
	EAkMidiCcValues                                    Cc;                                                         // 0x0002   (0x0001)  
	char                                               Value;                                                      // 0x0003   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiNoteOnOff
/// Size: 0x0002 (0x000002 - 0x000004)
struct FAkMidiNoteOnOff : FAkMidiEventBase
{ 
	char                                               Note;                                                       // 0x0002   (0x0001)  
	char                                               Velocity;                                                   // 0x0003   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiGeneric
/// Size: 0x0002 (0x000002 - 0x000004)
struct FAkMidiGeneric : FAkMidiEventBase
{ 
	char                                               Param1;                                                     // 0x0002   (0x0001)  
	char                                               Param2;                                                     // 0x0003   (0x0001)  
};

/// Struct /Script/AkAudio.AkOutputSettings
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAkOutputSettings
{ 
	FString                                            AudioDeviceSharesetName;                                    // 0x0000   (0x0010)  
	int32_t                                            IdDevice;                                                   // 0x0010   (0x0004)  
	PanningRule                                        PanRule;                                                    // 0x0014   (0x0001)  
	AkChannelConfiguration                             ChannelConfig;                                              // 0x0015   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0016   (0x0002)  MISSED
};

/// Struct /Script/AkAudio.AkChannelMask
/// Size: 0x0004 (0x000000 - 0x000004)
struct FAkChannelMask
{ 
	int32_t                                            ChannelMask;                                                // 0x0000   (0x0004)  
};

/// Struct /Script/AkAudio.AkGeometrySurfaceOverride
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAkGeometrySurfaceOverride
{ 
	UAkAcousticTexture*                                AcousticTexture;                                            // 0x0000   (0x0008)  
	bool                                               bEnableOcclusionOverride;                                   // 0x0008:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              OcclusionValue;                                             // 0x000C   (0x0004)  
	float                                              SurfaceArea;                                                // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkGeometryData
/// Size: 0x0050 (0x000000 - 0x000050)
struct FAkGeometryData
{ 
	TArray<FVector>                                    Vertices;                                                   // 0x0000   (0x0010)  
	TArray<FAkAcousticSurface>                         Surfaces;                                                   // 0x0010   (0x0010)  
	TArray<FAkTriangle>                                Triangles;                                                  // 0x0020   (0x0010)  
	TArray<UPhysicalMaterial*>                         ToOverrideAcousticTexture;                                  // 0x0030   (0x0010)  
	TArray<UPhysicalMaterial*>                         ToOverrideOcclusion;                                        // 0x0040   (0x0010)  
};

/// Struct /Script/AkAudio.AkTriangle
/// Size: 0x0008 (0x000000 - 0x000008)
struct FAkTriangle
{ 
	uint16_t                                           Point0;                                                     // 0x0000   (0x0002)  
	uint16_t                                           Point1;                                                     // 0x0002   (0x0002)  
	uint16_t                                           Point2;                                                     // 0x0004   (0x0002)  
	uint16_t                                           Surface;                                                    // 0x0006   (0x0002)  
};

/// Struct /Script/AkAudio.AkAcousticSurface
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAkAcousticSurface
{ 
	uint32_t                                           Texture;                                                    // 0x0000   (0x0004)  
	float                                              Occlusion;                                                  // 0x0004   (0x0004)  
	FString                                            Name;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/AkAudio.AkHololensAdvancedInitializationSettings
/// Size: 0x0004 (0x000030 - 0x000034)
struct FAkHololensAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	bool                                               UseHeadMountedDisplayAudioDevice;                           // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0031   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkPluginInfo
/// Size: 0x0028 (0x000000 - 0x000028)
struct FAkPluginInfo
{ 
	FString                                            Name;                                                       // 0x0000   (0x0010)  
	uint32_t                                           PluginID;                                                   // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FString                                            dll;                                                        // 0x0018   (0x0010)  
};

/// Struct /Script/AkAudio.AkCommonInitializationSettings
/// Size: 0x0060 (0x000000 - 0x000060)
struct FAkCommonInitializationSettings
{ 
	uint32_t                                           MaximumNumberOfMemoryPools;                                 // 0x0000   (0x0004)  
	uint32_t                                           MaximumNumberOfPositioningPaths;                            // 0x0004   (0x0004)  
	uint32_t                                           CommandQueueSize;                                           // 0x0008   (0x0004)  
	uint32_t                                           SamplesPerFrame;                                            // 0x000C   (0x0004)  
	FAkMainOutputSettings                              MainOutputSettings;                                         // 0x0010   (0x0028)  
	float                                              StreamingLookAheadRatio;                                    // 0x0038   (0x0004)  
	uint16_t                                           NumberOfRefillsInVoice;                                     // 0x003C   (0x0002)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x003E   (0x0002)  MISSED
	FAkSpatialAudioSettings                            SpatialAudioSettings;                                       // 0x0040   (0x0020)  
};

/// Struct /Script/AkAudio.AkSpatialAudioSettings
/// Size: 0x0020 (0x000000 - 0x000020)
struct FAkSpatialAudioSettings
{ 
	uint32_t                                           MaxSoundPropagationDepth;                                   // 0x0000   (0x0004)  
	float                                              MovementThreshold;                                          // 0x0004   (0x0004)  
	uint32_t                                           NumberOfPrimaryRays;                                        // 0x0008   (0x0004)  
	uint32_t                                           ReflectionOrder;                                            // 0x000C   (0x0004)  
	float                                              MaximumPathLength;                                          // 0x0010   (0x0004)  
	float                                              CPULimitPercentage;                                         // 0x0014   (0x0004)  
	bool                                               EnableDiffractionOnReflections;                             // 0x0018   (0x0001)  
	bool                                               EnableGeometricDiffractionAndTransmission;                  // 0x0019   (0x0001)  
	bool                                               CalcEmitterVirtualPosition;                                 // 0x001A   (0x0001)  
	bool                                               UseObstruction;                                             // 0x001B   (0x0001)  
	bool                                               UseOcclusion;                                               // 0x001C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x001D   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkMainOutputSettings
/// Size: 0x0028 (0x000000 - 0x000028)
struct FAkMainOutputSettings
{ 
	FString                                            AudioDeviceShareset;                                        // 0x0000   (0x0010)  
	uint32_t                                           DeviceID;                                                   // 0x0010   (0x0004)  
	EAkPanningRule                                     PanningRule;                                                // 0x0014   (0x0004)  
	EAkChannelConfigType                               ChannelConfigType;                                          // 0x0018   (0x0004)  
	uint32_t                                           ChannelMask;                                                // 0x001C   (0x0004)  
	uint32_t                                           NumberOfChannels;                                           // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkCommonInitializationSettingsWithSampleRate
/// Size: 0x0008 (0x000060 - 0x000068)
struct FAkCommonInitializationSettingsWithSampleRate : FAkCommonInitializationSettings
{ 
	uint32_t                                           SampleRate;                                                 // 0x0060   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0064   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkCommunicationSettings
/// Size: 0x0020 (0x000000 - 0x000020)
struct FAkCommunicationSettings
{ 
	uint32_t                                           PoolSize;                                                   // 0x0000   (0x0004)  
	uint16_t                                           DiscoveryBroadcastPort;                                     // 0x0004   (0x0002)  
	uint16_t                                           CommandPort;                                                // 0x0006   (0x0002)  
	uint16_t                                           NotificationPort;                                           // 0x0008   (0x0002)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x000A   (0x0006)  MISSED
	FString                                            NetworkName;                                                // 0x0010   (0x0010)  
};

/// Struct /Script/AkAudio.AkCommunicationSettingsWithCommSelection
/// Size: 0x0008 (0x000020 - 0x000028)
struct FAkCommunicationSettingsWithCommSelection : FAkCommunicationSettings
{ 
	EAkCommSystem                                      CommunicationSystem;                                        // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkCommunicationSettingsWithSystemInitialization
/// Size: 0x0008 (0x000020 - 0x000028)
struct FAkCommunicationSettingsWithSystemInitialization : FAkCommunicationSettings
{ 
	bool                                               InitializeSystemComms;                                      // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/AkAudio.AkBoolPropertyToControl
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAkBoolPropertyToControl
{ 
	FString                                            ItemProperty;                                               // 0x0000   (0x0010)  
};

/// Struct /Script/AkAudio.AkPropertyToControl
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAkPropertyToControl
{ 
	FString                                            ItemProperty;                                               // 0x0000   (0x0010)  
};

/// Struct /Script/AkAudio.AkPS4AdvancedInitializationSettings
/// Size: 0x0008 (0x000030 - 0x000038)
struct FAkPS4AdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	uint32_t                                           ACPBatchBufferSize;                                         // 0x0030   (0x0004)  
	bool                                               UseHardwareCodecLowLatencyMode;                             // 0x0034   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0035   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkPS5AdvancedInitializationSettings
/// Size: 0x0004 (0x000030 - 0x000034)
struct FAkPS5AdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	bool                                               UseHardwareCodecLowLatencyMode;                             // 0x0030   (0x0001)  
	bool                                               bVorbisHwAcceleration;                                      // 0x0031   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0032   (0x0002)  MISSED
};

/// Struct /Script/AkAudio.AkReverbDescriptor
/// Size: 0x0028 (0x000000 - 0x000028)
struct FAkReverbDescriptor
{ 
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x0000   (0x0028)  MISSED
};

/// Struct /Script/AkAudio.AkAcousticTextureParams
/// Size: 0x0020 (0x000000 - 0x000020)
struct FAkAcousticTextureParams
{ 
	FVector4                                           AbsorptionValues;                                           // 0x0000   (0x0010)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0010   (0x0010)  MISSED
};

/// Struct /Script/AkAudio.AkGeometrySurfacePropertiesToMap
/// Size: 0x0030 (0x000000 - 0x000030)
struct FAkGeometrySurfacePropertiesToMap
{ 
	TWeakObjectPtr<UAkAcousticTexture*>                AcousticTexture;                                            // 0x0000   (0x0028)  
	float                                              OcclusionValue;                                             // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkWwiseItemToControl
/// Size: 0x0040 (0x000000 - 0x000040)
struct FAkWwiseItemToControl
{ 
	FAkWwiseObjectDetails                              ItemPicked;                                                 // 0x0000   (0x0030)  
	FString                                            ItemPath;                                                   // 0x0030   (0x0010)  
};

/// Struct /Script/AkAudio.AkWwiseObjectDetails
/// Size: 0x0030 (0x000000 - 0x000030)
struct FAkWwiseObjectDetails
{ 
	FString                                            ItemName;                                                   // 0x0000   (0x0010)  
	FString                                            ItemPath;                                                   // 0x0010   (0x0010)  
	FString                                            ItemId;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/AkAudio.AkSurfacePoly
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAkSurfacePoly
{ 
	UAkAcousticTexture*                                Texture;                                                    // 0x0000   (0x0008)  
	float                                              Occlusion;                                                  // 0x0008   (0x0004)  
	bool                                               EnableSurface;                                              // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x000D   (0x0003)  MISSED
	float                                              SurfaceArea;                                                // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkSurfaceEdgeInfo
/// Size: 0x0028 (0x000000 - 0x000028)
struct FAkSurfaceEdgeInfo
{ 
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x0000   (0x0028)  MISSED
};

/// Struct /Script/AkAudio.AkSurfaceEdgeVerts
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAkSurfaceEdgeVerts
{ 
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0000   (0x0018)  MISSED
};

/// Struct /Script/AkAudio.AkWaapiFieldNames
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAkWaapiFieldNames
{ 
	FString                                            FieldName;                                                  // 0x0000   (0x0010)  
};

/// Struct /Script/AkAudio.AkWaapiUri
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAkWaapiUri
{ 
	FString                                            Uri;                                                        // 0x0000   (0x0010)  
};

/// Struct /Script/AkAudio.AkWindowsAdvancedInitializationSettings
/// Size: 0x0008 (0x000030 - 0x000038)
struct FAkWindowsAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	bool                                               UseHeadMountedDisplayAudioDevice;                           // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	uint32_t                                           MaxSystemAudioObjects;                                      // 0x0034   (0x0004)  
};

/// Struct /Script/AkAudio.AkWinGDKAdvancedInitializationSettings
/// Size: 0x0004 (0x000030 - 0x000034)
struct FAkWinGDKAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	bool                                               UseHeadMountedDisplayAudioDevice;                           // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0031   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkXboxOneGDKApuHeapInitializationSettings
/// Size: 0x0008 (0x000000 - 0x000008)
struct FAkXboxOneGDKApuHeapInitializationSettings
{ 
	uint32_t                                           CachedSize;                                                 // 0x0000   (0x0004)  
	uint32_t                                           NonCachedSize;                                              // 0x0004   (0x0004)  
};

/// Struct /Script/AkAudio.AkXboxOneGDKAdvancedInitializationSettings
/// Size: 0x0004 (0x000030 - 0x000034)
struct FAkXboxOneGDKAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	uint16_t                                           MaximumNumberOfXMAVoices;                                   // 0x0030   (0x0002)  
	bool                                               UseHardwareCodecLowLatencyMode;                             // 0x0032   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0033   (0x0001)  MISSED
};

/// Struct /Script/AkAudio.AkXboxOneApuHeapInitializationSettings
/// Size: 0x0008 (0x000000 - 0x000008)
struct FAkXboxOneApuHeapInitializationSettings
{ 
	uint32_t                                           CachedSize;                                                 // 0x0000   (0x0004)  
	uint32_t                                           NonCachedSize;                                              // 0x0004   (0x0004)  
};

/// Struct /Script/AkAudio.AkXboxOneAdvancedInitializationSettings
/// Size: 0x0004 (0x000030 - 0x000034)
struct FAkXboxOneAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	uint16_t                                           MaximumNumberOfXMAVoices;                                   // 0x0030   (0x0002)  
	bool                                               UseHardwareCodecLowLatencyMode;                             // 0x0032   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0033   (0x0001)  MISSED
};

/// Struct /Script/AkAudio.AkXSXApuHeapInitializationSettings
/// Size: 0x0008 (0x000000 - 0x000008)
struct FAkXSXApuHeapInitializationSettings
{ 
	uint32_t                                           CachedSize;                                                 // 0x0000   (0x0004)  
	uint32_t                                           NonCachedSize;                                              // 0x0004   (0x0004)  
};

/// Struct /Script/AkAudio.AkXSXAdvancedInitializationSettings
/// Size: 0x0008 (0x000030 - 0x000038)
struct FAkXSXAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	uint16_t                                           MaximumNumberOfXMAVoices;                                   // 0x0030   (0x0002)  
	bool                                               UseHardwareCodecLowLatencyMode;                             // 0x0032   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x0033   (0x0001)  MISSED
	uint16_t                                           MaximumNumberOfOpusVoices;                                  // 0x0034   (0x0002)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x0036   (0x0002)  MISSED
};

/// Struct /Script/AkAudio.MovieSceneAkAudioEventTemplate
/// Size: 0x0008 (0x000020 - 0x000028)
struct FMovieSceneAkAudioEventTemplate : FMovieSceneEvalTemplate
{ 
	UMovieSceneAkAudioEventSection*                    Section;                                                    // 0x0020   (0x0008)  
};

/// Struct /Script/AkAudio.MovieSceneAkAudioRTPCTemplate
/// Size: 0x0008 (0x000020 - 0x000028)
struct FMovieSceneAkAudioRTPCTemplate : FMovieSceneEvalTemplate
{ 
	UMovieSceneAkAudioRTPCSection*                     Section;                                                    // 0x0020   (0x0008)  
};

/// Struct /Script/AkAudio.MovieSceneFloatChannelSerializationHelper
/// Size: 0x0030 (0x000000 - 0x000030)
struct FMovieSceneFloatChannelSerializationHelper
{ 
	TEnumAsByte<ERichCurveExtrapolation>               PreInfinityExtrap;                                          // 0x0000   (0x0001)  
	TEnumAsByte<ERichCurveExtrapolation>               PostInfinityExtrap;                                         // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0002   (0x0006)  MISSED
	TArray<int32_t>                                    Times;                                                      // 0x0008   (0x0010)  
	TArray<FMovieSceneFloatValueSerializationHelper>   Values;                                                     // 0x0018   (0x0010)  
	float                                              DefaultValue;                                               // 0x0028   (0x0004)  
	bool                                               bHasDefaultValue;                                           // 0x002C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x002D   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.MovieSceneFloatValueSerializationHelper
/// Size: 0x001C (0x000000 - 0x00001C)
struct FMovieSceneFloatValueSerializationHelper
{ 
	float                                              Value;                                                      // 0x0000   (0x0004)  
	TEnumAsByte<ERichCurveInterpMode>                  InterpMode;                                                 // 0x0004   (0x0001)  
	TEnumAsByte<ERichCurveTangentMode>                 TangentMode;                                                // 0x0005   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0006   (0x0002)  MISSED
	FMovieSceneTangentDataSerializationHelper          Tangent;                                                    // 0x0008   (0x0014)  
};

/// Struct /Script/AkAudio.MovieSceneTangentDataSerializationHelper
/// Size: 0x0014 (0x000000 - 0x000014)
struct FMovieSceneTangentDataSerializationHelper
{ 
	float                                              ArriveTangent;                                              // 0x0000   (0x0004)  
	float                                              LeaveTangent;                                               // 0x0004   (0x0004)  
	TEnumAsByte<ERichCurveTangentWeightMode>           TangentWeightMode;                                          // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              ArriveTangentWeight;                                        // 0x000C   (0x0004)  
	float                                              LeaveTangentWeight;                                         // 0x0010   (0x0004)  
};

/// Enum /Script/AkAudio.EAkCallbackType
/// Size: 0x14
enum EAkCallbackType : uint8_t
{
	EAkCallbackType__EndOfEvent                                                      = 0,
	EAkCallbackType__Marker                                                          = 2,
	EAkCallbackType__Duration                                                        = 3,
	EAkCallbackType__Starvation                                                      = 5,
	EAkCallbackType__MusicPlayStarted                                                = 7,
	EAkCallbackType__MusicSyncBeat                                                   = 8,
	EAkCallbackType__MusicSyncBar                                                    = 9,
	EAkCallbackType__MusicSyncEntry                                                  = 10,
