/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package ConZ_Files.

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_BarberShop.ABP_Prisoner_BarberShop_C
/// Size: 0x0100 (0x0002E0 - 0x0003E0)
class UABP_Prisoner_BarberShop_C : public UPrisonerAnimInstance_PrisonerCreation
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E0   (0x0008)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x02E8   (0x0080)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0368   (0x0030)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0398   (0x0048)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_BarberShop.ABP_Prisoner_BarberShop_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_BarberShop.ABP_Prisoner_BarberShop_C.ExecuteUbergraph_ABP_Prisoner_BarberShop
	void ExecuteUbergraph_ABP_Prisoner_BarberShop(int32_t EntryPoint);                                                       // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_PlasticSurgery.ABP_Prisoner_PlasticSurgery_C
/// Size: 0x01E8 (0x0002E0 - 0x0004C8)
class UABP_Prisoner_PlasticSurgery_C : public UPrisonerAnimInstance_PrisonerCreation
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02E8   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x0318   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x03C8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0448   (0x0080)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_PlasticSurgery.ABP_Prisoner_PlasticSurgery_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_PlasticSurgery.ABP_Prisoner_PlasticSurgery_C.ExecuteUbergraph_ABP_Prisoner_PlasticSurgery
	void ExecuteUbergraph_ABP_Prisoner_PlasticSurgery(int32_t EntryPoint);                                                   // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/NPCs/Vendors/MetaHuman_Sources/Common/Face/Neck_CtrlRig.Neck_CtrlRig_C
/// Size: 0x000C (0x000650 - 0x00065C)
class UNeck_CtrlRig_C : public UControlRig
{ 
public:
	float                                              neckCorrMultU;                                              // 0x0650   (0x0004)  
	float                                              neckCorrMultM;                                              // 0x0654   (0x0004)  
	float                                              neckCorrMultD;                                              // 0x0658   (0x0004)  
};

/// Class /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/Face_PostProcess_AnimBP.Face_PostProcess_AnimBP_C
/// Size: 0x04C4 (0x0002C0 - 0x000784)
class UFace_PostProcess_AnimBP_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_ControlRig                               AnimGraphNode_ControlRig;                                   // 0x02F8   (0x0368)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0660   (0x0118)  
	float                                              __CustomProperty_neckCorrMultD_6FBAF1324FF64F750C4E209554793C48; // 0x0778   (0x0004)  
	float                                              __CustomProperty_neckCorrMultM_6FBAF1324FF64F750C4E209554793C48; // 0x077C   (0x0004)  
	float                                              __CustomProperty_neckCorrMultU_6FBAF1324FF64F750C4E209554793C48; // 0x0780   (0x0004)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/Face_PostProcess_AnimBP.Face_PostProcess_AnimBP_C.AnimGraph
	void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/Face_PostProcess_AnimBP.Face_PostProcess_AnimBP_C.ExecuteUbergraph_Face_PostProcess_AnimBP
	void ExecuteUbergraph_Face_PostProcess_AnimBP(int32_t EntryPoint);                                                       // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/ABP_MH_Bartender.ABP_MH_Bartender_C
/// Size: 0x092D (0x0002C0 - 0x000BED)
class UABP_MH_Bartender_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x02C8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x03D0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04D8   (0x0108)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x05E0   (0x0048)  
	FAnimNode_RefPose                                  AnimGraphNode_LocalRefPose;                                 // 0x0628   (0x0018)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0640   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0660   (0x0108)  
	FAnimNode_ModifyCurve                              AnimGraphNode_ModifyCurve;                                  // 0x0768   (0x0058)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07C0   (0x0108)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x08C8   (0x00A0)  
	FAnimNode_RefPose                                  AnimGraphNode_LocalRefPose;                                 // 0x0968   (0x0018)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0980   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0A88   (0x0020)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0AA8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0AD8   (0x0008)  MISSED
	FTransform                                         NeckTransform;                                              // 0x0AE0   (0x0030)  
	FTransform                                         HeadTransform;                                              // 0x0B10   (0x0030)  
	FTransform                                         RibcageTransform;                                           // 0x0B40   (0x0030)  
	FTransform                                         ClavicleLTransform;                                         // 0x0B70   (0x0030)  
	FTransform                                         ClavicleRTransform;                                         // 0x0BA0   (0x0030)  
	FRotator                                           Rotation;                                                   // 0x0BD0   (0x000C)  
	FVector                                            HeadScale;                                                  // 0x0BDC   (0x000C)  
	float                                              Time;                                                       // 0x0BE8   (0x0004)  
	bool                                               ShouldApplyTransforms;                                      // 0x0BEC   (0x0001)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/ABP_MH_Bartender.ABP_MH_Bartender_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/ABP_MH_Bartender.ABP_MH_Bartender_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MH_Bartender_AnimGraphNode_ModifyBone_FB5C22D7482F2DE72FAE4583DC815696
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MH_Bartender_AnimGraphNode_ModifyBone_FB5C22D7482F2DE72FAE4583DC815696(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/ABP_MH_Bartender.ABP_MH_Bartender_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MH_Bartender_AnimGraphNode_ModifyBone_06437ED14B426507792A2CBB9DE21751
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MH_Bartender_AnimGraphNode_ModifyBone_06437ED14B426507792A2CBB9DE21751(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/ABP_MH_Bartender.ABP_MH_Bartender_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MH_Bartender_AnimGraphNode_ModifyBone_D75B794C4E7059949303CCB8F87AE862
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MH_Bartender_AnimGraphNode_ModifyBone_D75B794C4E7059949303CCB8F87AE862(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/ABP_MH_Bartender.ABP_MH_Bartender_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MH_Bartender_AnimGraphNode_ModifyBone_320860884E826E5BDB70C9B88B1041AF
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MH_Bartender_AnimGraphNode_ModifyBone_320860884E826E5BDB70C9B88B1041AF(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/ABP_MH_Bartender.ABP_MH_Bartender_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MH_Bartender_AnimGraphNode_ModifyBone_D353C17B4BA426D88C1AAA9921F5D449
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MH_Bartender_AnimGraphNode_ModifyBone_D353C17B4BA426D88C1AAA9921F5D449(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/ABP_MH_Bartender.ABP_MH_Bartender_C.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2859740] Event|Public|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/ABP_MH_Bartender.ABP_MH_Bartender_C.ExecuteUbergraph_ABP_MH_Bartender
	void ExecuteUbergraph_ABP_MH_Bartender(int32_t EntryPoint);                                                              // [0x2859740] Final|HasDefaults    
};

/// Class /Game/ConZ_Files/Characters/NPCs/Vendors/Bartender/Bartender_01/Head/ABP_MH_Doctor.ABP_MH_Doctor_C
/// Size: 0x0000 (0x000BED - 0x000BED)
class UABP_MH_Doctor_C : public UABP_MH_Bartender_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Mechanoids/Drones/BP_DroneAIController.BP_DroneAIController_C
/// Size: 0x0000 (0x0004B8 - 0x0004B8)
class ABP_DroneAIController_C : public ADroneAIController
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/ArcherySkillUIData.ArcherySkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UArcherySkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/AviationSkillUI_Data.AviationSkillUI_Data_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UAviationSkillUI_Data_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/AwarenessSkillUIData.AwarenessSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UAwarenessSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Blueprints/ChristmasGhost/ABP_ChristmasGhost.ABP_ChristmasGhost_C
/// Size: 0x0098 (0x0002C0 - 0x000358)
class UABP_ChristmasGhost_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_RefPose                                  AnimGraphNode_LocalRefPose;                                 // 0x02F8   (0x0018)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0310   (0x0048)  


	/// Functions
	// Function /Game/ConZ_Files/Blueprints/ChristmasGhost/ABP_ChristmasGhost.ABP_ChristmasGhost_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Blueprints/ChristmasGhost/ABP_ChristmasGhost.ABP_ChristmasGhost_C.AnimNotify_SpawnChristmasGift
	void AnimNotify_SpawnChristmasGift();                                                                                    // [0x2859740] BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Blueprints/ChristmasGhost/ABP_ChristmasGhost.ABP_ChristmasGhost_C.ExecuteUbergraph_ABP_ChristmasGhost
	void ExecuteUbergraph_ABP_ChristmasGhost(int32_t EntryPoint);                                                            // [0x2859740] Final|HasDefaults    
};

/// Class /Game/ConZ_Files/Skills/BoxingSkillUIData.BoxingSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UBoxingSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/CamouflageSkillUIData.CamouflageSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UCamouflageSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/CookingSkillUIData.CookingSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UCookingSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/DemolitionSkillUIData.DemolitionSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UDemolitionSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/DrivingSkillUIData.DrivingSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UDrivingSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/EnduranceSkillUIData.EnduranceSkillUIData_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UEnduranceSkillUIData_C : public UPrisonerSkillUIData_Endurance
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/EngineeringSkillUIData.EngineeringSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UEngineeringSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/FarmingSkillUIData.FarmingSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UFarmingSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/HandgunSkillUIData.HandgunSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UHandgunSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/MedicalSkillUIData.MedicalSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UMedicalSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/MeleeWeaponsSkillUIData.MeleeWeaponsSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UMeleeWeaponsSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/MotorcycleSkillUIData.MotorcycleSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UMotorcycleSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/BasicInjuryUIData.BasicInjuryUIData_C
/// Size: 0x0000 (0x0001A0 - 0x0001A0)
class UBasicInjuryUIData_C : public UPrisonerBodyConditionUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/BleedingUIData.BleedingUIData_C
/// Size: 0x0000 (0x0000B0 - 0x0000B0)
class UBleedingUIData_C : public UPrisonerBodySymptomUIData_Bleeding
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/Bleeding_C4.Bleeding_C4_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UBleeding_C4_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/Bleeding_C3.Bleeding_C3_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UBleeding_C3_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/Bleeding_C2.Bleeding_C2_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UBleeding_C2_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/Bleeding_C1.Bleeding_C1_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UBleeding_C1_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/IShouldBeCarefulWithMyInjuries.IShouldBeCarefulWithMyInjuries_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UIShouldBeCarefulWithMyInjuries_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Bleeding/BleedingInjuryUIData.BleedingInjuryUIData_C
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UBleedingInjuryUIData_C : public UPrisonerBodyConditionUIData_BleedingInjury
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Bleeding/BleedingInjury_RemoveBandages.BleedingInjury_RemoveBandages_C
/// Size: 0x0000 (0x000088 - 0x000088)
class UBleedingInjury_RemoveBandages_C : public UPrisonerBodyConditionInteraction_RemoveBandages
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Bleeding/BleedingInjury_ApplyBandagesOrDisinfect.BleedingInjury_ApplyBandagesOrDisinfect_C
/// Size: 0x0000 (0x000128 - 0x000128)
class UBleedingInjury_ApplyBandagesOrDisinfect_C : public UPrisonerBodyConditionTreatInteraction_ApplyBandagesOrDisinfect
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/Bleeding.Bleeding_C
/// Size: 0x0000 (0x000260 - 0x000260)
class UBleeding_C : public UPrisonerBodySymptom_Bleeding
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/NauseaUIData.NauseaUIData_C
/// Size: 0x0000 (0x0000B0 - 0x0000B0)
class UNauseaUIData_C : public UPrisonerBodySymptomUIData_Nausea
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/ChokingUIData.ChokingUIData_C
/// Size: 0x0000 (0x0001A0 - 0x0001A0)
class UChokingUIData_C : public UPrisonerBodyConditionUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/ThisTastesFunny.ThisTastesFunny_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UThisTastesFunny_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/IAmGoingToBeSick.IAmGoingToBeSick_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UIAmGoingToBeSick_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/Nausea.Nausea_C
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
class UNausea_C : public UPrisonerBodySymptom_Nausea
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/FoodDisgustUIData.FoodDisgustUIData_C
/// Size: 0x0000 (0x0001A0 - 0x0001A0)
class UFoodDisgustUIData_C : public UPrisonerBodyConditionUIData_FoodDisgust
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/UnconsciousnessUIData.UnconsciousnessUIData_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UUnconsciousnessUIData_C : public UPrisonerBodySymptomUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/Unconsciousness.Unconsciousness_C
/// Size: 0x0000 (0x0000B8 - 0x0000B8)
class UUnconsciousness_C : public UPrisonerBodySymptom_Unconsciousness
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/KnockoutUIData.KnockoutUIData_C
/// Size: 0x0000 (0x0001A0 - 0x0001A0)
class UKnockoutUIData_C : public UPrisonerBodyConditionUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/BloodshotEyesUIData.BloodshotEyesUIData_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UBloodshotEyesUIData_C : public UPrisonerBodySymptomUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/BlurredVisionUIData.BlurredVisionUIData_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UBlurredVisionUIData_C : public UPrisonerBodySymptomUIData_BlurredVision
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/DisorientationUIData.DisorientationUIData_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UDisorientationUIData_C : public UPrisonerBodySymptomUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/Disorientation.Disorientation_C
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
class UDisorientation_C : public UPrisonerBodySymptom_Disorientation
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/BlurredVision.BlurredVision_C
/// Size: 0x0000 (0x0000D0 - 0x0000D0)
class UBlurredVision_C : public UPrisonerBodySymptom_BlurredVision
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/TearGasExposureUIData.TearGasExposureUIData_C
/// Size: 0x0000 (0x0001A0 - 0x0001A0)
class UTearGasExposureUIData_C : public UPrisonerBodyConditionUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/BloodshotEyes.BloodshotEyes_C
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
class UBloodshotEyes_C : public UPrisonerBodySymptom_BloodshotEyes
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/ExhaustionChangeConsumptionUIData.ExhaustionChangeConsumptionUIData_C
/// Size: 0x0000 (0x000070 - 0x000070)
class UExhaustionChangeConsumptionUIData_C : public UPrisonerBodyEffectUIData_ExhaustionChange
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/ExhaustionChangeRestingUIData.ExhaustionChangeRestingUIData_C
/// Size: 0x0000 (0x000070 - 0x000070)
class UExhaustionChangeRestingUIData_C : public UPrisonerBodyEffectUIData_ExhaustionChange
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/ExhaustionChangeSmokingUIData.ExhaustionChangeSmokingUIData_C
/// Size: 0x0000 (0x000070 - 0x000070)
class UExhaustionChangeSmokingUIData_C : public UPrisonerBodyEffectUIData_ExhaustionChange
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/FeelingPain.FeelingPain_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UFeelingPain_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/PainUIData.PainUIData_C
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
class UPainUIData_C : public UPrisonerBodySymptomUIData_Pain
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/FeelingWeak.FeelingWeak_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UFeelingWeak_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/WeaknessUIData.WeaknessUIData_C
/// Size: 0x0000 (0x0000B8 - 0x0000B8)
class UWeaknessUIData_C : public UPrisonerBodySymptomUIData_Weakness
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/DizzinessUIData.DizzinessUIData_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UDizzinessUIData_C : public UPrisonerBodySymptomUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/DoubleVisionUIData.DoubleVisionUIData_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UDoubleVisionUIData_C : public UPrisonerBodySymptomUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/DoubleVision.DoubleVision_C
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
class UDoubleVision_C : public UPrisonerBodySymptom_DoubleVision
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/FeelingTired.FeelingTired_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UFeelingTired_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/FatigueUIData.FatigueUIData_C
/// Size: 0x0000 (0x0000B0 - 0x0000B0)
class UFatigueUIData_C : public UPrisonerBodySymptomUIData_Fatigue
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Infections/SepsisUIData.SepsisUIData_C
/// Size: 0x0000 (0x0001B8 - 0x0001B8)
class USepsisUIData_C : public UPrisonerBodyConditionUIData_Sepsis
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/Fatigue.Fatigue_C
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
class UFatigue_C : public UPrisonerBodySymptom_Fatigue
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/MyWoundsAreGettingInfected.MyWoundsAreGettingInfected_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UMyWoundsAreGettingInfected_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Infections/Sepsis.Sepsis_C
/// Size: 0x0000 (0x0000F0 - 0x0000F0)
class USepsis_C : public UPrisonerBodyCondition_Sepsis
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Infections/InfectionUIData.InfectionUIData_C
/// Size: 0x0000 (0x0001B0 - 0x0001B0)
class UInfectionUIData_C : public UPrisonerBodyConditionUIData_Infection
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Infections/Infection.Infection_C
/// Size: 0x0000 (0x000128 - 0x000128)
class UInfection_C : public UPrisonerBodyCondition_Infection
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Infections/Infection_Legs.Infection_Legs_C
/// Size: 0x0000 (0x000128 - 0x000128)
class UInfection_Legs_C : public UInfection_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Infections/Infection_Head.Infection_Head_C
/// Size: 0x0000 (0x000128 - 0x000128)
class UInfection_Head_C : public UInfection_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Infections/Infection_Chest.Infection_Chest_C
/// Size: 0x0000 (0x000128 - 0x000128)
class UInfection_Chest_C : public UInfection_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Infections/Infection_Arms.Infection_Arms_C
/// Size: 0x0000 (0x000128 - 0x000128)
class UInfection_Arms_C : public UInfection_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Infections/Infection_Abdomen.Infection_Abdomen_C
/// Size: 0x0000 (0x000128 - 0x000128)
class UInfection_Abdomen_C : public UInfection_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/Dizziness.Dizziness_C
/// Size: 0x0000 (0x000178 - 0x000178)
class UDizziness_C : public UPrisonerBodySymptom_Dizziness
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjuryUIData.BurnInjuryUIData_C
/// Size: 0x0000 (0x0001D8 - 0x0001D8)
class UBurnInjuryUIData_C : public UPrisonerBodyConditionUIData_BurnInjury
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury_RemoveBandages.BurnInjury_RemoveBandages_C
/// Size: 0x0000 (0x000088 - 0x000088)
class UBurnInjury_RemoveBandages_C : public UPrisonerBodyConditionInteraction_RemoveBandages
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury_ApplyGel.BurnInjury_ApplyGel_C
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
class UBurnInjury_ApplyGel_C : public UPrisonerBodyConditionTreatInteraction_ApplyGel
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury_ApplyBandagesOrDisinfect.BurnInjury_ApplyBandagesOrDisinfect_C
/// Size: 0x0000 (0x000128 - 0x000128)
class UBurnInjury_ApplyBandagesOrDisinfect_C : public UPrisonerBodyConditionTreatInteraction_ApplyBandagesOrDisinfect
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/Weakness.Weakness_C
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
class UWeakness_C : public UPrisonerBodySymptom_Weakness
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Symptoms/Pain.Pain_C
/// Size: 0x0000 (0x0000C8 - 0x0000C8)
class UPain_C : public UPrisonerBodySymptom_Pain
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury.BurnInjury_C
/// Size: 0x0000 (0x000618 - 0x000618)
class UBurnInjury_C : public UPrisonerBodyCondition_BurnInjury
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury_Legs.BurnInjury_Legs_C
/// Size: 0x0000 (0x000618 - 0x000618)
class UBurnInjury_Legs_C : public UBurnInjury_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury_Head.BurnInjury_Head_C
/// Size: 0x0000 (0x000618 - 0x000618)
class UBurnInjury_Head_C : public UBurnInjury_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury_Hands.BurnInjury_Hands_C
/// Size: 0x0000 (0x000618 - 0x000618)
class UBurnInjury_Hands_C : public UBurnInjury_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury_Feet.BurnInjury_Feet_C
/// Size: 0x0000 (0x000618 - 0x000618)
class UBurnInjury_Feet_C : public UBurnInjury_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury_Chest.BurnInjury_Chest_C
/// Size: 0x0000 (0x000618 - 0x000618)
class UBurnInjury_Chest_C : public UBurnInjury_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury_Arms.BurnInjury_Arms_C
/// Size: 0x0000 (0x000618 - 0x000618)
class UBurnInjury_Arms_C : public UBurnInjury_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Burn/BurnInjury_Abdomen.BurnInjury_Abdomen_C
/// Size: 0x0000 (0x000618 - 0x000618)
class UBurnInjury_Abdomen_C : public UBurnInjury_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Metabolism/BP_PrisonerMetabolism.BP_PrisonerMetabolism_C
/// Size: 0x0000 (0x001108 - 0x001108)
class UBP_PrisonerMetabolism_C : public UMetabolism
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Limping.Limping_C
/// Size: 0x0000 (0x000048 - 0x000048)
class ULimping_C : public UPrisonerBodyEffect_Limping
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/ExhaustionChangeSmoking.ExhaustionChangeSmoking_C
/// Size: 0x0000 (0x000088 - 0x000088)
class UExhaustionChangeSmoking_C : public UPrisonerBodyEffect_ExhaustionChange
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/ExhaustionChangeResting.ExhaustionChangeResting_C
/// Size: 0x0000 (0x000088 - 0x000088)
class UExhaustionChangeResting_C : public UPrisonerBodyEffect_ExhaustionChange
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/ExhaustionChangeConsumption.ExhaustionChangeConsumption_C
/// Size: 0x0000 (0x000088 - 0x000088)
class UExhaustionChangeConsumption_C : public UPrisonerBodyEffect_ExhaustionChange
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/TearGasExposure.TearGasExposure_C
/// Size: 0x0000 (0x000160 - 0x000160)
class UTearGasExposure_C : public UPrisonerBodyCondition_TearGasExposure
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Knockout.Knockout_C
/// Size: 0x0000 (0x0000F0 - 0x0000F0)
class UKnockout_C : public UPrisonerBodyCondition_Knockout
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/FoodDisgust.FoodDisgust_C
/// Size: 0x0000 (0x000138 - 0x000138)
class UFoodDisgust_C : public UPrisonerBodyCondition_FoodDisgust
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Choking.Choking_C
/// Size: 0x0000 (0x0000D0 - 0x0000D0)
class UChoking_C : public UPrisonerBodyCondition_Choking
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/Bleeding/BleedingInjury.BleedingInjury_C
/// Size: 0x0000 (0x000530 - 0x000530)
class UBleedingInjury_C : public UPrisonerBodyCondition_BleedingInjury
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BodyEffects/Conditions/Injuries/BasicInjury.BasicInjury_C
/// Size: 0x0000 (0x000158 - 0x000158)
class UBasicInjury_C : public UPrisonerBodyCondition_BasicInjury
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/RiflesSkillUIData.RiflesSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class URiflesSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/RunningSkillUIData.RunningSkillUIData_C
/// Size: 0x0000 (0x000058 - 0x000058)
class URunningSkillUIData_C : public UPrisonerSkillUIData_Running
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/SnipingSkillUIData.SnipingSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class USnipingSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/StealthSkillUIData.StealthSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UStealthSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/SurvivalSkillUIData.SurvivalSkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class USurvivalSkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/Skills/ThieverySkillUIData.ThieverySkillUIData_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UThieverySkillUIData_C : public UPrisonerSkillUIData
{ 
public:
};

/// Class /Game/ConZ_Files/UI/UI_CharacterNameWidget.UI_CharacterNameWidget_C
/// Size: 0x0000 (0x000278 - 0x000278)
class UUI_CharacterNameWidget_C : public UCharacterNameDisplayWidget
{ 
public:
};

/// Class /Game/ConZ_Files/Items/Weapons/AttachmentSockets/BP_MountTypeWeaponHolsterSledge.BP_MountTypeWeaponHolsterSledge_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBP_MountTypeWeaponHolsterSledge_C : public UAttachmentSocketMountType
{ 
public:
};

/// Class /Game/ConZ_Files/Items/Weapons/AttachmentSockets/BP_MountTypeWeaponHolsterRifle.BP_MountTypeWeaponHolsterRifle_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBP_MountTypeWeaponHolsterRifle_C : public UAttachmentSocketMountType
{ 
public:
};

/// Class /Game/ConZ_Files/Items/Weapons/AttachmentSockets/BP_MountTypeWeaponHolsterChainsaw.BP_MountTypeWeaponHolsterChainsaw_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBP_MountTypeWeaponHolsterChainsaw_C : public UAttachmentSocketMountType
{ 
public:
};

/// Class /Game/ConZ_Files/Items/Weapons/AttachmentSockets/BP_MountTypeWeaponHolsterBow.BP_MountTypeWeaponHolsterBow_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBP_MountTypeWeaponHolsterBow_C : public UAttachmentSocketMountType
{ 
public:
};

/// Class /Game/ConZ_Files/Items/Weapons/AttachmentSockets/BP_MountTypePrisonerHandLeft.BP_MountTypePrisonerHandLeft_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBP_MountTypePrisonerHandLeft_C : public UAttachmentSocketMountType
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/VisionEffects/BP_TakenDamageCameraShake.BP_TakenDamageCameraShake_C
/// Size: 0x0000 (0x0001B0 - 0x0001B0)
class UBP_TakenDamageCameraShake_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/ConZ_Files/Blueprints/ChristmasGhost/BP_ChristmasGhost.BP_ChristmasGhost_C
/// Size: 0x0030 (0x000300 - 0x000330)
class ABP_ChristmasGhost_C : public AChristmasGhost
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	USkeletalMeshComponent*                            Ghost;                                                      // 0x0308   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x0310   (0x0008)  
	TArray<USkeletalMesh*>                             PossibleMeshes;                                             // 0x0318   (0x0010)  
	UAnimMontage*                                      MontageToPlay;                                              // 0x0328   (0x0008)  


	/// Functions
	// Function /Game/ConZ_Files/Blueprints/ChristmasGhost/BP_ChristmasGhost.BP_ChristmasGhost_C.OnNotifyEnd_BD830BA54751BA88132EE8B90C969374
	void OnNotifyEnd_BD830BA54751BA88132EE8B90C969374(FName NotifyName);                                                     // [0x2859740] BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Blueprints/ChristmasGhost/BP_ChristmasGhost.BP_ChristmasGhost_C.OnNotifyBegin_BD830BA54751BA88132EE8B90C969374
	void OnNotifyBegin_BD830BA54751BA88132EE8B90C969374(FName NotifyName);                                                   // [0x2859740] BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Blueprints/ChristmasGhost/BP_ChristmasGhost.BP_ChristmasGhost_C.OnInterrupted_BD830BA54751BA88132EE8B90C969374
	void OnInterrupted_BD830BA54751BA88132EE8B90C969374(FName NotifyName);                                                   // [0x2859740] BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Blueprints/ChristmasGhost/BP_ChristmasGhost.BP_ChristmasGhost_C.OnBlendOut_BD830BA54751BA88132EE8B90C969374
	void OnBlendOut_BD830BA54751BA88132EE8B90C969374(FName NotifyName);                                                      // [0x2859740] BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Blueprints/ChristmasGhost/BP_ChristmasGhost.BP_ChristmasGhost_C.OnCompleted_BD830BA54751BA88132EE8B90C969374
	void OnCompleted_BD830BA54751BA88132EE8B90C969374(FName NotifyName);                                                     // [0x2859740] BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Blueprints/ChristmasGhost/BP_ChristmasGhost.BP_ChristmasGhost_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2859740] Event|Protected|BlueprintEvent 
	// Function /Game/ConZ_Files/Blueprints/ChristmasGhost/BP_ChristmasGhost.BP_ChristmasGhost_C.ExecuteUbergraph_BP_ChristmasGhost
	void ExecuteUbergraph_BP_ChristmasGhost(int32_t EntryPoint);                                                             // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Items/Equipment/Parachute.Parachute_C
/// Size: 0x0000 (0x0009C0 - 0x0009C0)
class AParachute_C : public AClothesItem
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/Vehicle/ALI_PrisonerVehicle.ALI_PrisonerVehicle_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UALI_PrisonerVehicle_C : public UAnimLayerInterface
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C
/// Size: 0x09BC (0x0002C0 - 0x000C7C)
class UABP_Prisoner_WeightLoad_C : public UPrisonerAnimInstance_WeightLoad
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x02F8   (0x0118)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0410   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0430   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0450   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0558   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0660   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0768   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0870   (0x0108)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone;                                     // 0x0978   (0x00F0)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0A68   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0B70   (0x0108)  
	float                                              WeightLoadFactor;                                           // 0x0C78   (0x0004)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.AnimGraph
	void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_453C5F26411CB286321E8DB6BD390538
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_453C5F26411CB286321E8DB6BD390538(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_3BA31DAB4C2251A5551ABF92B5EF6EDC
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_3BA31DAB4C2251A5551ABF92B5EF6EDC(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_CopyBone_C78C6C854660251F8AF393A3FFCDAF3D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_CopyBone_C78C6C854660251F8AF393A3FFCDAF3D(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_FD4BD31742A3B9C191645FBFBB26ADB3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_FD4BD31742A3B9C191645FBFBB26ADB3(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_5A9718D344432D8EE2C192ACDBA4E8B6
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_5A9718D344432D8EE2C192ACDBA4E8B6(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_D664E21F4D373F17D3BDEF8FEBACC61D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_D664E21F4D373F17D3BDEF8FEBACC61D(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_FED9B57C498EF024308E0B88F1D1CA6A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_FED9B57C498EF024308E0B88F1D1CA6A(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_5988E94F403D4BF88928DA9CC56F17CD
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_WeightLoad_AnimGraphNode_ModifyBone_5988E94F403D4BF88928DA9CC56F17CD(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_WeightLoad.ABP_Prisoner_WeightLoad_C.ExecuteUbergraph_ABP_Prisoner_WeightLoad
	void ExecuteUbergraph_ABP_Prisoner_WeightLoad(int32_t EntryPoint);                                                       // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_SpineLeaning.ABP_Prisoner_SpineLeaning_C
/// Size: 0x06CC (0x0002C0 - 0x00098C)
class UABP_Prisoner_SpineLeaning_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x02F8   (0x0118)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0410   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0518   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0620   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0728   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0830   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0938   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0958   (0x0020)  
	float                                              LeanAmount;                                                 // 0x0978   (0x0004)  
	float                                              Spine1LeanAngle;                                            // 0x097C   (0x0004)  
	float                                              Spine2LeanAngle;                                            // 0x0980   (0x0004)  
	float                                              Spine3LeanAngle;                                            // 0x0984   (0x0004)  
	float                                              RibcageLeanAngle;                                           // 0x0988   (0x0004)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_SpineLeaning.ABP_Prisoner_SpineLeaning_C.AnimGraph
	void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_SpineLeaning.ABP_Prisoner_SpineLeaning_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_SpineLeaning_AnimGraphNode_ModifyBone_5FAB4A1C4E652A3ACA30BB80394E75FE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_SpineLeaning_AnimGraphNode_ModifyBone_5FAB4A1C4E652A3ACA30BB80394E75FE(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_SpineLeaning.ABP_Prisoner_SpineLeaning_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_SpineLeaning_AnimGraphNode_ModifyBone_D5F2A724426CF36597430D97858CACD2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_SpineLeaning_AnimGraphNode_ModifyBone_D5F2A724426CF36597430D97858CACD2(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_SpineLeaning.ABP_Prisoner_SpineLeaning_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_SpineLeaning_AnimGraphNode_ModifyBone_C383BBD944F2587C3A4D5089DAF6C903
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_SpineLeaning_AnimGraphNode_ModifyBone_C383BBD944F2587C3A4D5089DAF6C903(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_SpineLeaning.ABP_Prisoner_SpineLeaning_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_SpineLeaning_AnimGraphNode_ModifyBone_5FD8259E4B3B8F00065B209AE0625CC4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_SpineLeaning_AnimGraphNode_ModifyBone_5FD8259E4B3B8F00065B209AE0625CC4(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_SpineLeaning.ABP_Prisoner_SpineLeaning_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_SpineLeaning_AnimGraphNode_ModifyBone_64A56C344D3C0A2EFC816D8AF1FEDA04
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_SpineLeaning_AnimGraphNode_ModifyBone_64A56C344D3C0A2EFC816D8AF1FEDA04(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_SpineLeaning.ABP_Prisoner_SpineLeaning_C.ExecuteUbergraph_ABP_Prisoner_SpineLeaning
	void ExecuteUbergraph_ABP_Prisoner_SpineLeaning(int32_t EntryPoint);                                                     // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_ParachuteMorphs.ABP_Prisoner_ParachuteMorphs_C
/// Size: 0x0088 (0x0002E0 - 0x000368)
class UABP_Prisoner_ParachuteMorphs_C : public UPrisonerAnimInstance_Parachute
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02E8   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x0318   (0x0050)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_ParachuteMorphs.ABP_Prisoner_ParachuteMorphs_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_ParachuteMorphs.ABP_Prisoner_ParachuteMorphs_C.ExecuteUbergraph_ABP_Prisoner_ParachuteMorphs
	void ExecuteUbergraph_ABP_Prisoner_ParachuteMorphs(int32_t EntryPoint);                                                  // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Grappled.ABP_Prisoner_Grappled_C
/// Size: 0x00B8 (0x0002C0 - 0x000378)
class UABP_Prisoner_Grappled_C : public UPrisonerAnimInstance_Grappled
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x02F8   (0x0080)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Grappled.ABP_Prisoner_Grappled_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Grappled.ABP_Prisoner_Grappled_C.ExecuteUbergraph_ABP_Prisoner_Grappled
	void ExecuteUbergraph_ABP_Prisoner_Grappled(int32_t EntryPoint);                                                         // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Fishing.ABP_Prisoner_Fishing_C
/// Size: 0x0B70 (0x0002E0 - 0x000E50)
class UABP_Prisoner_Fishing_C : public UPrisonerAnimInstance_Fishing
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02E8   (0x0030)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace;                     // 0x0318   (0x0190)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x04A8   (0x0118)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x05C0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0660   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x06E0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0780   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0800   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0880   (0x00A0)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace;                     // 0x0920   (0x0190)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace;                     // 0x0AB0   (0x0190)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace;                     // 0x0C40   (0x0190)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0DD0   (0x0080)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Fishing.ABP_Prisoner_Fishing_C.AnimGraph
	void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Fishing.ABP_Prisoner_Fishing_C.ExecuteUbergraph_ABP_Prisoner_Fishing
	void ExecuteUbergraph_ABP_Prisoner_Fishing(int32_t EntryPoint);                                                          // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C
/// Size: 0x0D6A (0x0002C0 - 0x00102A)
class UABP_Prisoner_FirstPersonAimRotation_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x02F8   (0x0118)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0410   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0430   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0538   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0558   (0x0108)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0660   (0x00A0)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0700   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0808   (0x0108)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0910   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0930   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0950   (0x0158)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0AA8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0AD0   (0x0028)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0AF8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0C00   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0D08   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	float                                              FirstPersonAimPitch;                                        // 0x1020   (0x0004)  
	float                                              FirstPersonAimYawDelta;                                     // 0x1024   (0x0004)  
	bool                                               ShouldApplyArmsPitchCorrection;                             // 0x1028   (0x0001)  
	EPrisonerStance                                    stance;                                                     // 0x1029   (0x0001)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.AnimGraph
	void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_7FEAD1104F7E24B7BADE00849E93A0CF
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_7FEAD1104F7E24B7BADE00849E93A0CF(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_5EAEB903484741C202D511A9F80ED66B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_5EAEB903484741C202D511A9F80ED66B(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_3D0C005446712A1FEEA6CC84D045C94D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_3D0C005446712A1FEEA6CC84D045C94D(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_7EF1CC914243739F132643878A96F729
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_7EF1CC914243739F132643878A96F729(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_942654FD4E41254B19E4E99849EA6B1A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_942654FD4E41254B19E4E99849EA6B1A(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_9FA2B355412280F805FC40811E4A8D40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_9FA2B355412280F805FC40811E4A8D40(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_8811180F4208B187BA6F7E9E903E48F4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_8811180F4208B187BA6F7E9E903E48F4(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_4F3E79E542374E72B87472A8A11E27D9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_4F3E79E542374E72B87472A8A11E27D9(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_0FAC8D61494943BE4F3F04AC005DA2EF
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation_AnimGraphNode_ModifyBone_0FAC8D61494943BE4F3F04AC005DA2EF(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FirstPersonAimRotation.ABP_Prisoner_FirstPersonAimRotation_C.ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation
	void ExecuteUbergraph_ABP_Prisoner_FirstPersonAimRotation(int32_t EntryPoint);                                           // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FemaleCorrections_TPV.ABP_Prisoner_FemaleCorrections_TPV_C
/// Size: 0x0BE0 (0x0002D0 - 0x000EB0)
class UABP_Prisoner_FemaleCorrections_TPV_C : public UPrisonerAnimInstance_FemaleCorrections
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02D0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02D8   (0x0030)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0308   (0x0118)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0420   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0440   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0460   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0568   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0670   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0778   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0880   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0988   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0A90   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0B98   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0CA0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0DA8   (0x0108)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FemaleCorrections_TPV.ABP_Prisoner_FemaleCorrections_TPV_C.AnimGraph
	void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FemaleCorrections_TPV.ABP_Prisoner_FemaleCorrections_TPV_C.ExecuteUbergraph_ABP_Prisoner_FemaleCorrections_TPV
	void ExecuteUbergraph_ABP_Prisoner_FemaleCorrections_TPV(int32_t EntryPoint);                                            // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FemaleCorrections_FPV.ABP_Prisoner_FemaleCorrections_FPV_C
/// Size: 0x03A0 (0x0002D0 - 0x000670)
class UABP_Prisoner_FemaleCorrections_FPV_C : public UPrisonerAnimInstance_FemaleCorrections
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02D0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02D8   (0x0030)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0308   (0x0118)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0420   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0440   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0460   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0568   (0x0108)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FemaleCorrections_FPV.ABP_Prisoner_FemaleCorrections_FPV_C.AnimGraph
	void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_FemaleCorrections_FPV.ABP_Prisoner_FemaleCorrections_FPV_C.ExecuteUbergraph_ABP_Prisoner_FemaleCorrections_FPV
	void ExecuteUbergraph_ABP_Prisoner_FemaleCorrections_FPV(int32_t EntryPoint);                                            // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C
/// Size: 0x2498 (0x000330 - 0x0027C8)
class UABP_Prisoner_Aerial_C : public UPrisonerAnimInstance_Aerial
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x0368   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0418   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0498   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x0518   (0x00B0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x05C8   (0x00C8)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x0690   (0x00B0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x0740   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x0790   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x07E0   (0x00A0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0880   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x08A8   (0x0050)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x08F8   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x0920   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x0970   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x09C0   (0x00A0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0A60   (0x0158)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x0BB8   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x0C08   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0C58   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0CF8   (0x0080)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0D78   (0x0158)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x0ED0   (0x0050)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0F20   (0x0028)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0F48   (0x0158)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x10A0   (0x0158)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x11F8   (0x0158)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x1350   (0x0158)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x14A8   (0x0158)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1600   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1628   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1650   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1678   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x16A0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x16C8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x16F0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1718   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1740   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1768   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1790   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x17B8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x17E0   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1808   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x18D0   (0x0158)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1A28   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1A50   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1A78   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x1AF8   (0x00B0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1BA8   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1C48   (0x00A0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1CE8   (0x00A0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x1D88   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x1E70   (0x00E8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x1F58   (0x0158)  
	FAnimNode_PoseSnapshot                             AnimGraphNode_PoseSnapshot;                                 // 0x20B0   (0x0090)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x2140   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x2168   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x2190   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x21B8   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x21E0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2230   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x22B0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2350   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x23D0   (0x00C0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x2490   (0x0050)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x24E0   (0x00C8)  
	FAnimNode_PoseSnapshot                             AnimGraphNode_PoseSnapshot;                                 // 0x25A8   (0x0090)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x2638   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x2688   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x26D8   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x2728   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x2778   (0x0050)  


	/// Functions
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2859740] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_TwoWayBlend_B69CEC8040210B9214396AB342D5CDC5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_TwoWayBlend_B69CEC8040210B9214396AB342D5CDC5(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_LayeredBoneBlend_0CDD252F459A1A10FC7E8FBBDF992069
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_LayeredBoneBlend_0CDD252F459A1A10FC7E8FBBDF992069(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_EEEC8A8D41A21C7990E28C8667CE0A17
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_EEEC8A8D41A21C7990E28C8667CE0A17(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_143172114ACD1D22D1CCDFAB691877FB
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_143172114ACD1D22D1CCDFAB691877FB(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_EFAA790F4916AE6CD602BD807E6B28D5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_EFAA790F4916AE6CD602BD807E6B28D5(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_TwoWayBlend_6BD6A65E46A88DC37F09809344D888FB
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_TwoWayBlend_6BD6A65E46A88DC37F09809344D888FB(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_22EB794E4B8387AB2B1C4ABF897CBA7E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_22EB794E4B8387AB2B1C4ABF897CBA7E(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_109F6CA141AB29E66B05908FB6679860
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_109F6CA141AB29E66B05908FB6679860(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_57EC1D294603C9D06B795498FE62C376
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_57EC1D294603C9D06B795498FE62C376(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_9076FEE64B60D4DA014EAC83F0E9B2C0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_9076FEE64B60D4DA014EAC83F0E9B2C0(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_F13988A1439509B49BC338B32E907892
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_F13988A1439509B49BC338B32E907892(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_AE7D76034C7E4C4DC5BCC8914C1A8CC5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_AE7D76034C7E4C4DC5BCC8914C1A8CC5(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_35E984B048A9C794BB1204B6415945CB
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_35E984B048A9C794BB1204B6415945CB(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_3B5E74FB4897E2BD591CD6A810F3AFBA
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_BlendListByBool_3B5E74FB4897E2BD591CD6A810F3AFBA(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_B742D6124F14BBBD8AB5D1A76CC763D5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_B742D6124F14BBBD8AB5D1A76CC763D5(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_2D00D9AA4A05B5070974A5A19A83EBF6
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Prisoner_Aerial_AnimGraphNode_SequenceEvaluator_2D00D9AA4A05B5070974A5A19A83EBF6(); // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner_Aerial.ABP_Prisoner_Aerial_C.ExecuteUbergraph_ABP_Prisoner_Aerial
	void ExecuteUbergraph_ABP_Prisoner_Aerial(int32_t EntryPoint);                                                           // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/PrisonerCharacterMesh.PrisonerCharacterMesh_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UPrisonerCharacterMesh_C : public UPrisonerCharacterMesh
{ 
public:
};

/// Class /Game/ConZ_Files/UI/BP_WeaponScopeWidget.BP_WeaponScopeWidget_C
/// Size: 0x006D (0x000278 - 0x0002E5)
class UBP_WeaponScopeWidget_C : public UWeaponScopeWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0278   (0x0008)  
	UWidgetAnimation*                                  FadeOut;                                                    // 0x0280   (0x0008)  
	UWidgetAnimation*                                  FadeIn;                                                     // 0x0288   (0x0008)  
	UBorder*                                           BlackBG;                                                    // 0x0290   (0x0008)  
	UBorder*                                           BorderLeft;                                                 // 0x0298   (0x0008)  
	UBorder*                                           BorderRight;                                                // 0x02A0   (0x0008)  
	UImage*                                            Reticle;                                                    // 0x02A8   (0x0008)  
	UScaleBox*                                         ScaleBox;                                                   // 0x02B0   (0x0008)  
	USizeBox*                                          SizeBox;                                                    // 0x02B8   (0x0008)  
	USizeBox*                                          SizeBox;                                                    // 0x02C0   (0x0008)  
	FVector2D                                          GeometrySize;                                               // 0x02C8   (0x0008)  
	FVector2D                                          GeometrySizeHalf;                                           // 0x02D0   (0x0008)  
	float                                              FadeInSpeed;                                                // 0x02D8   (0x0004)  
	float                                              FadeOutSpeed;                                               // 0x02DC   (0x0004)  
	float                                              OnShowDelay;                                                // 0x02E0   (0x0004)  
	bool                                               ShouldBeHidden;                                             // 0x02E4   (0x0001)  


	/// Functions
	// Function /Game/ConZ_Files/UI/BP_WeaponScopeWidget.BP_WeaponScopeWidget_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x2859740] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/ConZ_Files/UI/BP_WeaponScopeWidget.BP_WeaponScopeWidget_C.OnShowElements
	void OnShowElements();                                                                                                   // [0x2859740] Event|Public|BlueprintEvent 
	// Function /Game/ConZ_Files/UI/BP_WeaponScopeWidget.BP_WeaponScopeWidget_C.OnHideElements
	void OnHideElements();                                                                                                   // [0x2859740] Event|Public|BlueprintEvent 
	// Function /Game/ConZ_Files/UI/BP_WeaponScopeWidget.BP_WeaponScopeWidget_C.OnConstructFinished
	void OnConstructFinished();                                                                                              // [0x2859740] Event|Public|BlueprintEvent 
	// Function /Game/ConZ_Files/UI/BP_WeaponScopeWidget.BP_WeaponScopeWidget_C.WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent
	void WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent();                                                           // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/UI/BP_WeaponScopeWidget.BP_WeaponScopeWidget_C.ExecuteUbergraph_BP_WeaponScopeWidget
	void ExecuteUbergraph_BP_WeaponScopeWidget(int32_t EntryPoint);                                                          // [0x2859740] Final|HasDefaults    
};

/// Class /Game/ConZ_Files/Models/Objects/Outdoor/Droppings_Feces/Human/Variation_04/BP_Dropping_01.BP_Dropping_01_C
/// Size: 0x008C (0x000220 - 0x0002AC)
class ABP_Dropping_01_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	UPhysicsConstraintComponent*                       MyConstraintComp1;                                          // 0x0228   (0x0008)  
	UPhysicsConstraintComponent*                       MyConstraintComp;                                           // 0x0230   (0x0008)  
	UStaticMeshComponent*                              Shit_03;                                                    // 0x0238   (0x0008)  
	UStaticMeshComponent*                              Shit_02;                                                    // 0x0240   (0x0008)  
	UStaticMeshComponent*                              Shit_01;                                                    // 0x0248   (0x0008)  
	USceneComponent*                                   SharedRoot;                                                 // 0x0250   (0x0008)  
	FVector                                            OffsetTimeline_Offset_509AAF33465941489534FEBEC2819093;     // 0x0258   (0x000C)  
	TEnumAsByte<ETimelineDirection>                    OffsetTimeline__Direction_509AAF33465941489534FEBEC2819093; // 0x0264   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0265   (0x0003)  MISSED
	UTimelineComponent*                                OffsetTimeline;                                             // 0x0268   (0x0008)  
	FVector                                            Shit_01_Relative_Location;                                  // 0x0270   (0x000C)  
	bool                                               HasSpawnedEffects;                                          // 0x027C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x027D   (0x0003)  MISSED
	FVector                                            DecalSize;                                                  // 0x0280   (0x000C)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x028C   (0x0004)  MISSED
	UParticleSystem*                                   ParticlesToSpawn;                                           // 0x0290   (0x0008)  
	UMaterialInterface*                                DecalToSpawn;                                               // 0x0298   (0x0008)  
	USoundBase*                                        SoundToSpawn;                                               // 0x02A0   (0x0008)  
	float                                              LifeTime;                                                   // 0x02A8   (0x0004)  


	/// Functions
	// Function /Game/ConZ_Files/Models/Objects/Outdoor/Droppings_Feces/Human/Variation_04/BP_Dropping_01.BP_Dropping_01_C.OffsetTimeline__FinishedFunc
	void OffsetTimeline__FinishedFunc();                                                                                     // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Models/Objects/Outdoor/Droppings_Feces/Human/Variation_04/BP_Dropping_01.BP_Dropping_01_C.OffsetTimeline__UpdateFunc
	void OffsetTimeline__UpdateFunc();                                                                                       // [0x2859740] BlueprintEvent       
	// Function /Game/ConZ_Files/Models/Objects/Outdoor/Droppings_Feces/Human/Variation_04/BP_Dropping_01.BP_Dropping_01_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2859740] Event|Protected|BlueprintEvent 
	// Function /Game/ConZ_Files/Models/Objects/Outdoor/Droppings_Feces/Human/Variation_04/BP_Dropping_01.BP_Dropping_01_C.BndEvt__Shit_03_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
	void BndEvt__Shit_03_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(UPrimitiveComponent* HitComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, FVector NormalImpulse, FHitResult& Hit); // [0x2859740] HasOutParms|BlueprintEvent 
	// Function /Game/ConZ_Files/Models/Objects/Outdoor/Droppings_Feces/Human/Variation_04/BP_Dropping_01.BP_Dropping_01_C.AutoDestroy
	void AutoDestroy();                                                                                                      // [0x2859740] BlueprintCallable|BlueprintEvent 
	// Function /Game/ConZ_Files/Models/Objects/Outdoor/Droppings_Feces/Human/Variation_04/BP_Dropping_01.BP_Dropping_01_C.ExecuteUbergraph_BP_Dropping_01
	void ExecuteUbergraph_BP_Dropping_01(int32_t EntryPoint);                                                                // [0x2859740] Final|HasDefaults    
};

/// Class /Game/ConZ_Files/Items/Wristwatch/BP_Wristwatch.BP_Wristwatch_C
/// Size: 0x0008 (0x0002B8 - 0x0002C0)
class ABP_Wristwatch_C : public AWristwatch
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B8   (0x0008)  


	/// Functions
	// Function /Game/ConZ_Files/Items/Wristwatch/BP_Wristwatch.BP_Wristwatch_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2859740] Event|Protected|BlueprintEvent 
	// Function /Game/ConZ_Files/Items/Wristwatch/BP_Wristwatch.BP_Wristwatch_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2859740] Event|Public|BlueprintEvent 
	// Function /Game/ConZ_Files/Items/Wristwatch/BP_Wristwatch.BP_Wristwatch_C.SetDisplayBrightness
	void SetDisplayBrightness(float Value);                                                                                  // [0x2859740] Event|Public|BlueprintEvent 
	// Function /Game/ConZ_Files/Items/Wristwatch/BP_Wristwatch.BP_Wristwatch_C.ExecuteUbergraph_BP_Wristwatch
	void ExecuteUbergraph_BP_Wristwatch(int32_t EntryPoint);                                                                 // [0x2859740] Final                
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/ResponseIdles/DirtyAfterProne.DirtyAfterProne_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UDirtyAfterProne_C : public UPrisonerResponseIdle
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/BP_PrisonerUIData.BP_PrisonerUIData_C
/// Size: 0x0000 (0x000848 - 0x000848)
class UBP_PrisonerUIData_C : public UPrisonerUIDataImpl
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Corpse/BP_PrisonerCorpse.BP_PrisonerCorpse_C
/// Size: 0x0000 (0x000670 - 0x000670)
class ABP_PrisonerCorpse_C : public APrisonerCorpse
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Corpse/BP_Gib.BP_Gib_C
/// Size: 0x0000 (0x000230 - 0x000230)
class ABP_Gib_C : public AGib
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/ClothesCharacterMeshBase.ClothesCharacterMeshBase_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UClothesCharacterMeshBase_C : public UPrisonerCharacterMesh_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/ZombieImpersonatingSuit.ZombieImpersonatingSuit_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UZombieImpersonatingSuit_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/WeaponHolster.WeaponHolster_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UWeaponHolster_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Waist.Waist_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UWaist_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Underwear.Underwear_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UUnderwear_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Undershirt.Undershirt_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UUndershirt_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Underpants.Underpants_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UUnderpants_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Tights.Tights_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UTights_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/SweaterHoodie.SweaterHoodie_C
/// Size: 0x0000 (0x000098 - 0x000098)
class USweaterHoodie_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Socks.Socks_C
/// Size: 0x0000 (0x000098 - 0x000098)
class USocks_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Scarf.Scarf_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UScarf_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Raincoat.Raincoat_C
/// Size: 0x0000 (0x000098 - 0x000098)
class URaincoat_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Quiver.Quiver_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UQuiver_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/PenisWarmer.PenisWarmer_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UPenisWarmer_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/PantsShort.PantsShort_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UPantsShort_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/PantsLongExludeShorts.PantsLongExludeShorts_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UPantsLongExludeShorts_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/PantsLong.PantsLong_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UPantsLong_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Necklace.Necklace_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UNecklace_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Jacket.Jacket_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UJacket_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/HeadWear.HeadWear_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UHeadWear_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Head.Head_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UHead_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Gloves.Gloves_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UGloves_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/GhillieSuitJacket.GhillieSuitJacket_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UGhillieSuitJacket_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/FullHelmet.FullHelmet_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UFullHelmet_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Eyewear.Eyewear_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UEyewear_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Earwear.Earwear_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UEarwear_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Bra.Bra_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UBra_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/BodyArmour.BodyArmour_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UBodyArmour_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Backpack.Backpack_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UBackpack_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/HeadMask.HeadMask_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UHeadMask_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/FullBodyHazardSuit.FullBodyHazardSuit_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UFullBodyHazardSuit_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/FullBodyHazardSuit_Vintage.FullBodyHazardSuit_Vintage_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UFullBodyHazardSuit_Vintage_C : public UFullBodyHazardSuit_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Footwear.Footwear_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UFootwear_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/CharacterMeshManager/CharacterMeshClasses/Clothes/Facewear.Facewear_C
/// Size: 0x0000 (0x000098 - 0x000098)
class UFacewear_C : public UClothesCharacterMeshBase_C
{ 
public:
};

/// Class /Game/ConZ_Files/Blueprints/PlaceableActor/BP_PlaceableActorModularBaseBuilding.BP_PlaceableActorModularBaseBuilding_C
/// Size: 0x0000 (0x000660 - 0x000660)
class ABP_PlaceableActorModularBaseBuilding_C : public APlaceableActorModularBaseBuilding
{ 
public:
};

/// Class /Game/ConZ_Files/Blueprints/PlaceableActor/BP_PlaceableActorItems.BP_PlaceableActorItems_C
/// Size: 0x0000 (0x0004F0 - 0x0004F0)
class ABP_PlaceableActorItems_C : public APlaceableActorItems
{ 
public:
};

/// Class /Game/ConZ_Files/Blueprints/PlaceableActor/BP_PlaceableActorGarden.BP_PlaceableActorGarden_C
/// Size: 0x0000 (0x0005B0 - 0x0005B0)
class ABP_PlaceableActorGarden_C : public APlaceableActorGarden
{ 
public:
};

/// Class /Game/ConZ_Files/Blueprints/PlaceableActor/BP_PlaceableActorFortifications.BP_PlaceableActorFortifications_C
/// Size: 0x0000 (0x000518 - 0x000518)
class ABP_PlaceableActorFortifications_C : public APlaceableActorFortifications
{ 
public:
};

/// Class /Game/ConZ_Files/Blueprints/PlaceableActor/BP_PlaceableActorBaseUpgrade.BP_PlaceableActorBaseUpgrade_C
/// Size: 0x0000 (0x000530 - 0x000530)
class ABP_PlaceableActorBaseUpgrade_C : public APlaceableActorBaseUpgrade
{ 
public:
};

/// Class /Game/ConZ_Files/Blueprints/PlaceableActor/BP_PlaceableActorBaseBuilding.BP_PlaceableActorBaseBuilding_C
/// Size: 0x0000 (0x0005F0 - 0x0005F0)
class ABP_PlaceableActorBaseBuilding_C : public APlaceableActorBaseBuilding
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/AutoTriggeredVomiting.AutoTriggeredVomiting_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UAutoTriggeredVomiting_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/AutoTriggeredUrination.AutoTriggeredUrination_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UAutoTriggeredUrination_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Notifications/AutoTriggeredDefecation.AutoTriggeredDefecation_C
/// Size: 0x0000 (0x000060 - 0x000060)
class UAutoTriggeredDefecation_C : public UHUDNotificationDescription
{ 
public:
};

/// Class /Game/ConZ_Files/Blueprints/BP_PrisonerMusicPlayerComponent.BP_PrisonerMusicPlayerComponent_C
/// Size: 0x0000 (0x000150 - 0x000150)
class UBP_PrisonerMusicPlayerComponent_C : public UPrisonerMusicPlayerComponent
{ 
public:
};

/// Class /Game/ConZ_Files/Characters/Prisoner/Blueprints/Animation/ABP_Prisoner.ABP_Prisoner_C
/// Size: 0x70E68 (0x001110 - 0x071F78)
class UABP_Prisoner_C : public UPrisonerAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x1110   (0x0008)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1118   (0x00C0)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x11D8   (0x0020)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x11F8   (0x0028)  
	FAnimNode_SpringBone                               AnimGraphNode_SpringBone;                                   // 0x1220   (0x0128)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1348   (0x0020)  
	FAnimNode_SpringBone                               AnimGraphNode_SpringBone;                                   // 0x1368   (0x0128)  
	FAnimNode_SpringBone                               AnimGraphNode_SpringBone;                                   // 0x1490   (0x0128)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x15B8   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x15D8   (0x0158)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x1730   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1818   (0x00A0)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x18B8   (0x0108)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x19C0   (0x0158)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x1B18   (0x0048)  
	FAnimNode_ApplyMeshSpaceAdditive                   AnimGraphNode_ApplyMeshSpaceAdditive;                       // 0x1B60   (0x00D0)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1C30   (0x00C0)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x1CF0   (0x0048)  
	FAnimNode_LinkedAnimLayer                          AnimGraphNode_LinkedAnimLayer;                              // 0x1D38   (0x00B0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x1DE8   (0x0158)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x1F40   (0x0158)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2098   (0x00C8)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x2160   (0x0028)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x2188   (0x0158)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x22E0   (0x00B0)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x2390   (0x0048)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x23D8   (0x0108)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x24E0   (0x00A0)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x2580   (0x0108)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2688   (0x00A0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x2728   (0x0028)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x2750   (0x0158)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x28A8   (0x00B0)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x2958   (0x00C8)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2A20   (0x0020)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2A40   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2AE0   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2B00   (0x0020)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x2B20   (0x0028)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2B48   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2C30   (0x00A0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x2CD0   (0x0158)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x2E28   (0x00B0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2ED8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2FC0   (0x00E8)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x30A8   (0x0108)  
	FAnimNode_ApplyMeshSpaceAdditive                   AnimGraphNode_ApplyMeshSpaceAdditive;                       // 0x31B0   (0x00D0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x3280   (0x00A0)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x3320   (0x00B0)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace;                     // 0x33D0   (0x0190)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace;                     // 0x3560   (0x0190)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x36F0   (0x00A0)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x3790   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x3898   (0x0108)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x39A0   (0x0158)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x3AF8   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x3B78   (0x00A0)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose;                                 // 0x3C18   (0x0018)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x3C30   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x3CB0   (0x00A0)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose;                                 // 0x3D50   (0x0018)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x3D68   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x3DE8   (0x00A0)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose;                                 // 0x3E88   (0x0018)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x3EA0   (0x00B0)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x3F50   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x3F78   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x3FA0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x3FC8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x3FF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4018   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4040   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4068   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4090   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x40B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x40E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4108   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4130   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4158   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4180   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x41A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x41D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x41F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4220   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4248   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4270   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4298   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x42C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x42E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4310   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4338   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4360   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4388   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x43B0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x43D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4400   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4428   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4450   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4478   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x44A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x44C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x44F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4518   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4540   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4568   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4590   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x45B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x45E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4608   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4630   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4658   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4680   (0x0028)  
	nil                                                AnimGraphNode_TransitionResult;                             // 0x46A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x46D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x46F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4720   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4748   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4770   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4798   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x47C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x47E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4810   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4838   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4860   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4888   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x48B0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x48D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4900   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4928   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4950   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4978   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x49A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x49C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x49F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4A18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4A40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4A68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4A90   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4AB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4AE0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4B08   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4B30   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4B58   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4B80   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4BA8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4BD0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4BF8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4C20   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4C48   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4C70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4C98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4CC0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4CE8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4D10   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4D38   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4D60   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4D88   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4DB0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4DD8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4E00   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4E28   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4E50   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4E78   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4EA0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4EC8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4EF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4F18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4F40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4F68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4F90   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4FB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x4FE0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5008   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5030   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5058   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5080   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x50A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x50D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x50F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5120   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5148   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5170   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5198   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x51C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x51E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5210   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5238   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5260   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5288   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x52B0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x52D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5300   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5328   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5350   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5378   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x53A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x53C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x53F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5418   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5440   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5468   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5490   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x54B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x54E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5508   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5530   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5558   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5580   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x55A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x55D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x55F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5620   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5648   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5670   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5698   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x56C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x56E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5710   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5738   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5760   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5788   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x57B0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x57D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5800   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5828   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5850   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5878   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x58A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x58C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x58F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5918   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5940   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5968   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5990   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x59B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x59E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5A08   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5A30   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5A58   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5A80   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5AA8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5AD0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5AF8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5B20   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5B48   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5B70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5B98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5BC0   (0x0028)  
	FAnimNode_LinkedAnimGraph                          AnimGraphNode_LinkedAnimGraph;                              // 0x5BE8   (0x00A0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x5C88   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x5CB8   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x5CE0   (0x0050)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x5D30   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x5D60   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x5DB0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x5E00   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x5E80   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x5F40   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x5FE0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x6060   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x60E0   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x6190   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x6210   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x6240   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x6290   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x62E0   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x6360   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x6420   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x64C0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x6540   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x65C0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x6610   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x6660   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x66E0   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x67A0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x6840   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x68C0   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x6940   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x69F0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x6A70   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x6AA0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x6AF0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x6B40   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x6BC0   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x6C80   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x6D20   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x6DA0   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x6E20   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x6E70   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x6EC0   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x6F40   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x7000   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x70A0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7120   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x71A0   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7250   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x72D0   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x7300   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x7350   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x73A0   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x7420   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x74E0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7580   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7600   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x7680   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7730   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x77B0   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x77E0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x7830   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7880   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x7900   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x79C0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7A60   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7AE0   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x7B60   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7C10   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x7C90   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x7CC0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x7D10   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7D60   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x7DE0   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x7EA0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7F40   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x7FC0   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x8040   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x80F0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x8170   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x81A0   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x8250   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x82D0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x8350   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x8380   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x8430   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x84B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x85B8   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x86C0   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x86E0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x8700   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x8808   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x8888   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x88B8   (0x0028)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x88E0   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x8990   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x8A10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x8B18   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x8C20   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x8C40   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x8C60   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x8D68   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x8DE8   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x8E18   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x8EC8   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x8F48   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x9050   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x9158   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x9178   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x9198   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x92A0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x9320   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x9350   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x9400   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x9480   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x9588   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x9690   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x96B0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x96D0   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x97D8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x9858   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x9888   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x9938   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x99B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x9AC0   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x9BC8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x9BE8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x9C08   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x9D10   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x9D90   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x9DC0   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x9E70   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x9EF0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x9FF8   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xA100   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xA120   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xA140   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xA248   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xA2C8   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xA2F8   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xA3A8   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xA428   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xA530   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xA638   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xA658   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xA678   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xA780   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xA800   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xA830   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xA8E0   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xA960   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xAA68   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xAB70   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xAB90   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xABB0   (0x0108)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0xACB8   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xADA0   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xADD0   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xAE80   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xAF00   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xB008   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xB110   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xB130   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xB150   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xB258   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xB2D8   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xB308   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xB3B8   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xB438   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xB540   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xB648   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xB668   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xB688   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xB790   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xB810   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xB840   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xB8F0   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xB970   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xBA78   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xBB80   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xBBA0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xBBC0   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xBCC8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xBD48   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xBD78   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xBDA0   (0x0028)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xBDC8   (0x00B0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0xBE78   (0x00E8)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xBF60   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xC010   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xC090   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xC198   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xC2A0   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xC2C0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xC2E0   (0x0108)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0xC3E8   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xC4D0   (0x0030)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xC500   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xC5B0   (0x0080)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xC630   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xC738   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xC840   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xC860   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xC880   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xC988   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xCA08   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xCA38   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xCA60   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xCA88   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xCAB0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xCAD8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xCB00   (0x0028)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xCB28   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xCC30   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xCC50   (0x0108)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xCD58   (0x0020)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0xCD78   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xCE40   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xCEC0   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xCF40   (0x0030)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0xCF70   (0x00C8)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xD038   (0x0108)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0xD140   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0xD190   (0x0050)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0xD1E0   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xD280   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xD2A0   (0x0108)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xD3A8   (0x0020)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0xD3C8   (0x0050)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xD418   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xD448   (0x0028)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0xD470   (0x0050)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xD4C0   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xD4F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xD518   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xD540   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xD568   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xD590   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xD5B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xD5E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xD608   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xD630   (0x0028)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0xD658   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xD718   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0xD798   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xD838   (0x0080)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0xD8B8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0xD9A0   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0xDA88   (0x00E8)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0xDB70   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xDC30   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0xDCB0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xDD50   (0x0080)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0xDDD0   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0xDEB8   (0x00E8)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xDFA0   (0x00B0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0xE050   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0xE138   (0x00E8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xE220   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0xE250   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE278   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE2F8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE378   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE3F8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE478   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE4F8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE578   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE5F8   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xE678   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE728   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xE7A8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE7D8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE858   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE8D8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE958   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xE9D8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xEA58   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xEAD8   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xEB58   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xEC08   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xEC88   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xED08   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xED38   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xEDB8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xEE38   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xEEB8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xEF38   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xEFB8   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xF038   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF0E8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xF168   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF198   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF218   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF298   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF318   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF398   (0x0080)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0xF418   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF4C8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF548   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0xF5C8   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF5F8   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xF678   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xF698   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xF6B8   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF7C0   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0xF840   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0xF860   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0xF880   (0x0108)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xF988   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0xFA08   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xFAC8   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0xFB48   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0xFB98   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xFBE8   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0xFC68   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0xFD30   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0xFDF8   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0xFE48   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xFE98   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0xFF18   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0xFF98   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x10058   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x100D8   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x10198   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x10260   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x10328   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x10378   (0x0050)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x103C8   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x10490   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x10558   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x105D8   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x10698   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x10718   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x10768   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x107B8   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x10838   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x10900   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x109C8   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x10A48   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x10B08   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x10B88   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x10BD8   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x10C28   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x10CA8   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x10D70   (0x00C8)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x10E38   (0x00B0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x10EE8   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x10F38   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x10F88   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x11008   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x11088   (0x00C0)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x11148   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x11208   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x112D0   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x11398   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x113E8   (0x0050)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x11438   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x11500   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x115C8   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x11648   (0x00C0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x11708   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x11758   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x117A8   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x11828   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x118F0   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x119B8   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x11A08   (0x0050)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x11A58   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x11B20   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x11BE8   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x11C68   (0x0030)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x11C98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x11CC0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x11CE8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x11D10   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x11D38   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x11D60   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x11D88   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x11DB0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x11DD8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x11E00   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x11E80   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x11ED0   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x11F90   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x12010   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x12060   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x12120   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x121A0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x121F0   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x122B0   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x12330   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x12380   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x12440   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x124C0   (0x00A0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x12560   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x125B0   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x12670   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x126F0   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x12770   (0x00A0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x12810   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x12860   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x12920   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x129A0   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x12A20   (0x00A0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x12AC0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x12B10   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x12BD0   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x12C50   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x12CA0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x12CF0   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x12DB0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x12E50   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x12ED0   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x12F50   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x12FA0   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x13060   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x130E0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x13130   (0x00C0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x131F0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x13240   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x132C0   (0x00C0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x13380   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x133D0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x13420   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x134E0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x13580   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x13600   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x13680   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x136D0   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x13790   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x13810   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x13860   (0x00C0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x13920   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x13970   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x139F0   (0x00C0)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x13AB0   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x13B60   (0x0030)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x13B90   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x13C10   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x13C60   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x13D20   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x13DA0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x13DF0   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x13EB0   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x13F30   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x13F80   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x14040   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x140C0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x14110   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x141D0   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x14250   (0x00A0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x142F0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x14340   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x14400   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x14480   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x14500   (0x00A0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x145A0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x145F0   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x146B0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x14730   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x147B0   (0x00A0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x14850   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x148A0   (0x00C0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x14960   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x149B0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x14A00   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x14AC0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x14B60   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x14BE0   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x14C60   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x14CB0   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x14D70   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x14DF0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x14E40   (0x00C0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x14F00   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x14F50   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x14FD0   (0x00C0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x15090   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x150E0   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x15130   (0x00C0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x151F0   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x15290   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x15310   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x15390   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x153E0   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x154A0   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x15520   (0x0050)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x15570   (0x00C0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x15630   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x15680   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x15700   (0x00C0)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x157C0   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x15870   (0x0080)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x158F0   (0x0030)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x15920   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x15970   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x159C0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x15A40   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x15AC0   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x15B40   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x15C38   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x15CD8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x15CF8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x15D18   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x15E20   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x15EE0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x15FA8   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x16070   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x160F0   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x161E8   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x16288   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x16308   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x16328   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x16348   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x16450   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x16510   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x165D8   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x166A0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x166F0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x16740   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x167C0   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x16888   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x168D8   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x16928   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x169A8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x16A28   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x16AA8   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x16BA0   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x16C40   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x16C60   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x16C80   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x16D88   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x16E48   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x16F10   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x16FD8   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x17058   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x17150   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x171F0   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x17270   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x17290   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x172B0   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x173B8   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x17478   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x17540   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x17608   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x17658   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x176A8   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x17728   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x177F0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x17840   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x17890   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x17910   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x17990   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x17A10   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x17B08   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x17BA8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x17BC8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x17BE8   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x17CF0   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x17DB0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x17E78   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x17F40   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x17FC0   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x180B8   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x18158   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x181D8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x181F8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x18218   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x18320   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x183E0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x184A8   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x18570   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x185C0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x18610   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x18690   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x18758   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x187A8   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x187F8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x18878   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x188F8   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x18978   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x18A70   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x18B10   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x18B30   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x18B50   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x18C58   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x18D18   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x18DE0   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x18EA8   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x18F28   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x19020   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x190C0   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x19140   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x19160   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x19180   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x19288   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x19348   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x19410   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x194D8   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x19528   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x19578   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x195F8   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x196C0   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x19740   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x19838   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x198D8   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x19958   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x19978   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x19998   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x19AA0   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x19B60   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x19C28   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x19CF0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x19D40   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x19D90   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x19E10   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x19E90   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x19F88   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1A028   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1A0A8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1A0C8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1A0E8   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1A1F0   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1A2B0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1A378   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1A440   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1A490   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1A4E0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1A560   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1A5E0   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1A6D8   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1A778   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1A7F8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1A818   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1A838   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1A940   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1AA00   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1AAC8   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1AB90   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1ABE0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1AC30   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1ACB0   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1AD30   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1AE28   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1AEC8   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1AF48   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1AF68   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1AF88   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1B090   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1B150   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1B218   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1B2E0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1B330   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1B380   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1B400   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1B480   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1B578   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1B618   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1B698   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1B6B8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1B6D8   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1B7E0   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1B8A0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1B968   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1BA30   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1BA80   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1BAD0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1BB50   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1BBD0   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1BCC8   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1BD68   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1BDE8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1BE08   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1BE28   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1BF30   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1BFF0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1C0B8   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1C180   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1C1D0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1C220   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1C2A0   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1C320   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1C418   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1C4B8   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1C538   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1C558   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1C578   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1C680   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1C740   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1C808   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1C8D0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1C920   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1C970   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1C9F0   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1CA70   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1CB68   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1CC08   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1CC88   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1CCA8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1CCC8   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1CDD0   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1CE90   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1CF58   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1D020   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1D070   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1D0C0   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1D140   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1D208   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1D2D0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1D398   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1D460   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1D4E0   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1D5D8   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1D678   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1D6F8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1D718   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1D738   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1D840   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1D900   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1D9C8   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1DA90   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1DAE0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1DB30   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1DBB0   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1DC30   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1DD28   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1DDC8   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1DE48   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1DE68   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1DE88   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1DF90   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1E050   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1E118   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1E1E0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1E230   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1E280   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1E300   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1E380   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1E478   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1E518   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1E598   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1E5B8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1E5D8   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1E6E0   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1E7A0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1E868   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1E930   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1E980   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1E9D0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1EA50   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1EAD0   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1EBC8   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1EC68   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1ECE8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1ED08   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1ED28   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1EE30   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1EEF0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1EFB8   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1F080   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1F0D0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1F120   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1F1A0   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1F220   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1F318   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1F3B8   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1F438   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1F458   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1F478   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1F580   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1F640   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1F708   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1F7D0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1F820   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1F870   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1F8F0   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1F970   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1FA68   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1FB08   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1FB88   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1FBA8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1FBC8   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1FCD0   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1FD90   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1FE58   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1FF20   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x1FF70   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1FFC0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x20040   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x200C0   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x201B8   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x20258   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x202D8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x202F8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x20318   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x20420   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x204E0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x205A8   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x20670   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x206C0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x20710   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x20790   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x20810   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x20908   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x209A8   (0x0080)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x20A28   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x20A48   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x20A68   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x20B70   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x20C30   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x20CF8   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x20DC0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x20E10   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x20E60   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x20EE0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x20F60   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x20FE0   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x210D8   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x21178   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x211F8   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x21298   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x212B8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x212D8   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x213E0   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x214A0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x21568   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x21630   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x21680   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x216D0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x21750   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x217D0   (0x0080)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x21850   (0x00F8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x21948   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x219E8   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x21A68   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x21B08   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x21B28   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x21B48   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x21C50   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x21D10   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x21DD8   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x21EA0   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x21EF0   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x21F40   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x21FC0   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x22080   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x22100   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x221A0   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x22220   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x222E8   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x223B0   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x22478   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x224C8   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x22518   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x22598   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x225E8   (0x0050)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x22638   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x22700   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x227C8   (0x0080)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x22848   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x22908   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x22988   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x22A28   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x22AA8   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x22B70   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x22C38   (0x00C8)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x22D00   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x22D50   (0x0050)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x22DA0   (0x0080)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x22E20   (0x0050)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x22E70   (0x0050)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x22EC0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x22F88   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x23050   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x230D0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x23198   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x23260   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x23328   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x233F0   (0x00C8)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x234B8   (0x00B0)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x23568   (0x0030)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x23598   (0x0030)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x235C8   (0x0030)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x235F8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x236E0   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x237C8   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x238B0   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x23950   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x23970   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x23990   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x23A98   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x23B58   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x23C20   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x23D08   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x23DF0   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x23ED8   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x23F78   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x23F98   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x23FB8   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x240C0   (0x00C0)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x24180   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x24248   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x24330   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x24418   (0x00E8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x24500   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x24580   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x24600   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x246C8   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x24790   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x24830   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x24850   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x24870   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x24978   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x24A38   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x24B20   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x24C08   (0x00E8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x24CF0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x24D70   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x24DF0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x24EB8   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x24F80   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x25020   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x25040   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x25060   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x25168   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x25228   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x25310   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x253F8   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x254E0   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x25580   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x255A0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x255C0   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x256C8   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x25788   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x25870   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x25958   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x25A40   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x25AE0   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x25B00   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x25B20   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x25C28   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x25CE8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x25DD0   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x25EB8   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x25FA0   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x26040   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x26060   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x26080   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x26188   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x26248   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x26330   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x26418   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x26500   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x265A0   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x265C0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x265E0   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x266E8   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x267A8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x26890   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x26978   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x26A18   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x26A98   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x26B38   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x26B58   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x26B78   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x26C80   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x26D40   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x26E28   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x26F10   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x26FF8   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x270E0   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x27180   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x271A0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x271C0   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x272C8   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x27388   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x27470   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x27558   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x27640   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x276E0   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x27700   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x27720   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x27828   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x278E8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x279D0   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x27AB8   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x27BA0   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x27C40   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x27C60   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x27C80   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x27D88   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x27E48   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x27F30   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x28018   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x28100   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x281A0   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x281C0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x281E0   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x282E8   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x283A8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x28490   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x28578   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x28660   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x28700   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x28720   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x28740   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x28848   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x28908   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x289F0   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x28AD8   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x28BC0   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x28C60   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x28C80   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x28CA0   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x28DA8   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x28E68   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x28F50   (0x00E8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x29038   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x290B8   (0x0080)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x29138   (0x00E8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x29220   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x292E8   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x293B0   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x29450   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x29470   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x29490   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x29598   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x29658   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x29740   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x29828   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x29910   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x299B0   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x299D0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x299F0   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x29AF8   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x29BB8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x29CA0   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x29D88   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x29E28   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x29EA8   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x29F48   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x29F68   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x29F88   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x2A090   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2A150   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2A1D0   (0x0080)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2A250   (0x00E8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2A338   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2A400   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2A4C8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2A5B0   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2A698   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2A780   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2A820   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2A840   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x2A860   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x2A968   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2AA28   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2AB10   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2ABF8   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2ACE0   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2AD80   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2ADA0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x2ADC0   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x2AEC8   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2AF88   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2B070   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2B158   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2B240   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2B2E0   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2B300   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x2B320   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x2B428   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2B4E8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2B5D0   (0x00E8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2B6B8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2B738   (0x0080)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2B7B8   (0x00E8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2B8A0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2B968   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2BA30   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2BAD0   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2BAF0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x2BB10   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x2BC18   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2BCD8   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2BDC0   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2BEA8   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2BF48   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2BFC8   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2C068   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2C088   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x2C0A8   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x2C1B0   (0x00C0)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2C270   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2C358   (0x00E8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2C440   (0x00E8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2C528   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2C5C8   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2C648   (0x00A0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2C6E8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2C708   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x2C728   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x2C830   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2C8F0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2C970   (0x0080)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2C9F0   (0x00E8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2CAD8   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2CBA0   (0x00C8)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x2CC68   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2CD28   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2CDA8   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2CE28   (0x0080)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2CEA8   (0x00E8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2CF90   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2D058   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2D120   (0x00E8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2D208   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2D2D0   (0x00E8)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x2D3B8   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2D478   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2D4F8   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2D598   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2D618   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2D6E0   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2D760   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2D7E0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2D8A8   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2D970   (0x00E8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2DA58   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2DB20   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2DBE8   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2DCB0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2DD78   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2DE40   (0x00E8)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x2DF28   (0x00C0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2DFE8   (0x0080)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x2E068   (0x00A0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2E108   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2E188   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2E250   (0x0080)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x2E2D0   (0x0080)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2E350   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2E418   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x2E4E0   (0x00E8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2E5C8   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2E690   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2E758   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2E820   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x2E8E8   (0x00C8)  
