/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package ConZ.

/// Class /Script/ConZ.AbandonedBunkerConnectionSetup
/// Size: 0x0010 (0x000030 - 0x000040)
class UAbandonedBunkerConnectionSetup : public UDataAsset
{ 
public:
	TArray<FAbandonedBunkerConnectionBinding>          Bindings;                                                   // 0x0030   (0x0010)  
};

/// Class /Script/ConZ.AbandonedBunker
/// Size: 0x0230 (0x000220 - 0x000450)
class AAbandonedBunker : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0xE8];                                      // 0x0220   (0x00E8)  MISSED
	UBillboardComponent*                               _sprite;                                                    // 0x0308   (0x0008)  
	float                                              _miuntesUntilResetAfterNoPlayersNearby;                     // 0x0310   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0314   (0x0004)  MISSED
	UClass*                                            _masterKeycardUnlockData;                                   // 0x0318   (0x0008)  
	TArray<FAbandonedBunkerFloorSetup>                 _floorSetup;                                                // 0x0320   (0x0010)  
	UAbandonedBunkerConnectionSetup*                   _connectionSetup;                                           // 0x0330   (0x0008)  
	FGameplayTagContainer                              _alwaysPoweredRooms;                                        // 0x0338   (0x0020)  
	float                                              _alarmDuration;                                             // 0x0358   (0x0004)  
	float                                              _managerDescriptionReplicatedNoiseNormalized;               // 0x035C   (0x0004)  
	TArray<uint16_t>                                   _poweredRoomIds;                                            // 0x0360   (0x0010)  
	TArray<uint16_t>                                   _alarmedRoomIds;                                            // 0x0370   (0x0010)  
	unsigned char                                      UnknownData02_5[0x88];                                      // 0x0380   (0x0088)  MISSED
	UAbandonedBunkerZoneManagerComponent*              _abandonedBunkerManagerComponent;                           // 0x0408   (0x0008)  
	UNavigationInvokerComponent*                       _razorNavigationInvokerComponent;                           // 0x0410   (0x0008)  
	unsigned char                                      UnknownData03_6[0x38];                                      // 0x0418   (0x0038)  MISSED


	/// Functions
	// Function /Script/ConZ.AbandonedBunker.OnRep_PoweredRoomIds
	void OnRep_PoweredRoomIds(TArray<uint16_t>& oldPoweredRoomIds);                                                          // [0x223d4f0] Final|Native|Private|HasOutParms 
	// Function /Script/ConZ.AbandonedBunker.OnRep_AlarmedRoomIds
	void OnRep_AlarmedRoomIds(TArray<uint16_t>& oldAlarmedRoomIds);                                                          // [0x223d400] Final|Native|Private|HasOutParms 
	// Function /Script/ConZ.AbandonedBunker.NetMulticast_SetPartialOpenRatioDoorComponent
	void NetMulticast_SetPartialOpenRatioDoorComponent(UAbandonedBunkerDoorComponent* doorComponent, float Ratio);           // [0x223d330] Net|NetReliableNative|Event|NetMulticast|Public 
};

/// Class /Script/ConZ.AbandonedBunkerBCUMemoryModuleTerminal
/// Size: 0x0058 (0x000220 - 0x000278)
class AAbandonedBunkerBCUMemoryModuleTerminal : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0220   (0x0008)  MISSED
	UStaticMeshComponent*                              _mesh;                                                      // 0x0228   (0x0008)  
	UStaticMeshComponent*                              _progressBarMesh;                                           // 0x0230   (0x0008)  
	FTimespan                                          _cooldown;                                                  // 0x0238   (0x0008)  
	FDateTime                                          _lastDownloadTime;                                          // 0x0240   (0x0008)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x0248   (0x0010)  MISSED
	float                                              _downloadActionDuration;                                    // 0x0258   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x025C   (0x0004)  MISSED
	UAkAudioEvent*                                     _downloadActionStartAudio;                                  // 0x0260   (0x0008)  
	UAkAudioEvent*                                     _downloadActionStopAudio;                                   // 0x0268   (0x0008)  
	unsigned char                                      UnknownData03_6[0x8];                                       // 0x0270   (0x0008)  MISSED


	/// Functions
	// Function /Script/ConZ.AbandonedBunkerBCUMemoryModuleTerminal.OnRep_LastDownloadTime
	void OnRep_LastDownloadTime();                                                                                           // [0x223d4d0] Final|Native|Private 
};

/// Class /Script/ConZ.AbandonedBunkerDialPad
/// Size: 0x00C8 (0x000220 - 0x0002E8)
class AAbandonedBunkerDialPad : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0220   (0x0008)  MISSED
	UClass*                                            _minigameClass;                                             // 0x0228   (0x0008)  
	UClass*                                            _minigameConfigurationClass;                                // 0x0230   (0x0008)  
	UClass*                                            _hackingMinigameClass;                                      // 0x0238   (0x0008)  
	UClass*                                            _hackingMinigameConfiguration;                              // 0x0240   (0x0008)  
	ADoor*                                             _connectedDoor;                                             // 0x0248   (0x0008)  
	FLinearColor                                       _lockedColor;                                               // 0x0250   (0x0010)  
	FLinearColor                                       _unlockedColor;                                             // 0x0260   (0x0010)  
	FLinearColor                                       _offColor;                                                  // 0x0270   (0x0010)  
	int32_t                                            _combinationLength;                                         // 0x0280   (0x0004)  
	float                                              _minigameBaseDuration;                                      // 0x0284   (0x0004)  
	TArray<char>                                       _wornButtons;                                               // 0x0288   (0x0010)  
	unsigned char                                      UnknownData01_6[0x50];                                      // 0x0298   (0x0050)  MISSED


	/// Functions
	// Function /Script/ConZ.AbandonedBunkerDialPad.OnRep_WornButtons
	void OnRep_WornButtons();                                                                                                // [0x223d5a0] Final|Native|Private 
};

/// Class /Script/ConZ.AbandonedBunkerDoorComponent
/// Size: 0x0090 (0x0004E0 - 0x000570)
class UAbandonedBunkerDoorComponent : public UStaticMeshComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x04E0   (0x0008)  MISSED
	ADoor*                                             _outerDoor;                                                 // 0x04E8   (0x0008)  
	EDoorOpenMethod                                    _doorOpenMethod;                                            // 0x04F0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x04F1   (0x0003)  MISSED
	int32_t                                            _doorManualOpenMethod;                                      // 0x04F4   (0x0004)  
	bool                                               _canAlwaysBeOpenedDuringDay;                                // 0x04F8   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x04F9   (0x0003)  MISSED
	FVector                                            _directionTowardsInside;                                    // 0x04FC   (0x000C)  
	bool                                               _canAlwaysBeOpenedFromInside;                               // 0x0508   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0509   (0x0003)  MISSED
	FGameplayTag                                       _roomId;                                                    // 0x050C   (0x0008)  
	float                                              _manualOpenActionMovementAcceptanceRadius;                  // 0x0514   (0x0004)  
	float                                              _manualOpenActionBaseDuration;                              // 0x0518   (0x0004)  
	float                                              _manualOpenDurationReductionPerStrengthPoint;               // 0x051C   (0x0004)  
	float                                              _manualOpenMinimumDuration;                                 // 0x0520   (0x0004)  
	float                                              _forceOpenCrowbarDamage;                                    // 0x0524   (0x0004)  
	float                                              _manualOpenAutoCloseDelay;                                  // 0x0528   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x052C   (0x0004)  MISSED
	UClass*                                            _hackingMinigameClass;                                      // 0x0530   (0x0008)  
	UClass*                                            _hackingMinigameConfiguration;                              // 0x0538   (0x0008)  
	unsigned char                                      UnknownData05_6[0x30];                                      // 0x0540   (0x0030)  MISSED


	/// Functions
	// Function /Script/ConZ.AbandonedBunkerDoorComponent.Door_OnDoorOpened
	void Door_OnDoorOpened();                                                                                                // [0x223d050] Final|Native|Private 
};

/// Class /Script/ConZ.AbandonedBunkerLightComponent
/// Size: 0x00C0 (0x0000B0 - 0x000170)
class UAbandonedBunkerLightComponent : public UActorComponent
{ 
public:
	EBunkerLightControlType                            _controlType;                                               // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x00B1   (0x0003)  MISSED
	float                                              _blinkPeriodWhenLowPower;                                   // 0x00B4   (0x0004)  
	bool                                               _autoFindLightComponents;                                   // 0x00B8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x00B9   (0x0007)  MISSED
	TArray<ULightComponent*>                           _lightComponents;                                           // 0x00C0   (0x0010)  
	unsigned char                                      UnknownData02_5[0x10];                                      // 0x00D0   (0x0010)  MISSED
	bool                                               _autoFindMeshComponents;                                    // 0x00E0   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x00E1   (0x0007)  MISSED
	TArray<UStaticMeshComponent*>                      _meshComponents;                                            // 0x00E8   (0x0010)  
	unsigned char                                      UnknownData04_5[0x10];                                      // 0x00F8   (0x0010)  MISSED
	bool                                               _autoFindParticleComponents;                                // 0x0108   (0x0001)  
	unsigned char                                      UnknownData05_5[0x7];                                       // 0x0109   (0x0007)  MISSED
	TArray<UParticleSystemComponent*>                  _particleComponents;                                        // 0x0110   (0x0010)  
	bool                                               _autoFindNiagaraComponents;                                 // 0x0120   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x0121   (0x0007)  MISSED
	TArray<UNiagaraComponent*>                         _niagaraComponents;                                         // 0x0128   (0x0010)  
	bool                                               _autoFindAudioComponents;                                   // 0x0138   (0x0001)  
	unsigned char                                      UnknownData07_5[0x7];                                       // 0x0139   (0x0007)  MISSED
	TArray<UAkComponent*>                              _audioComponents;                                           // 0x0140   (0x0010)  
	UAkAudioEvent*                                     _audioEventStart;                                           // 0x0150   (0x0008)  
	UAkAudioEvent*                                     _audioEventStop;                                            // 0x0158   (0x0008)  
	unsigned char                                      UnknownData08_6[0x10];                                      // 0x0160   (0x0010)  MISSED
};

/// Class /Script/ConZ.LWObjectSetup
/// Size: 0x0008 (0x000028 - 0x000030)
class ULWObjectSetup : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Class /Script/ConZ.EntitySystemObjectSetup
/// Size: 0x0010 (0x000030 - 0x000040)
class UEntitySystemObjectSetup : public ULWObjectSetup
{ 
public:
	bool                                               TickEnabled;                                                // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              TickInterval;                                               // 0x0034   (0x0004)  
	bool                                               CanEverTickOnServer;                                        // 0x0038   (0x0001)  
	bool                                               CanEverTickOnClient;                                        // 0x0039   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x003A   (0x0006)  MISSED
};

/// Class /Script/ConZ.EntitySetup
/// Size: 0x0040 (0x000040 - 0x000080)
class UEntitySetup : public UEntitySystemObjectSetup
{ 
public:
	bool                                               Transient;                                                  // 0x0040   (0x0001)  
	bool                                               Hidden;                                                     // 0x0041   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0042   (0x0002)  MISSED
	float                                              BoundsRadius;                                               // 0x0044   (0x0004)  
	TWeakObjectPtr<UClass*>                            Actor;                                                      // 0x0048   (0x0028)  
	TArray<FEntitySetup_Component>                     Components;                                                 // 0x0070   (0x0010)  
};

/// Class /Script/ConZ.AbandonedBunkerManagerSetup
/// Size: 0x0000 (0x000080 - 0x000080)
class UAbandonedBunkerManagerSetup : public UEntitySetup
{ 
public:
};

/// Class /Script/ConZ.AbandonedBunkerSwitchboard
/// Size: 0x0130 (0x000220 - 0x000350)
class AAbandonedBunkerSwitchboard : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x50];                                      // 0x0220   (0x0050)  MISSED
	USwitchboardComponent*                             _switchboardComponent;                                      // 0x0270   (0x0008)  
	UGaugeClusterComponent*                            _gaugeClusterComponent;                                     // 0x0278   (0x0008)  
	bool                                               _isMasterSwitchboard;                                       // 0x0280   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0281   (0x0003)  MISSED
	float                                              _defaultLoadWhenPowered;                                    // 0x0284   (0x0004)  
	float                                              _defaultLoadDuringBlackout;                                 // 0x0288   (0x0004)  
	float                                              _fuseHealthLowPowerThreshold;                               // 0x028C   (0x0004)  
	FGameplayTag                                       _defaultFuseGaugeTag;                                       // 0x0290   (0x0008)  
	FGameplayTag                                       _attachedFuseGaugeTag;                                      // 0x0298   (0x0008)  
	FName                                              _fuseAttachmentSocketName;                                  // 0x02A0   (0x0008)  
	UClass*                                            _masterSwitchboardMinigameClass;                            // 0x02A8   (0x0008)  
	UClass*                                            _masterSwitchboardMinigameConfigurationClass;               // 0x02B0   (0x0008)  
	UClass*                                            _slaveSwitchboardMinigameClass;                             // 0x02B8   (0x0008)  
	UClass*                                            _slaveSwitchboardMinigameConfigurationClass;                // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	FTransform                                         _decalTransform;                                            // 0x02D0   (0x0030)  
	UAkAudioEvent*                                     _switchFlippedAudioEvent;                                   // 0x0300   (0x0008)  
	UAkAudioEvent*                                     _fuseAddedAudioEvent;                                       // 0x0308   (0x0008)  
	UAkAudioEvent*                                     _fuseBurnedAudioEvent;                                      // 0x0310   (0x0008)  
	float                                              _emissiveStrengthWhenPowered;                               // 0x0318   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x031C   (0x0004)  MISSED
	AItem*                                             _repAttachedFuseItem;                                       // 0x0320   (0x0008)  
	AItem*                                             _attachedFuseItem;                                          // 0x0328   (0x0008)  
	unsigned char                                      UnknownData04_6[0x20];                                      // 0x0330   (0x0020)  MISSED


	/// Functions
	// Function /Script/ConZ.AbandonedBunkerSwitchboard.OnRep_AttachedFuseItem
	void OnRep_AttachedFuseItem();                                                                                           // [0x223d4b0] Final|Native|Private 
};

/// Class /Script/ConZ.AbandonedBunkerZoneBoxComponent
/// Size: 0x0000 (0x000480 - 0x000480)
class UAbandonedBunkerZoneBoxComponent : public UBoxComponent
{ 
public:
};

/// Class /Script/ConZ.AbandonedBunkerZoneCommonData
/// Size: 0x0190 (0x000030 - 0x0001C0)
class UAbandonedBunkerZoneCommonData : public UDataAsset
{ 
public:
	float                                              NoiseAccumulationLevels;                                    // 0x0030   (0x000C)  
	float                                              NoiseAccumulationLevelsExtraPerPlayer;                      // 0x003C   (0x000C)  
	float                                              NoiseLoudnessThreshold;                                     // 0x0048   (0x0004)  
	float                                              AccumulatedNoiseCap;                                        // 0x004C   (0x0004)  
	float                                              RoomAlarmNoiseIncreasePerTick;                              // 0x0050   (0x0004)  
	float                                              RoomAlarmNoiseIncreaseTickRate;                             // 0x0054   (0x0004)  
	TMap<FName, float>                                 NoiseAccumulationMultiplierPerNoiseTag;                     // 0x0058   (0x0050)  
	float                                              TimeToReleaseExtraResources;                                // 0x00A8   (0x0004)  
	float                                              TimeForNoiseLevelToStartDropping;                           // 0x00AC   (0x0004)  
	float                                              TimeForNoiseLevelAfterEnemyActivationToStartDropping;       // 0x00B0   (0x0004)  
	float                                              NoiseDropRatePerSecond;                                     // 0x00B4   (0x0004)  
	float                                              TimeForPlayerNoiseToStartDropping;                          // 0x00B8   (0x0004)  
	float                                              PlayerNoiseDropRatePerSecond;                               // 0x00BC   (0x0004)  
	float                                              BunkerComponentResetTime;                                   // 0x00C0   (0x0004)  
	float                                              CommotionEventCooldownMin;                                  // 0x00C4   (0x0004)  
	float                                              CommotionEventCooldownMax;                                  // 0x00C8   (0x0004)  
	float                                              RazorSpawnPointEnemyActivationDistance;                     // 0x00CC   (0x0004)  
	FFloatRange                                        EnemyActivationEventCooldownRange;                          // 0x00D0   (0x0010)  
	FFloatRange                                        EnemyActivationEventRespawnCooldownRange;                   // 0x00E0   (0x0010)  
	float                                              TimeAfterReturningFromEnemyActivationStateBeforeSpawnCooldownResets; // 0x00F0   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00F4   (0x0004)  MISSED
	TWeakObjectPtr<UClass*>                            RazorClass;                                                 // 0x00F8   (0x0028)  
	TWeakObjectPtr<UClass*>                            BrennerClass;                                               // 0x0120   (0x0028)  
	FInt32Range                                        NaturalRazorLimitRange;                                     // 0x0148   (0x0010)  
	int32_t                                            NaturalRazorLimitPlayerCap;                                 // 0x0158   (0x0004)  
	int32_t                                            ExtraNaturalRazorsPerPlayer;                                // 0x015C   (0x0004)  
	float                                              MinDistanceBetweenRazorsWhenSpawning;                       // 0x0160   (0x0004)  
	FInt32Range                                        VentilationRazorLimitRange;                                 // 0x0164   (0x0010)  
	FInt32Interval                                     VentilationRazorsSpawnedPerAlarmEvent;                      // 0x0174   (0x0008)  
	int32_t                                            VentilationRazorLimitPlayerCap;                             // 0x017C   (0x0004)  
	int32_t                                            ExtraVentilationRazorsPerPlayer;                            // 0x0180   (0x0004)  
	int32_t                                            MaxRazorCorpsesPerZone;                                     // 0x0184   (0x0004)  
	float                                              RazorCorpseRemovalCheckInterval;                            // 0x0188   (0x0004)  
	float                                              TimeToNormalRazorSpawnRazorRespawn;                         // 0x018C   (0x0004)  
	FInt32Interval                                     BaseZombieCountRange;                                       // 0x0190   (0x0008)  
	int32_t                                            ExtraZombiePerPlayer;                                       // 0x0198   (0x0004)  
	int32_t                                            ExtraZombiePlayerCap;                                       // 0x019C   (0x0004)  
	FFloatInterval                                     ZombieRespawnInterval;                                      // 0x01A0   (0x0008)  
	FInt32Interval                                     ZombieRespawnBatchSize;                                     // 0x01A8   (0x0008)  
	float                                              MinDistanceBetweenZombiesWhenSpawning;                      // 0x01B0   (0x0004)  
	float                                              MinDistanceBetweenEnemyAndPlayerWhenSpawning;               // 0x01B4   (0x0004)  
	FGameplayTag                                       VaultRoomId;                                                // 0x01B8   (0x0008)  
};

/// Class /Script/ConZ.AbandonedBunkerZoneManagerComponent
/// Size: 0x0050 (0x000200 - 0x000250)
class UAbandonedBunkerZoneManagerComponent : public USceneComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0200   (0x0008)  MISSED
	TArray<FTransform>                                 _razorNormalSpawnTransforms;                                // 0x0208   (0x0010)  
	TArray<ARazorSpawnPoint*>                          _razorSpawnPoints;                                          // 0x0218   (0x0010)  
	TArray<FTransform>                                 _brennerSpawnPoints;                                        // 0x0228   (0x0010)  
	TArray<FAbandonedBunkerZombieSpawnPoint>           _zombieSpawnPoints;                                         // 0x0238   (0x0010)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0248   (0x0008)  MISSED
};

/// Class /Script/ConZ.AchievementsManagerClient
/// Size: 0x0098 (0x000220 - 0x0002B8)
class AAchievementsManagerClient : public AActor
{ 
public:
	unsigned char                                      UnknownData00_1[0x98];                                      // 0x0220   (0x0098)  MISSED
};

/// Class /Script/ConZ.AchievementsManagerServer
/// Size: 0x0078 (0x000220 - 0x000298)
class AAchievementsManagerServer : public AActor
{ 
public:
	unsigned char                                      UnknownData00_1[0x78];                                      // 0x0220   (0x0078)  MISSED
};

/// Class /Script/ConZ.ActionProgressWidget
/// Size: 0x0050 (0x000260 - 0x0002B0)
class UActionProgressWidget : public UUserWidget
{ 
public:
	FMulticastInlineDelegate                           ActionProgressFinishedEvent;                                // 0x0260   (0x0010)  
	FMulticastInlineDelegate                           ActionProgressCancelledEvent;                               // 0x0270   (0x0010)  
	bool                                               CanCancel;                                                  // 0x0280   (0x0001)  
	unsigned char                                      UnknownData00_5[0xB];                                       // 0x0281   (0x000B)  MISSED
	float                                              _currentTime;                                               // 0x028C   (0x0004)  
	float                                              _duration;                                                  // 0x0290   (0x0004)  
	bool                                               _manualMode;                                                // 0x0294   (0x0001)  
	unsigned char                                      UnknownData01_6[0x1B];                                      // 0x0295   (0x001B)  MISSED


	/// Functions
	// Function /Script/ConZ.ActionProgressWidget.UnPauseProgress
	void UnPauseProgress();                                                                                                  // [0x223d660] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.ActionProgressWidget.SetProgress
	void SetProgress(float progress);                                                                                        // [0x223d5e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.ActionProgressWidget.PauseProgress
	void PauseProgress();                                                                                                    // [0x223d5c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.ActionProgressWidget.OnActionProgressFinishedEvent__DelegateSignature
	void OnActionProgressFinishedEvent__DelegateSignature();                                                                 // [0x2859740] MulticastDelegate|Public|Delegate 
	// Function /Script/ConZ.ActionProgressWidget.OnActionProgressCancelledEvent__DelegateSignature
	void OnActionProgressCancelledEvent__DelegateSignature();                                                                // [0x2859740] MulticastDelegate|Public|Delegate 
	// Function /Script/ConZ.ActionProgressWidget.ExecuteAction
	void ExecuteAction();                                                                                                    // [0x223d150] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.ActionProgressWidget.CancelAction
	void CancelAction();                                                                                                     // [0x223d030] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/ConZ.ActorStatics
/// Size: 0x0000 (0x000028 - 0x000028)
class UActorStatics : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/ConZ.AdjustableSeparator
/// Size: 0x0020 (0x000260 - 0x000280)
class UAdjustableSeparator : public UUserWidget
{ 
public:
	USizeBox*                                          _slotSizeBox;                                               // 0x0260   (0x0008)  
	UNamedSlot*                                        _divider;                                                   // 0x0268   (0x0008)  
	float                                              _slotMinHeight;                                             // 0x0270   (0x0004)  
	float                                              _slotMaxHeight;                                             // 0x0274   (0x0004)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0278   (0x0008)  MISSED
};

/// Class /Script/ConZ.AdminCommand
/// Size: 0x0060 (0x000028 - 0x000088)
class UAdminCommand : public UObject
{ 
public:
	FString                                            _verb;                                                      // 0x0028   (0x0010)  
	TArray<FAdminCommandArgumentDescription>           _argumentDescriptions;                                      // 0x0038   (0x0010)  
	int32_t                                            _numberOfRequiredArguments;                                 // 0x0048   (0x0004)  
	int32_t                                            _numberOfRepeatingArguments;                                // 0x004C   (0x0004)  
	bool                                               _isEnabled;                                                 // 0x0050   (0x0001)  
	bool                                               _isEnabledInShippingBuild;                                  // 0x0051   (0x0001)  
	bool                                               _isAdminStatusRequired;                                     // 0x0052   (0x0001)  
	bool                                               _isDeveloperStatusRequired;                                 // 0x0053   (0x0001)  
	bool                                               _shouldExecuteOnServer;                                     // 0x0054   (0x0001)  
	bool                                               _shouldExecuteOnClient;                                     // 0x0055   (0x0001)  
	bool                                               _shouldDisableSingleplayerAchievementsIfExecuted;           // 0x0056   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x0057   (0x0001)  MISSED
	FText                                              _description;                                               // 0x0058   (0x0018)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x0070   (0x0018)  MISSED


	/// Functions
	// Function /Script/ConZ.AdminCommand.Execute
	bool Execute(TArray<FString>& arguments);                                                                                // [0x223d070] Native|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/ConZ.AdminCommand.CanEverBeExecuted
	bool CanEverBeExecuted(APlayerController* Controller, FString& reasonIfNot);                                             // [0x223cf30] Native|Event|Public|HasOutParms|BlueprintEvent|Const 
	// Function /Script/ConZ.AdminCommand.CanBeExecuted
	bool CanBeExecuted(APlayerController* Controller, FString& reasonIfNot);                                                 // [0x223ce30] Native|Event|Public|HasOutParms|BlueprintEvent|Const 
};

/// Class /Script/ConZ.AdminCommand_AddOrRemoveWidget
/// Size: 0x0050 (0x000088 - 0x0000D8)
class UAdminCommand_AddOrRemoveWidget : public UAdminCommand
{ 
public:
	TMap<FName, UClass*>                               _widgetClassesByName;                                       // 0x0088   (0x0050)  
};

/// Class /Script/ConZ.AdminCommand_AddPrisonerBodyEffect
/// Size: 0x0008 (0x000088 - 0x000090)
class UAdminCommand_AddPrisonerBodyEffect : public UAdminCommand
{ 
public:
	UClass*                                            _bodyEffectClass;                                           // 0x0088   (0x0008)  
};

/// Class /Script/ConZ.AdminCommand_AdminLight
/// Size: 0x0010 (0x000088 - 0x000098)
class UAdminCommand_AdminLight : public UAdminCommand
{ 
public:
	UClass*                                            _adminLightComponent;                                       // 0x0088   (0x0008)  
	float                                              _maxIntensityMultiplier;                                    // 0x0090   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0094   (0x0004)  MISSED
};

/// Class /Script/ConZ.AdminCommand_Announce
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_Announce : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_BanPlayer
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_BanPlayer : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_BoatDebug
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_BoatDebug : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_CancelVote
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_CancelVote : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ChangeCurrencyBalance
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ChangeCurrencyBalance : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ChangeCurrencyBalanceToAll
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ChangeCurrencyBalanceToAll : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ChangeCurrencyBalanceToAllOnline
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ChangeCurrencyBalanceToAllOnline : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_CharacterSpawner
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_CharacterSpawner : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ClearFakeName
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ClearFakeName : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_CompleteMission
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_CompleteMission : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_CrashMajestically
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_CrashMajestically : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_CreateEntity
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_CreateEntity : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DebugWeapon
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DebugWeapon : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DemolitionSkillDebug
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DemolitionSkillDebug : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DestroyAllItemsWithinRadius
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DestroyAllItemsWithinRadius : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DestroyAllVehicles
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DestroyAllVehicles : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DestroyCorpsesWithinRadius
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DestroyCorpsesWithinRadius : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DestroyEntity
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DestroyEntity : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DestroyVehicle
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DestroyVehicle : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DestroyZombiesWithinRadius
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DestroyZombiesWithinRadius : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DisablePrisonerBodyEffects
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DisablePrisonerBodyEffects : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DistanceDebug
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DistanceDebug : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DoorDebug
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DoorDebug : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DumpAllSquadsInfoList
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DumpAllSquadsInfoList : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_DumpWetnessDebug
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_DumpWetnessDebug : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_EnableHuntingClueDebugArrow
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_EnableHuntingClueDebugArrow : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_EnableOrDisableServer
/// Size: 0x0008 (0x000088 - 0x000090)
class UAdminCommand_EnableOrDisableServer : public UAdminCommand
{ 
public:
	bool                                               _shouldEnableServer;                                        // 0x0088   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0089   (0x0007)  MISSED
};

/// Class /Script/ConZ.AdminCommand_EndTournamentMode
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_EndTournamentMode : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_EquipParachute
/// Size: 0x0008 (0x000088 - 0x000090)
class UAdminCommand_EquipParachute : public UAdminCommand
{ 
public:
	UClass*                                            _parachuteClass;                                            // 0x0088   (0x0008)  
};

/// Class /Script/ConZ.AdminCommand_ExecuteConsoleCommand
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ExecuteConsoleCommand : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ExecutePrisonerBodyConditionInteraction
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ExecutePrisonerBodyConditionInteraction : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ExportItemLootTree
/// Size: 0x0008 (0x000088 - 0x000090)
class UAdminCommand_ExportItemLootTree : public UAdminCommand
{ 
public:
	EItemLootTreeToExport                              _lootTreeToExport;                                          // 0x0088   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0089   (0x0007)  MISSED
};

/// Class /Script/ConZ.AdminCommand_FindSquadMember
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_FindSquadMember : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_GetUserID
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_GetUserID : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_GetUserIDByRank
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_GetUserIDByRank : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_KickPlayer
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_KickPlayer : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_KnockoutPrisoner
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_KnockoutPrisoner : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_LeaveCorpse
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_LeaveCorpse : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListActiveHunts
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListActiveHunts : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListFlags
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListFlags : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListItemsSpawnLocations
/// Size: 0x0040 (0x000088 - 0x0000C8)
class UAdminCommand_ListItemsSpawnLocations : public UAdminCommand
{ 
public:
	FSearchItemSpawnerPresetArray                      _itemSpawnerPresets;                                        // 0x0088   (0x0020)  
	FSearchItemClassesArray                            _itemClasses;                                               // 0x00A8   (0x0020)  
};

/// Class /Script/ConZ.AdminCommand_ListMutedPlayers
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListMutedPlayers : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListPlayers
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListPlayers : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListPrimaryAssets
/// Size: 0x0058 (0x000088 - 0x0000E0)
class UAdminCommand_ListPrimaryAssets : public UAdminCommand
{ 
public:
	FPrimaryAssetType                                  _primaryAssetType;                                          // 0x0088   (0x0008)  
	TSet<FPrimaryAssetId>                              _primaryAssetsToExclude;                                    // 0x0090   (0x0050)  
};

/// Class /Script/ConZ.AdminCommand_ListPrisonerBodyConditionInteractions
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListPrisonerBodyConditionInteractions : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListPrisonerBodyEffects
/// Size: 0x0008 (0x000088 - 0x000090)
class UAdminCommand_ListPrisonerBodyEffects : public UAdminCommand
{ 
public:
	UClass*                                            _bodyEffectClass;                                           // 0x0088   (0x0008)  
};

/// Class /Script/ConZ.AdminCommand_ListPrisonerForeignSubstances
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListPrisonerForeignSubstances : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListSilencedPlayers
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListSilencedPlayers : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListSpawnedAnimals
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListSpawnedAnimals : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListSpawnedVehicles
/// Size: 0x0100 (0x000088 - 0x000188)
class UAdminCommand_ListSpawnedVehicles : public UAdminCommand
{ 
public:
	FGameplayTagContainer                              _vehicleSpawnGroupsByCategory;                              // 0x0088   (0x0100)  
};

/// Class /Script/ConZ.AdminCommand_ListSquadMembers
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListSquadMembers : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListSquads
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListSquads : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ListWeatherControllerOverrides
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ListWeatherControllerOverrides : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_Location
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_Location : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_LogCharacterSpawner
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_LogCharacterSpawner : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_Loot
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_Loot : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_MutePlayer
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_MutePlayer : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_PlacementDebug
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_PlacementDebug : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_PlayerInfo
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_PlayerInfo : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_PrintEntities
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_PrintEntities : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_RandomizePriceDeltas
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_RandomizePriceDeltas : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ReloadCustomMapConfig
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ReloadCustomMapConfig : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_RemovePrisonerBodyEffect
/// Size: 0x0008 (0x000088 - 0x000090)
class UAdminCommand_RemovePrisonerBodyEffect : public UAdminCommand
{ 
public:
	UClass*                                            _bodyEffectClass;                                           // 0x0088   (0x0008)  
};

/// Class /Script/ConZ.AdminCommand_RenameVehicle
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_RenameVehicle : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ResetAchievements
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ResetAchievements : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ResetEconomy
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ResetEconomy : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ResetMissionEnabled
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ResetMissionEnabled : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ResetSquadInfo
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ResetSquadInfo : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ScheduleWorldEvent
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ScheduleWorldEvent : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SendNotification
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SendNotification : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetAchievementUnlocked
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetAchievementUnlocked : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetAIInvisibility
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetAIInvisibility : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetAirplaneMaxVelocity
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetAirplaneMaxVelocity : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetAllInventoryAccess
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetAllInventoryAccess : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetCraftingSearch
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetCraftingSearch : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetCurrencyBalance
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetCurrencyBalance : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetCurrencyBalanceToAll
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetCurrencyBalanceToAll : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetCurrencyBalanceToAllOnline
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetCurrencyBalanceToAllOnline : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetDecayTimeDilation
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetDecayTimeDilation : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetDeluxeVersion
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetDeluxeVersion : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetFakeName
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetFakeName : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetFamePoints
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetFamePoints : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetFamePointsToAll
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetFamePointsToAll : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetFamePointsToAllOnline
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetFamePointsToAllOnline : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetFarmingSimulationSpeed
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetFarmingSimulationSpeed : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetGodMode
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetGodMode : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetHealthToItemInHands
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetHealthToItemInHands : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetInfiniteAmmo
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetInfiniteAmmo : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetItemDebugMode
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetItemDebugMode : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetMalfunctionProbability
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetMalfunctionProbability : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetMountedVehicleProperty
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetMountedVehicleProperty : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetPrisonerAttributes
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetPrisonerAttributes : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetPrisonerExhaustion
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetPrisonerExhaustion : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetPrisonerImmortality
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetPrisonerImmortality : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetPrisonerInfiniteOxygen
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetPrisonerInfiniteOxygen : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetPrisonerInfiniteStamina
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetPrisonerInfiniteStamina : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetPrisonerMetabolismSimulationSpeed
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetPrisonerMetabolismSimulationSpeed : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetPrisonerStamina
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetPrisonerStamina : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetReplishableResourceAmount
/// Size: 0x0010 (0x000088 - 0x000098)
class UAdminCommand_SetReplishableResourceAmount : public UAdminCommand
{ 
public:
	float                                              _defaultAreaOfEffect;                                       // 0x0088   (0x0004)  
	float                                              _minAreaOfEffect;                                           // 0x008C   (0x0004)  
	float                                              _maxAreaOfEffect;                                           // 0x0090   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0094   (0x0004)  MISSED
};

/// Class /Script/ConZ.AdminCommand_SetSkillLevel
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetSkillLevel : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetSuperJump
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetSuperJump : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetTime
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetTime : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetTimeSpeed
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetTimeSpeed : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetWeather
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetWeather : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetWeatherControllerOverrideActive
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetWeatherControllerOverrideActive : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SetWeatherControllerOverrideValue
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SetWeatherControllerOverrideValue : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShouldChainTeleportToVehicles
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShouldChainTeleportToVehicles : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShouldShowOtherPlayerInfo
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShouldShowOtherPlayerInfo : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShouldShowOtherPlayerLocations
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShouldShowOtherPlayerLocations : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShowBaseBuildingDebug
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShowBaseBuildingDebug : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShowFlagInfo
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShowFlagInfo : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShowFlagLocations
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShowFlagLocations : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShowNameplates
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShowNameplates : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShowRespawnTimes
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShowRespawnTimes : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShowVehicleDebug
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShowVehicleDebug : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShowVehicleInfo
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShowVehicleInfo : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShowVehicleLocations
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShowVehicleLocations : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ShowWeaponInfo
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_ShowWeaponInfo : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SilencePlayer
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SilencePlayer : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_Sleep
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_Sleep : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SpawnAllItems
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SpawnAllItems : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SpawnPrimaryActorAsset
/// Size: 0x0080 (0x000088 - 0x000108)
class UAdminCommand_SpawnPrimaryActorAsset : public UAdminCommand
{ 
public:
	FPrimaryAssetType                                  _primaryAssetType;                                          // 0x0088   (0x0008)  
	TSet<FPrimaryAssetId>                              _primaryAssetsToExclude;                                    // 0x0090   (0x0050)  
	int32_t                                            _countArgumentMinValue;                                     // 0x00E0   (0x0004)  
	int32_t                                            _countArgumentMaxValue;                                     // 0x00E4   (0x0004)  
	FVector                                            _spawnOffset;                                               // 0x00E8   (0x000C)  
	unsigned char                                      UnknownData00_6[0x14];                                      // 0x00F4   (0x0014)  MISSED
};

/// Class /Script/ConZ.AdminCommand_SpawnAnimal
/// Size: 0x0000 (0x000108 - 0x000108)
class UAdminCommand_SpawnAnimal : public UAdminCommand_SpawnPrimaryActorAsset
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SpawnBrenner
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SpawnBrenner : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SpawnDebugAnimalTrack
/// Size: 0x0008 (0x000088 - 0x000090)
class UAdminCommand_SpawnDebugAnimalTrack : public UAdminCommand
{ 
public:
	FPrimaryAssetType                                  _primaryAssetType;                                          // 0x0088   (0x0008)  
};

/// Class /Script/ConZ.AdminCommand_SpawnInventoryFullOf
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SpawnInventoryFullOf : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SpawnItem
/// Size: 0x0048 (0x000108 - 0x000150)
class UAdminCommand_SpawnItem : public UAdminCommand_SpawnPrimaryActorAsset
{ 
public:
	unsigned char                                      UnknownData00_1[0x48];                                      // 0x0108   (0x0048)  MISSED
};

/// Class /Script/ConZ.AdminCommand_SpawnRandomAnimal
/// Size: 0x0000 (0x000108 - 0x000108)
class UAdminCommand_SpawnRandomAnimal : public UAdminCommand_SpawnAnimal
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SpawnRandomPrimaryActorAsset
/// Size: 0x0000 (0x000108 - 0x000108)
class UAdminCommand_SpawnRandomPrimaryActorAsset : public UAdminCommand_SpawnPrimaryActorAsset
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SpawnRazor
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_SpawnRazor : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_SpawnReflectionSphere
/// Size: 0x0008 (0x000088 - 0x000090)
class UAdminCommand_SpawnReflectionSphere : public UAdminCommand
{ 
public:
	UClass*                                            _actorClass;                                                // 0x0088   (0x0008)  
};

/// Class /Script/ConZ.AdminCommand_SpawnVehicle
/// Size: 0x0008 (0x000108 - 0x000110)
class UAdminCommand_SpawnVehicle : public UAdminCommand_SpawnPrimaryActorAsset
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0108   (0x0008)  MISSED
};

/// Class /Script/ConZ.AdminCommand_StartTournamentMode
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_StartTournamentMode : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_Teleport
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_Teleport : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_TeleportTo
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_TeleportTo : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_TeleportTo3pm
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_TeleportTo3pm : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_TeleportToMe
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_TeleportToMe : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_TeleportToVehicle
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_TeleportToVehicle : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_ToggleFamePointsDebugVisualization
/// Size: 0x0008 (0x000088 - 0x000090)
class UAdminCommand_ToggleFamePointsDebugVisualization : public UAdminCommand
{ 
public:
	UClass*                                            _famePointDebugComponentClass;                              // 0x0088   (0x0008)  
};

/// Class /Script/ConZ.AdminCommand_TrackShotsFired
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_TrackShotsFired : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_TrapsDebug
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_TrapsDebug : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_UnbanPlayer
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_UnbanPlayer : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_UnmutePlayer
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_UnmutePlayer : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_UnsilencePlayer
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_UnsilencePlayer : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_VisualizeBulletTrajectories
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_VisualizeBulletTrajectories : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_VisualizePlayerAiming
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_VisualizePlayerAiming : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_VisualizeZombieLocation
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_VisualizeZombieLocation : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommand_Vote
/// Size: 0x0000 (0x000088 - 0x000088)
class UAdminCommand_Vote : public UAdminCommand
{ 
public:
};

/// Class /Script/ConZ.AdminCommandArgumentCompletion
/// Size: 0x0010 (0x000028 - 0x000038)
class UAdminCommandArgumentCompletion : public UObject
{ 
public:
	bool                                               _canCompletionValuesBeCached;                               // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0xF];                                       // 0x0029   (0x000F)  MISSED


	/// Functions
	// Function /Script/ConZ.AdminCommandArgumentCompletion.GetCompletionValues
	void GetCompletionValues(TArray<FString>& Result);                                                                       // [0x224bd90] Native|Event|Public|HasOutParms|BlueprintEvent|Const 
};

/// Class /Script/ConZ.AdminCommandArgumentCompletion_Achievements
/// Size: 0x0000 (0x000038 - 0x000038)
class UAdminCommandArgumentCompletion_Achievements : public UAdminCommandArgumentCompletion
{ 
public:
};

/// Class /Script/ConZ.AdminCommandArgumentCompletion_Constant
/// Size: 0x0010 (0x000038 - 0x000048)
class UAdminCommandArgumentCompletion_Constant : public UAdminCommandArgumentCompletion
{ 
public:
	TArray<FString>                                    _completionValues;                                          // 0x0038   (0x0010)  
};

/// Class /Script/ConZ.AdminCommandArgumentCompletion_Enum
/// Size: 0x0060 (0x000038 - 0x000098)
class UAdminCommandArgumentCompletion_Enum : public UAdminCommandArgumentCompletion
{ 
public:
	FName                                              _enum;                                                      // 0x0038   (0x0008)  
	bool                                               _excludeNoneEnumerator;                                     // 0x0040   (0x0001)  
	bool                                               _excludeCountEnumerator;                                    // 0x0041   (0x0001)  
	bool                                               _excludeAutoGeneratedEnumerator;                            // 0x0042   (0x0001)  
	unsigned char                                      UnknownData00_5[0x5];                                       // 0x0043   (0x0005)  MISSED
	TSet<FName>                                        _additionalEnumeratorsToExclude;                            // 0x0048   (0x0050)  
};

/// Class /Script/ConZ.AdminCommandArgumentCompletion_Player
/// Size: 0x0000 (0x000038 - 0x000038)
class UAdminCommandArgumentCompletion_Player : public UAdminCommandArgumentCompletion
{ 
public:
};

/// Class /Script/ConZ.AdminCommandArgumentCompletion_PrimaryAsset
/// Size: 0x0058 (0x000038 - 0x000090)
class UAdminCommandArgumentCompletion_PrimaryAsset : public UAdminCommandArgumentCompletion
{ 
public:
	FPrimaryAssetType                                  _primaryAssetType;                                          // 0x0038   (0x0008)  
	TSet<FPrimaryAssetId>                              _primaryAssetsToExclude;                                    // 0x0040   (0x0050)  
};

/// Class /Script/ConZ.AdminCommandArgumentCompletion_Skill
/// Size: 0x0000 (0x000038 - 0x000038)
class UAdminCommandArgumentCompletion_Skill : public UAdminCommandArgumentCompletion
{ 
public:
};

/// Class /Script/ConZ.AdminCommandArgumentCompletion_Squad
/// Size: 0x0000 (0x000038 - 0x000038)
class UAdminCommandArgumentCompletion_Squad : public UAdminCommandArgumentCompletion
{ 
public:
};

/// Class /Script/ConZ.AdminCommandArgumentCompletion_Widget
/// Size: 0x0008 (0x000038 - 0x000040)
class UAdminCommandArgumentCompletion_Widget : public UAdminCommandArgumentCompletion
{ 
public:
	UClass*                                            _commandClass;                                              // 0x0038   (0x0008)  
};

/// Class /Script/ConZ.AdminCommandArgumentDataTypeBase
/// Size: 0x00D8 (0x000030 - 0x000108)
class UAdminCommandArgumentDataTypeBase : public UDataAsset
{ 
public:
	FText                                              DataTypeName;                                               // 0x0030   (0x0018)  
	UClass*                                            ArgumentCompletion;                                         // 0x0048   (0x0008)  
	unsigned char                                      UnknownData00_6[0xB8];                                      // 0x0050   (0x00B8)  MISSED
};

/// Class /Script/ConZ.AdminCommandArgumentDataType_Bool
/// Size: 0x0008 (0x000108 - 0x000110)
class UAdminCommandArgumentDataType_Bool : public UAdminCommandArgumentDataTypeBase
{ 
public:
	bool                                               _defaultValue;                                              // 0x0108   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0109   (0x0007)  MISSED
};

/// Class /Script/ConZ.AdminCommandArgumentDataType_Location
/// Size: 0x0010 (0x000108 - 0x000118)
class UAdminCommandArgumentDataType_Location : public UAdminCommandArgumentDataTypeBase
{ 
public:
	FVector                                            _defaultValue;                                              // 0x0108   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0114   (0x0004)  MISSED
};

/// Class /Script/ConZ.AdminCommandArgumentDataType_Numeric
/// Size: 0x0008 (0x000108 - 0x000110)
class UAdminCommandArgumentDataType_Numeric : public UAdminCommandArgumentDataTypeBase
{ 
public:
	float                                              _defaultValue;                                              // 0x0108   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x010C   (0x0004)  MISSED
};

/// Class /Script/ConZ.AdminCommandArgumentDataType_String
/// Size: 0x0018 (0x000108 - 0x000120)
class UAdminCommandArgumentDataType_String : public UAdminCommandArgumentDataTypeBase
{ 
public:
	FString                                            _defaultValue;                                              // 0x0108   (0x0010)  
	bool                                               _caseSensitive;                                             // 0x0118   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0119   (0x0007)  MISSED
};

/// Class /Script/ConZ.AdminCommandArgumentDataType_Transform
/// Size: 0x0038 (0x000108 - 0x000140)
class UAdminCommandArgumentDataType_Transform : public UAdminCommandArgumentDataTypeBase
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0108   (0x0008)  MISSED
	FTransform                                         _defaultValue;                                              // 0x0110   (0x0030)  
};

/// Class /Script/ConZ.AdminCommandArgumentDataType_TransformOrLocation
/// Size: 0x0010 (0x000108 - 0x000118)
class UAdminCommandArgumentDataType_TransformOrLocation : public UAdminCommandArgumentDataTypeBase
{ 
public:
	FVector                                            _defaultLocationValue;                                      // 0x0108   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0114   (0x0004)  MISSED
};

/// Class /Script/ConZ.AdminCommandCompletionManager
/// Size: 0x01B8 (0x000028 - 0x0001E0)
class UAdminCommandCompletionManager : public UObject
{ 
public:
	TMap<FString, UClass*>                             _commands;                                                  // 0x0028   (0x0050)  
	unsigned char                                      UnknownData00_6[0x168];                                     // 0x0078   (0x0168)  MISSED
};

/// Class /Script/ConZ.AdminCommandExecutor
/// Size: 0x0000 (0x000028 - 0x000028)
class UAdminCommandExecutor : public UInterface
{ 
public:
};

/// Class /Script/ConZ.AdminCommandRegistry
/// Size: 0x0060 (0x000028 - 0x000088)
class UAdminCommandRegistry : public UObject
{ 
public:
	TArray<UClass*>                                    _commands;                                                  // 0x0028   (0x0010)  
	unsigned char                                      UnknownData00_6[0x50];                                      // 0x0038   (0x0050)  MISSED
};

/// Class /Script/ConZ.AdminCommandsStatics
/// Size: 0x0000 (0x000028 - 0x000028)
class UAdminCommandsStatics : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/ConZ.AdminLight
/// Size: 0x0010 (0x000360 - 0x000370)
class UAdminLight : public UPointLightComponent
{ 
public:
	UCurveFloat*                                       _intensityVersusTimeOfDay;                                  // 0x0360   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0368   (0x0008)  MISSED
};

/// Class /Script/ConZ.AdminPlantPanel
/// Size: 0x0050 (0x000260 - 0x0002B0)
class UAdminPlantPanel : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0260   (0x0008)  MISSED
	UButton*                                           _seedingButton;                                             // 0x0268   (0x0008)  
	UButton*                                           _vegetatingButton;                                          // 0x0270   (0x0008)  
	UButton*                                           _floweringButton;                                           // 0x0278   (0x0008)  
	UButton*                                           _ripeningButton;                                            // 0x0280   (0x0008)  
	UButton*                                           _killButton;                                                // 0x0288   (0x0008)  
	UButton*                                           _addWeedButton;                                             // 0x0290   (0x0008)  
	UButton*                                           _removeWeedButton;                                          // 0x0298   (0x0008)  
	UButton*                                           _removePlantButton;                                         // 0x02A0   (0x0008)  
	UButton*                                           _addWaterButton;                                            // 0x02A8   (0x0008)  


	/// Functions
	// Function /Script/ConZ.AdminPlantPanel.OnClickVegetating
	void OnClickVegetating();                                                                                                // [0x224f190] Final|Native|Private 
	// Function /Script/ConZ.AdminPlantPanel.OnClickSeeding
	void OnClickSeeding();                                                                                                   // [0x224f170] Final|Native|Private 
	// Function /Script/ConZ.AdminPlantPanel.OnClickRipening
	void OnClickRipening();                                                                                                  // [0x224f150] Final|Native|Private 
	// Function /Script/ConZ.AdminPlantPanel.OnClickRemoveWeed
	void OnClickRemoveWeed();                                                                                                // [0x224f130] Final|Native|Private 
	// Function /Script/ConZ.AdminPlantPanel.OnClickRemovePlant
	void OnClickRemovePlant();                                                                                               // [0x224f110] Final|Native|Private 
	// Function /Script/ConZ.AdminPlantPanel.OnClickKill
	void OnClickKill();                                                                                                      // [0x224f0f0] Final|Native|Private 
	// Function /Script/ConZ.AdminPlantPanel.OnClickFlowering
	void OnClickFlowering();                                                                                                 // [0x224f0d0] Final|Native|Private 
	// Function /Script/ConZ.AdminPlantPanel.OnClickAddWeed
	void OnClickAddWeed();                                                                                                   // [0x224f0b0] Final|Native|Private 
	// Function /Script/ConZ.AdminPlantPanel.OnClickAddWater
	void OnClickAddWater();                                                                                                  // [0x224f090] Final|Native|Private 
};

/// Class /Script/ConZ.Objective
/// Size: 0x0100 (0x000220 - 0x000320)
class AObjective : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x90];                                      // 0x0220   (0x0090)  MISSED
	TArray<FDialogueInfo>                              _objectivesIntroDialogues;                                  // 0x02B0   (0x0010)  
	TArray<FDialogueInfo>                              _objectivesOutroSuccessDialogues;                           // 0x02C0   (0x0010)  
	TArray<FDialogueInfo>                              _objectivesOutroFailDialogues;                              // 0x02D0   (0x0010)  
	EObjectiveState                                    _objectiveState;                                            // 0x02E0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x02E1   (0x0003)  MISSED
	TWeakObjectPtr<AMission*>                          _parentMission;                                             // 0x02E4   (0x0008)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x02EC   (0x0004)  MISSED
	FText                                              _description;                                               // 0x02F0   (0x0018)  
	unsigned char                                      UnknownData03_5[0x11];                                      // 0x0308   (0x0011)  MISSED
	bool                                               _canInterruptDialogue;                                      // 0x0319   (0x0001)  
	bool                                               _playUISounds;                                              // 0x031A   (0x0001)  
	unsigned char                                      UnknownData04_6[0x5];                                       // 0x031B   (0x0005)  MISSED


	/// Functions
	// Function /Script/ConZ.Objective.SetObjectiveState
	void SetObjectiveState(EObjectiveState Value, bool silent);                                                              // [0x233d9d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Objective.Server_ActiveObjectiveInitialized
	void Server_ActiveObjectiveInitialized();                                                                                // [0x22a0fa0] Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable 
	// Function /Script/ConZ.Objective.OnRep_ObjectiveStateChanged
	void OnRep_ObjectiveStateChanged();                                                                                      // [0x12375f0] Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Objective.IsStarted
	bool IsStarted();                                                                                                        // [0x233d650] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Objective.IsCompleted
	bool IsCompleted();                                                                                                      // [0x233d620] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Objective.GetDescription
	FText GetDescription();                                                                                                  // [0x233d520] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Objective.FailObjective
	void FailObjective(bool forceFail);                                                                                      // [0x233d490] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Objective.CompleteObjective
	void CompleteObjective();                                                                                                // [0x233d470] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Objective.Client_ShowWaypointWidget
	void Client_ShowWaypointWidget(AActor* targetActor, AActor* actorToTieLifetime);                                         // [0x233d3a0] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/ConZ.Objective.Client_RemoveWaypointWidget
	void Client_RemoveWaypointWidget();                                                                                      // [0x22700a0] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/ConZ.Objective.Client_BroadcastTrackedItemAmount
	void Client_BroadcastTrackedItemAmount(int32_t currentAmount);                                                           // [0x233d310] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/ConZ.Objective.CanInterruptDialogue
	bool CanInterruptDialogue();                                                                                             // [0x233d2e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/ConZ.RequirementObjective
/// Size: 0x0010 (0x000320 - 0x000330)
class ARequirementObjective : public AObjective
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0320   (0x0010)  MISSED
};

/// Class /Script/ConZ.BlueprintableItemObjective
/// Size: 0x0038 (0x000330 - 0x000368)
class ABlueprintableItemObjective : public ARequirementObjective
{ 
public:
	EBlueprintItemActionType                           _actionType;                                                // 0x0330   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0331   (0x0007)  MISSED
	UClass*                                            _targetBlueprintActor;                                      // 0x0338   (0x0008)  
	TArray<UClass*>                                    _itemsToFill;                                               // 0x0340   (0x0010)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x0350   (0x0018)  MISSED
};

/// Class /Script/ConZ.AdvancedBlueprintableItemObjective
/// Size: 0x0010 (0x000368 - 0x000378)
class AAdvancedBlueprintableItemObjective : public ABlueprintableItemObjective
{ 
public:
	AMissionDialogueManager*                           _dialogueManager;                                           // 0x0368   (0x0008)  
	UDialogueData*                                     _dialogueData;                                              // 0x0370   (0x0008)  


	/// Functions
	// Function /Script/ConZ.AdvancedBlueprintableItemObjective.OnTabMenuOpenedHandler
	void OnTabMenuOpenedHandler(ETabMode tabMode);                                                                           // [0x224f480] Final|Native|Private 
};

/// Class /Script/ConZ.AdvancedBuoyancyComponent
/// Size: 0x0060 (0x0004E0 - 0x000540)
class UAdvancedBuoyancyComponent : public UStaticMeshComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0xC];                                       // 0x04E0   (0x000C)  MISSED
	float                                              _waterKinematicViscosity;                                   // 0x04EC   (0x0004)  
	float                                              _cPD1;                                                      // 0x04F0   (0x0004)  
	float                                              _cPD2;                                                      // 0x04F4   (0x0004)  
	float                                              _fP;                                                        // 0x04F8   (0x0004)  
	float                                              _cSD1;                                                      // 0x04FC   (0x0004)  
	float                                              _cSD2;                                                      // 0x0500   (0x0004)  
	float                                              _fS;                                                        // 0x0504   (0x0004)  
	float                                              _maxAcceleration;                                           // 0x0508   (0x0004)  
	float                                              _p;                                                         // 0x050C   (0x0004)  
	float                                              _maxHydrodynamicVelocity;                                   // 0x0510   (0x0004)  
	unsigned char                                      UnknownData01_6[0x2C];                                      // 0x0514   (0x002C)  MISSED
};

/// Class /Script/ConZ.CraftingObjective
/// Size: 0x0018 (0x000330 - 0x000348)
class ACraftingObjective : public ARequirementObjective
{ 
public:
	TArray<TWeakObjectPtr>                             _targetItems;                                               // 0x0330   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0340   (0x0008)  MISSED
};

/// Class /Script/ConZ.AdvancedCraftingObjective
/// Size: 0x0020 (0x000348 - 0x000368)
class AAdvancedCraftingObjective : public ACraftingObjective
{ 
public:
	UCraftableItem*                                    _craftableItem;                                             // 0x0348   (0x0008)  
	AMissionDialogueManager*                           _dialogueManager;                                           // 0x0350   (0x0008)  
	UDialogueData*                                     _dialogueData;                                              // 0x0358   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0360   (0x0008)  MISSED


	/// Functions
	// Function /Script/ConZ.AdvancedCraftingObjective.OnTabMenuOpenedHandler
	void OnTabMenuOpenedHandler(ETabMode tabMode);                                                                           // [0x224f500] Final|Native|Private 
};

/// Class /Script/ConZ.AIDetectionTimerHandler
/// Size: 0x0050 (0x000220 - 0x000270)
class AAIDetectionTimerHandler : public AActor
{ 
public:
	unsigned char                                      UnknownData00_1[0x50];                                      // 0x0220   (0x0050)  MISSED
};

/// Class /Script/ConZ.VehicleBase
/// Size: 0x08B0 (0x000280 - 0x000B30)
class AVehicleBase : public APawn
{ 
public:
	unsigned char                                      UnknownData00_2[0x1C0];                                     // 0x0280   (0x01C0)  MISSED
	UVehicleMeshComponent*                             _vehicleMeshComponent;                                      // 0x0440   (0x0008)  
	unsigned char                                      UnknownData01_5[0x1C];                                      // 0x0448   (0x001C)  MISSED
	bool                                               _shouldApplyWaterDrag;                                      // 0x0464   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0465   (0x0003)  MISSED
	float                                              _waterDragForceCoefficient;                                 // 0x0468   (0x0004)  
	FFloatInterval                                     _submergedInWaterDamagePerSecond;                           // 0x046C   (0x0008)  
	unsigned char                                      UnknownData03_5[0x54];                                      // 0x0474   (0x0054)  MISSED
	AVehicleItemContainer*                             _itemContainer;                                             // 0x04C8   (0x0008)  
	TArray<UVehicleAttachment*>                        _vehicleAttachments;                                        // 0x04D0   (0x0010)  
	TArray<UVehicleAttachment*>                        _repVehicleAttachments;                                     // 0x04E0   (0x0010)  
	unsigned char                                      UnknownData04_5[0x10];                                      // 0x04F0   (0x0010)  MISSED
	FVehicleAttachmentSlot                             _chassisSlot;                                               // 0x0500   (0x0048)  
	unsigned char                                      UnknownData05_5[0x8];                                       // 0x0548   (0x0008)  MISSED
	FGameplayTagContainer                              _lockInfluencingAttachmentSlotTags;                         // 0x0550   (0x0020)  
	FGameplayTagContainer                              _lockingAttachmentSlotTags;                                 // 0x0570   (0x0020)  
	TArray<UVehicleSystem*>                            _vehicleSystems;                                            // 0x0590   (0x0010)  
	unsigned char                                      UnknownData06_5[0x18];                                      // 0x05A0   (0x0018)  MISSED
	FPackedEntitySetupAndId                            _repServerEntitySetupAndId;                                 // 0x05B8   (0x0008)  
	UVehicleForcePushComponent*                        _forcePushComponent;                                        // 0x05C0   (0x0008)  
	TMap<UVehicleAttachment*, UWidgetComponent*>       _attachmentHealthWidgets;                                   // 0x05C8   (0x0050)  
	UClass*                                            _attachmentHealthWidget;                                    // 0x0618   (0x0008)  
	UNetworkPredictionComponent*                       _networkPrediction;                                         // 0x0620   (0x0008)  
	FGameplayTag                                       SpawnGroup;                                                 // 0x0628   (0x0008)  
	unsigned char                                      UnknownData07_5[0x8];                                       // 0x0630   (0x0008)  MISSED
	UClass*                                            _itemContainerClass;                                        // 0x0638   (0x0008)  
	FRepairableParams                                  _repairableParams;                                          // 0x0640   (0x0038)  
	unsigned char                                      UnknownData08_5[0x1];                                       // 0x0678   (0x0001)  MISSED
	bool                                               _repIsSimulatingPhysics;                                    // 0x0679   (0x0001)  
	unsigned char                                      UnknownData09_5[0x2];                                       // 0x067A   (0x0002)  MISSED
	FVector                                            _repLocationWhenNotSimulatingPhysics;                       // 0x067C   (0x000C)  
	FRotator                                           _repRotationWhenNotSimulatingPhysics;                       // 0x0688   (0x000C)  
	unsigned char                                      UnknownData10_5[0x4];                                       // 0x0694   (0x0004)  MISSED
	float                                              _physicsDormancyTimeout;                                    // 0x0698   (0x0004)  
	unsigned char                                      UnknownData11_5[0x1C];                                      // 0x069C   (0x001C)  MISSED
	UVehicleServiceComponent*                          _serviceComponent;                                          // 0x06B8   (0x0008)  
	bool                                               _isInQuickService;                                          // 0x06C0   (0x0001)  
	unsigned char                                      UnknownData12_5[0xC7];                                      // 0x06C1   (0x00C7)  MISSED
	UVehicleCameraStabilizerComponent*                 _cameraStabilizer;                                          // 0x0788   (0x0008)  
	unsigned char                                      UnknownData13_5[0x4];                                       // 0x0790   (0x0004)  MISSED
	uint32_t                                           _previewMeshTimePerMesh;                                    // 0x0794   (0x0004)  
	unsigned char                                      UnknownData14_5[0x8];                                       // 0x0798   (0x0008)  MISSED
	FText                                              _healthBarCaption;                                          // 0x07A0   (0x0018)  
	FVehicleImpactEffects                              _impactEffects;                                             // 0x07B8   (0x0118)  
	unsigned char                                      UnknownData15_5[0x60];                                      // 0x08D0   (0x0060)  MISSED
	float                                              _maxSpeedForInteraction;                                    // 0x0930   (0x0004)  
	float                                              _maxTiltAngleForMounting;                                   // 0x0934   (0x0004)  
	unsigned char                                      UnknownData16_5[0x8];                                       // 0x0938   (0x0008)  MISSED
	float                                              _maxSubmergedTime;                                          // 0x0940   (0x0004)  
	float                                              _maxSubmersionFactor;                                       // 0x0944   (0x0004)  
	unsigned char                                      UnknownData17_5[0x8];                                       // 0x0948   (0x0008)  MISSED
	UClass*                                            _mountSlotIndicatorsWidget;                                 // 0x0950   (0x0008)  
	unsigned char                                      UnknownData18_5[0x8];                                       // 0x0958   (0x0008)  MISSED
	float                                              _inWaterDestructionTimeInSeconds;                           // 0x0960   (0x0004)  
	float                                              _outOfWaterDestructionTimeInSeconds;                        // 0x0964   (0x0004)  
	UClass*                                            _vehicleHandlingSkill;                                      // 0x0968   (0x0008)  
	bool                                               _isInWater;                                                 // 0x0970   (0x0001)  
	unsigned char                                      UnknownData19_5[0x3];                                       // 0x0971   (0x0003)  MISSED
	float                                              _navigationRelevancyVelocitySquared;                        // 0x0974   (0x0004)  
	unsigned char                                      UnknownData20_5[0x18];                                      // 0x0978   (0x0018)  MISSED
	UParticleSystem*                                   _smokeParticlesLow;                                         // 0x0990   (0x0008)  
	UParticleSystem*                                   _smokeParticlesMedium;                                      // 0x0998   (0x0008)  
	UParticleSystem*                                   _smokeParticlesHigh;                                        // 0x09A0   (0x0008)  
	unsigned char                                      UnknownData21_5[0x8];                                       // 0x09A8   (0x0008)  MISSED
	UParticleSystemComponent*                          _smokeParticleSystemComponent;                              // 0x09B0   (0x0008)  
	FVector                                            _smokeParticlesOffset;                                      // 0x09B8   (0x000C)  
	EConZPxDominanceGroup                              _physicsDominanceGroup;                                     // 0x09C4   (0x0001)  
	unsigned char                                      UnknownData22_5[0x3];                                       // 0x09C5   (0x0003)  MISSED
	float                                              _aiNoiseFrequencyPerHour;                                   // 0x09C8   (0x0004)  
	ENoiseLevel                                        _aiNoiseLevel;                                              // 0x09CC   (0x0001)  
	unsigned char                                      UnknownData23_5[0x7];                                       // 0x09CD   (0x0007)  MISSED
	FVector                                            _aiNoiseOffset;                                             // 0x09D4   (0x000C)  
	TArray<FGameplayTag>                               _mountSlotsBySwitchSeatIndex;                               // 0x09E0   (0x0010)  
	FGameplayTag                                       _toggleMainLightsDeviceControlTag;                          // 0x09F0   (0x0008)  
	unsigned char                                      UnknownData24_5[0x8];                                       // 0x09F8   (0x0008)  MISSED
	FTransform                                         _unlockTransform;                                           // 0x0A00   (0x0030)  
	float                                              _forceUnlockMovementAcceptanceRadius;                       // 0x0A30   (0x0004)  
	float                                              _absoluteSpeedLimitKmh;                                     // 0x0A34   (0x0004)  
	EAITeam                                            _aiTeam;                                                    // 0x0A38   (0x0001)  
	unsigned char                                      UnknownData25_5[0x57];                                      // 0x0A39   (0x0057)  MISSED
	FVehicleDamageHandlerParams                        _damageHandlerParams;                                       // 0x0A90   (0x0010)  
	TMap<ECollisionDamageType, float>                  _damageRatios;                                              // 0x0AA0   (0x0050)  
	float                                              _explosionDamageRatio;                                      // 0x0AF0   (0x0004)  
	unsigned char                                      UnknownData26_5[0x2C];                                      // 0x0AF4   (0x002C)  MISSED
	APrisoner*                                         _driver;                                                    // 0x0B20   (0x0008)  
	unsigned char                                      UnknownData27_6[0x8];                                       // 0x0B28   (0x0008)  MISSED


	/// Functions
	// Function /Script/ConZ.VehicleBase.Server_CollideWithVehicle
	void Server_CollideWithVehicle(FGameplayTag myRegion, AVehicleBase* otherVehicle, FGameplayTag otherRegion, float impactSpeed); // [0x23fe760] Final|Net|NetReliableNative|Event|Private|NetServer 
	// Function /Script/ConZ.VehicleBase.Server_ApplyDamageToRegion
	void Server_ApplyDamageToRegion(FGameplayTag region, float Damage, float armorPenetration, ECollisionDamageType CollisionDamageType); // [0x23fe610] Final|Net|NetReliableNative|Event|Private|NetServer 
	// Function /Script/ConZ.VehicleBase.Server_ApplyDamageToAttachment
	void Server_ApplyDamageToAttachment(UVehicleAttachment* Attachment, float Damage, float armorPenetration, ECollisionDamageType CollisionDamageType); // [0x23fe4c0] Final|Net|NetReliableNative|Event|Private|NetServer 
	// Function /Script/ConZ.VehicleBase.OnRep_VehicleAttachments
	void OnRep_VehicleAttachments();                                                                                         // [0x23fe4a0] Final|Native|Private 
	// Function /Script/ConZ.VehicleBase.OnRep_ServiceComponent
	void OnRep_ServiceComponent();                                                                                           // [0x23fe480] Final|Native|Private 
	// Function /Script/ConZ.VehicleBase.OnRep_ServerEntitySetupAndId
	void OnRep_ServerEntitySetupAndId();                                                                                     // [0x23fe460] Final|Native|Private 
	// Function /Script/ConZ.VehicleBase.OnRep_ItemContainer
	void OnRep_ItemContainer();                                                                                              // [0x23fe440] Final|Native|Private 
};

/// Class /Script/ConZ.Airplane
/// Size: 0x01F0 (0x000B30 - 0x000D20)
class AAirplane : public AVehicleBase
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0B30   (0x0010)  MISSED
	ULiftComponent*                                    _physicsLiftComponent;                                      // 0x0B40   (0x0008)  
	unsigned char                                      UnknownData01_5[0x28];                                      // 0x0B48   (0x0028)  MISSED
	TMap<EAerodynamicSurfaceType, FAerodynamicSurfaceControlData> _aerodynamicSurfaceMap;                          // 0x0B70   (0x0050)  
	unsigned char                                      UnknownData02_5[0x10];                                      // 0x0BC0   (0x0010)  MISSED
	float                                              _airFlowParticlesSpeedKmhThreshold;                         // 0x0BD0   (0x0004)  
	float                                              _reverseTaxiingForce;                                       // 0x0BD4   (0x0004)  
	float                                              _maxReverseTaxiingVelocity;                                 // 0x0BD8   (0x0004)  
	float                                              _airplaneHeightToStallInMeters;                             // 0x0BDC   (0x0004)  
	float                                              _propellerForce;                                            // 0x0BE0   (0x0004)  
	float                                              _maxVelocity;                                               // 0x0BE4   (0x0004)  
	unsigned char                                      UnknownData03_5[0xC];                                       // 0x0BE8   (0x000C)  MISSED
	FInt32Range                                        _throttleLevelRange;                                        // 0x0BF4   (0x0010)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x0C04   (0x0004)  MISSED
	FRuntimeFloatCurve                                 _throttlePerLevel;                                          // 0x0C08   (0x0088)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x0C90   (0x0004)  MISSED
	float                                              _throttleLerpAmount;                                        // 0x0C94   (0x0004)  
	unsigned char                                      UnknownData06_5[0x8];                                       // 0x0C98   (0x0008)  MISSED
	float                                              _brakeLerpAmount;                                           // 0x0CA0   (0x0004)  
	unsigned char                                      UnknownData07_5[0x8];                                       // 0x0CA4   (0x0008)  MISSED
	float                                              _rollLerpAmount;                                            // 0x0CAC   (0x0004)  
	unsigned char                                      UnknownData08_5[0x8];                                       // 0x0CB0   (0x0008)  MISSED
	float                                              _yawLerpAmount;                                             // 0x0CB8   (0x0004)  
	unsigned char                                      UnknownData09_5[0x8];                                       // 0x0CBC   (0x0008)  MISSED
	float                                              _pitchLerpAmount;                                           // 0x0CC4   (0x0004)  
	unsigned char                                      UnknownData10_5[0x8];                                       // 0x0CC8   (0x0008)  MISSED
	float                                              _controlResetLerp;                                          // 0x0CD0   (0x0004)  
	unsigned char                                      UnknownData11_5[0x2C];                                      // 0x0CD4   (0x002C)  MISSED
	UStaticMeshComponent*                              _propellerMesh;                                             // 0x0D00   (0x0008)  
	UMaterialInterface*                                _propellerMaterial;                                         // 0x0D08   (0x0008)  
	UMaterialInstanceDynamic*                          _propellerMaterialDynamic;                                  // 0x0D10   (0x0008)  
	unsigned char                                      UnknownData12_6[0x8];                                       // 0x0D18   (0x0008)  MISSED


	/// Functions
	// Function /Script/ConZ.Airplane.UpdateHandlingParametersOnClient
	void UpdateHandlingParametersOnClient(bool ShouldHaveMouseInput, float engineIgnitionDurationMultiplier, float engineIgnitionFailureChance); // [0x224f820] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/ConZ.Airplane.OnPropellerHit
	void OnPropellerHit(UPrimitiveComponent* HitComponent, AActor* OtherActor, UPrimitiveComponent* OtherComponent, FVector NormalImpulse, FHitResult& Hit); // [0x224f240] Final|Native|Private|HasOutParms|HasDefaults 
};

/// Class /Script/ConZ.AirplaneAnimInstance
/// Size: 0x0070 (0x0002C0 - 0x000330)
class UAirplaneAnimInstance : public UAnimInstance
{ 
public:
	bool                                               IsAnyoneMounted;                                            // 0x02B8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02B9   (0x0003)  MISSED
	float                                              Speed;                                                      // 0x02BC   (0x0004)  
	float                                              SpeedKph;                                                   // 0x02C0   (0x0004)  
	float                                              PropellerRotationAngle;                                     // 0x02C4   (0x0004)  
	float                                              LeftAileronsAngle;                                          // 0x02C8   (0x0004)  
	float                                              RightAileronsAngle;                                         // 0x02CC   (0x0004)  
	float                                              ElevatorsAngle;                                             // 0x02D0   (0x0004)  
	float                                              RudderAngle;                                                // 0x02D4   (0x0004)  
	bool                                               IsMounteeDriver;                                            // 0x02D8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x02D9   (0x0003)  MISSED
	float                                              clockMinuteRotation;                                        // 0x02DC   (0x0004)  
	float                                              clockHourRotation;                                          // 0x02E0   (0x0004)  
	float                                              altimeterTensRotation;                                      // 0x02E4   (0x0004)  
	float                                              altimeterHundredsRotation;                                  // 0x02E8   (0x0004)  
	float                                              altimeterThousandsRotation;                                 // 0x02EC   (0x0004)  
	float                                              airSpeedRotation;                                           // 0x02F0   (0x0004)  
	float                                              rpmRotation;                                                // 0x02F4   (0x0004)  
	float                                              verticalSpeedRotation;                                      // 0x02F8   (0x0004)  
	float                                              throttleLeverRotation;                                      // 0x02FC   (0x0004)  
	float                                              leftYawPedalRotation;                                       // 0x0300   (0x0004)  
	float                                              rightYawPedalRotation;                                      // 0x0304   (0x0004)  
	FRotator                                           stickRotator;                                               // 0x0308   (0x000C)  
	FRotator                                           headingRotator;                                             // 0x0314   (0x000C)  
	bool                                               shouldHidePropellerBone;                                    // 0x0320   (0x0001)  
	unsigned char                                      UnknownData02_6[0xF];                                       // 0x0321   (0x000F)  MISSED
};

/// Class /Script/ConZ.AIStatics
/// Size: 0x0000 (0x000028 - 0x000028)
class UAIStatics : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/ConZ.AkComponentClientOnly
/// Size: 0x0000 (0x0003E0 - 0x0003E0)
class UAkComponentClientOnly : public UAkComponent
{ 
public:
};

/// Class /Script/ConZ.AmbientSounds
/// Size: 0x00D8 (0x000220 - 0x0002F8)
class AAmbientSounds : public AActor
{ 
public:
	float                                              MinCameraLocationDeltaForUpdate;                            // 0x0220   (0x0004)  
	FGameplayTag                                       ForestMask;                                                 // 0x0224   (0x0008)  
	float                                              ForestMaskSearchRadius;                                     // 0x022C   (0x0004)  
	UAkAudioEvent*                                     CoastalForestAudioEvent;                                    // 0x0230   (0x0008)  
	UAkAudioEvent*                                     ContinentalForest1AudioEvent;                               // 0x0238   (0x0008)  
	UAkAudioEvent*                                     ContinentalForest2AudioEvent;                               // 0x0240   (0x0008)  
	UAkAudioEvent*                                     ContinentalForest3AudioEvent;                               // 0x0248   (0x0008)  
	UAkAudioEvent*                                     UndergroundAudioEvent;                                      // 0x0250   (0x0008)  
	FGameplayTag                                       CityMask;                                                   // 0x0258   (0x0008)  
	float                                              CityMaskSearchRadius;                                       // 0x0260   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0264   (0x0004)  MISSED
	UAkAudioEvent*                                     CityAudioEvent;                                             // 0x0268   (0x0008)  
	UAkAudioEvent*                                     LargeVillageAudioEvent;                                     // 0x0270   (0x0008)  
	UAkAudioEvent*                                     SmallVillageAudioEvent;                                     // 0x0278   (0x0008)  
	UAkAudioEvent*                                     IndustrialAreaAudioEvent;                                   // 0x0280   (0x0008)  
	unsigned char                                      UnknownData01_6[0x70];                                      // 0x0288   (0x0070)  MISSED
};

/// Class /Script/ConZ.Item
/// Size: 0x06F0 (0x000220 - 0x000910)
class AItem : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0xA0];                                      // 0x0220   (0x00A0)  MISSED
	FMulticastInlineDelegate                           DebugTextChanged;                                           // 0x02C0   (0x0010)  
	FMulticastInlineDelegate                           PickedUpState;                                              // 0x02D0   (0x0010)  
	FMulticastInlineDelegate                           OnStaticMeshChanged;                                        // 0x02E0   (0x0010)  
	FMulticastInlineDelegate                           OnSkeletalMeshChanged;                                      // 0x02F0   (0x0010)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x0300   (0x0010)  MISSED
	UStaticMeshComponent*                              Mesh;                                                       // 0x0310   (0x0008)  
	unsigned char                                      UnknownData02_5[0x110];                                     // 0x0318   (0x0110)  MISSED
	UThrowingComponent*                                ThrowingComponent;                                          // 0x0428   (0x0008)  
	FText                                              _caption;                                                   // 0x0430   (0x0018)  
	FText                                              _description;                                               // 0x0448   (0x0018)  
	int32_t                                            _uses;                                                      // 0x0460   (0x0004)  
	float                                              _health;                                                    // 0x0464   (0x0004)  
	float                                              _maxHealth;                                                 // 0x0468   (0x0004)  
	float                                              _maxHealthPercentageAfterReachingBadQuality;                // 0x046C   (0x0004)  
	float                                              _weight;                                                    // 0x0470   (0x0004)  
	float                                              _initialWeightUsed;                                         // 0x0474   (0x0004)  
	float                                              _maxWaterWeightAsRatioOfWeight;                             // 0x0478   (0x0004)  
	float                                              _radiationDecreaseRate;                                     // 0x047C   (0x0004)  
	float                                              _maxRadiationAmountPerWeight;                               // 0x0480   (0x0004)  
	float                                              _baseRadiationPropagationFactor;                            // 0x0484   (0x0004)  
	bool                                               _canEverDecontaminate;                                      // 0x0488   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x0489   (0x0007)  MISSED
	UChoppingRecipeDataAsset*                          _choppingRecipeDataAsset;                                   // 0x0490   (0x0008)  
	bool                                               _shouldBeMaintained;                                        // 0x0498   (0x0001)  
	bool                                               _canBeDropped;                                              // 0x0499   (0x0001)  
	bool                                               _canTakeInHands;                                            // 0x049A   (0x0001)  
	bool                                               _canBeVisibleInVicinity;                                    // 0x049B   (0x0001)  
	bool                                               _canPlaceItemsOn;                                           // 0x049C   (0x0001)  
	bool                                               _canPlaceBlueprintsOn;                                      // 0x049D   (0x0001)  
	unsigned char                                      UnknownData04_5[0x2];                                       // 0x049E   (0x0002)  MISSED
	USkeletalMesh*                                     _overrideSkeletalMesh;                                      // 0x04A0   (0x0008)  
	unsigned char                                      UnknownData05_5[0x8];                                       // 0x04A8   (0x0008)  MISSED
	FTransform                                         _overrideSkeletalMeshRelativeTransform;                     // 0x04B0   (0x0030)  
	EItemExhausted                                     _ifExhausted;                                               // 0x04E0   (0x0001)  
	unsigned char                                      UnknownData06_5[0x3];                                       // 0x04E1   (0x0003)  MISSED
	float                                              _resourceAmountUsedPerWash;                                 // 0x04E4   (0x0004)  
	UTexture2D*                                        _inventoryIcon;                                             // 0x04E8   (0x0008)  
	UTexture2D*                                        _inventoryIconInHands;                                      // 0x04F0   (0x0008)  
	UTexture2D*                                        _outsideInventoryIcon;                                      // 0x04F8   (0x0008)  
	uint32_t                                           _sizeX;                                                     // 0x0500   (0x0004)  
	uint32_t                                           _sizeY;                                                     // 0x0504   (0x0004)  
	TArray<UBaseItemTag*>                              _inventoryWhiteList;                                        // 0x0508   (0x0010)  
	TArray<UBaseItemTag*>                              _inventoryBlackList;                                        // 0x0518   (0x0010)  
	float                                              _maxContainedWeight;                                        // 0x0528   (0x0004)  
	bool                                               _canContainNonEmptyItems;                                   // 0x052C   (0x0001)  
	bool                                               _canBeContainedIfNonEmpty;                                  // 0x052D   (0x0001)  
	bool                                               _isIgnoredBySpawners;                                       // 0x052E   (0x0001)  
	unsigned char                                      UnknownData07_5[0x1];                                       // 0x052F   (0x0001)  MISSED
	FFloatInterval                                     _spawnTimeoutPerPlayer;                                     // 0x0530   (0x0008)  
	FItemLocation                                      _itemLocation;                                              // 0x0538   (0x000F)  
	EItemRarity                                        _rarity;                                                    // 0x0547   (0x0001)  
	FGameplayTagContainer                              _itemSpawnTypes;                                            // 0x0548   (0x0020)  
	FGameplayTag                                       _itemSpawnGroup;                                            // 0x0568   (0x0008)  
	FVector                                            _spawnLocationOffset;                                       // 0x0570   (0x000C)  
	FRotator                                           _spawnRotationOffset;                                       // 0x057C   (0x000C)  
	float                                              _spawnRotationRandomization;                                // 0x0588   (0x0004)  
	float                                              _placementCollisionUpOffset;                                // 0x058C   (0x0004)  
	bool                                               _shouldOverrideUsageWhenSpawnedBySpawners;                  // 0x0590   (0x0001)  
	unsigned char                                      UnknownData08_5[0x3];                                       // 0x0591   (0x0003)  MISSED
	float                                              _initialUsageWhenSpawnedBySpawners;                         // 0x0594   (0x0004)  
	float                                              _randomizeUsageWhenSpawnedBySpawners;                       // 0x0598   (0x0004)  
	unsigned char                                      UnknownData09_5[0x4];                                       // 0x059C   (0x0004)  MISSED
	TArray<UBaseItemTag*>                              _itemTags;                                                  // 0x05A0   (0x0010)  
	TArray<UBaseItemTag*>                              _ownedItemTags;                                             // 0x05B0   (0x0010)  
	ENoiseLevel                                        _noiseLevel;                                                // 0x05C0   (0x0001)  
	unsigned char                                      UnknownData10_5[0x7];                                       // 0x05C1   (0x0007)  MISSED
	FItemMotionNoise                                   _motionNoise;                                               // 0x05C8   (0x0008)  
	UAkAudioEvent*                                     _inventoryHandlingSound;                                    // 0x05D0   (0x0008)  
	UAkAudioEvent*                                     _destroyedSound;                                            // 0x05D8   (0x0008)  
	TArray<UClass*>                                    _craftingIngredientTypes;                                   // 0x05E0   (0x0010)  
	EInteractionType                                   _craftingInteraction;                                       // 0x05F0   (0x0001)  
	unsigned char                                      UnknownData11_5[0x7];                                       // 0x05F1   (0x0007)  MISSED
	TArray<FCraftingPart>                              _defaultCraftingParts;                                      // 0x05F8   (0x0010)  
	float                                              _damageOnUse;                                               // 0x0608   (0x0004)  
	float                                              _damageOverTime;                                            // 0x060C   (0x0004)  
	float                                              _autoDestructTime;                                          // 0x0610   (0x0004)  
	bool                                               _allowContainedItemsDecay;                                  // 0x0614   (0x0001)  
	unsigned char                                      UnknownData12_5[0x7];                                       // 0x0615   (0x0007)  MISSED
	bool                                               _shouldDestroyContainedItemsOnDestroyEvent;                 // 0x061C   (0x0001)  
	unsigned char                                      UnknownData13_5[0x3];                                       // 0x061D   (0x0003)  MISSED
	float                                              _minTemperatureForHeatDamage;                               // 0x0620   (0x0004)  
	float                                              _containedDamageStartPercentage;                            // 0x0624   (0x0004)  
	float                                              _damageResponseFactor;                                      // 0x0628   (0x0004)  
	unsigned char                                      UnknownData14_5[0x4];                                       // 0x062C   (0x0004)  MISSED
	UClass*                                            _attachmentSocketMountType;                                 // 0x0630   (0x0008)  
	TArray<FAttachmentSocket>                          _attachmentSockets;                                         // 0x0638   (0x0010)  
	UClass*                                            _holsterAttachmentSocketMountType;                          // 0x0648   (0x0008)  
	TMap<UClass*, FAttachmentSocketOffset>             _attachmentSocketsOffset;                                   // 0x0650   (0x0050)  
	bool                                               _enableGlowOnBeginPlay;                                     // 0x06A0   (0x0001)  
	bool                                               _enableAwarenessGlow;                                       // 0x06A1   (0x0001)  
	bool                                               _enableHoverGlow;                                           // 0x06A2   (0x0001)  
	unsigned char                                      UnknownData15_5[0x5];                                       // 0x06A3   (0x0005)  MISSED
	UStaticMesh*                                       _placementMeshOverride;                                     // 0x06A8   (0x0008)  
	UStaticMesh*                                       _staticMeshHolsterOverride;                                 // 0x06B0   (0x0008)  
	USkeletalMesh*                                     _skeletalMeshHolsterOverride;                               // 0x06B8   (0x0008)  
	bool                                               _hasHighLoadPriorityInVirtualization;                       // 0x06C0   (0x0001)  
	unsigned char                                      UnknownData16_5[0x3];                                       // 0x06C1   (0x0003)  MISSED
	float                                              _virtualizationDistanceOffset;                              // 0x06C4   (0x0004)  
	bool                                               _canEverBeVirtualized;                                      // 0x06C8   (0x0001)  
	unsigned char                                      UnknownData17_5[0x1];                                       // 0x06C9   (0x0001)  MISSED
	bool                                               _isSubjectToAllowMinesConfig;                               // 0x06CA   (0x0001)  
	unsigned char                                      UnknownData18_5[0x1];                                       // 0x06CB   (0x0001)  MISSED
	float                                              _resultHealthMultiplierWhenCraftingIngredient;              // 0x06CC   (0x0004)  
	float                                              _preferredDamagePerUpdate;                                  // 0x06D0   (0x0004)  
	bool                                               _useHandCorrections;                                        // 0x06D4   (0x0001)  
	unsigned char                                      UnknownData19_5[0x3];                                       // 0x06D5   (0x0003)  MISSED
	float                                              _vicinityCheckDistance;                                     // 0x06D8   (0x0004)  
	float                                              _reachabilityTestZOffset;                                   // 0x06DC   (0x0004)  
	TArray<UClass*>                                    _stackableClasses;                                          // 0x06E0   (0x0010)  
	int32_t                                            _maxNumOfStacks;                                            // 0x06F0   (0x0004)  
	float                                              _bloodDryingSpeed;                                          // 0x06F4   (0x0004)  
	FItemStackData                                     _stackData;                                                 // 0x06F8   (0x0010)  
	unsigned char                                      UnknownData20_5[0x8];                                       // 0x0708   (0x0008)  MISSED
	TArray<UItemStateBase*>                            _craftingPartsData;                                         // 0x0710   (0x0010)  
	unsigned char                                      UnknownData21_5[0x8];                                       // 0x0720   (0x0008)  MISSED
	USkeletalMeshComponent*                            _skeletalMeshComponent;                                     // 0x0728   (0x0008)  
	unsigned char                                      UnknownData22_5[0x4];                                       // 0x0730   (0x0004)  MISSED
	float                                              _weightUsed;                                                // 0x0734   (0x0004)  
	unsigned char                                      UnknownData23_5[0x18];                                      // 0x0738   (0x0018)  MISSED
	FPackedEntitySetupAndId                            _repServerEntitySetupAndId;                                 // 0x0750   (0x0008)  
	TArray<UItemComponent*>                            _itemComponents;                                            // 0x0758   (0x0010)  
	AActor*                                            _attachParentObject;                                        // 0x0768   (0x0008)  
	FVisibilityReplication                             _visibilityReplication;                                     // 0x0770   (0x0008)  
	unsigned char                                      UnknownData24_5[0x3C];                                      // 0x0778   (0x003C)  MISSED
	float                                              _radiationAmount;                                           // 0x07B4   (0x0004)  
	float                                              _uncraftTime;                                               // 0x07B8   (0x0004)  
	unsigned char                                      UnknownData25_5[0x4];                                       // 0x07BC   (0x0004)  MISSED
	uint64_t                                           _replicatedState;                                           // 0x07C0   (0x0008)  
	unsigned char                                      UnknownData26_5[0x1];                                       // 0x07C8   (0x0001)  MISSED
	char                                               _flagsReplicated;                                           // 0x07C9   (0x0001)  
	unsigned char                                      UnknownData27_5[0x26];                                      // 0x07CA   (0x0026)  MISSED
	USceneComponent*                                   _tempSceneComponent;                                        // 0x07F0   (0x0008)  
	unsigned char                                      UnknownData28_5[0x8];                                       // 0x07F8   (0x0008)  MISSED
	int64_t                                            _expirationTime;                                            // 0x0800   (0x0008)  
	TArray<FInventoryStackData>                        _stacks;                                                    // 0x0808   (0x0010)  
	AItem*                                             _stackExhaustedSuccessorItem;                               // 0x0818   (0x0008)  
	TScriptInterface<Class>                            _parentContainer;                                           // 0x0820   (0x0010)  
	TScriptInterface<Class>                            _parentInventoryNode;                                       // 0x0830   (0x0010)  
	unsigned char                                      UnknownData29_5[0x80];                                      // 0x0840   (0x0080)  MISSED
	TArray<FCraftingPart>                              _craftingParts;                                             // 0x08C0   (0x0010)  
	unsigned char                                      UnknownData30_6[0x40];                                      // 0x08D0   (0x0040)  MISSED


	/// Functions
	// Function /Script/ConZ.Item.Use
	bool Use(APrisoner* Prisoner, int32_t Usage, float usageWeight, bool Eat, float DamageMultiplier);                       // [0x2304fb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.UpdateVisuals
	void UpdateVisuals(bool shouldHandleAging);                                                                              // [0x2304f20] Native|Public        
	// Function /Script/ConZ.Item.UpdateMaterialsPaniniAmount
	void UpdateMaterialsPaniniAmount();                                                                                      // [0x2304f00] Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.StopBlinking
	void StopBlinking();                                                                                                     // [0x2304ee0] Final|Native|Public  
	// Function /Script/ConZ.Item.StaticMeshChangedDelegate__DelegateSignature
	void StaticMeshChangedDelegate__DelegateSignature(AItem* Item);                                                          // [0x2859740] MulticastDelegate|Public|Delegate 
	// Function /Script/ConZ.Item.StateChangedDelegate__DelegateSignature
	void StateChangedDelegate__DelegateSignature(AItem* Item);                                                               // [0x2859740] MulticastDelegate|Public|Delegate 
	// Function /Script/ConZ.Item.SkeletalMeshChangedDelegate__DelegateSignature
	void SkeletalMeshChangedDelegate__DelegateSignature(AItem* Item);                                                        // [0x2859740] MulticastDelegate|Public|Delegate 
	// Function /Script/ConZ.Item.SetWeight
	void SetWeight(float Value);                                                                                             // [0x2304e60] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.SetOutsideInventoryIcon
	void SetOutsideInventoryIcon(UTexture2D* Value);                                                                         // [0x2304dd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.SetMaxHealth
	void SetMaxHealth(float MaxHealth);                                                                                      // [0x2304d50] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.SetInventoryIconInHands
	void SetInventoryIconInHands(UTexture2D* Value);                                                                         // [0x2304cc0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.SetInventoryIcon
	void SetInventoryIcon(UTexture2D* Value);                                                                                // [0x2304c30] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.SetHealthAndUsage
	void SetHealthAndUsage(float health, int32_t Usage);                                                                     // [0x2304b60] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.SetHealth
	void SetHealth(float health);                                                                                            // [0x2304ae0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.SetCaption
	void SetCaption(FText& Value);                                                                                           // [0x2304a10] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/ConZ.Item.Server_Throw
	void Server_Throw(FVector ZeroBasedStartPosition, FRotator StartRotation, FVector StartVelocity);                        // [0x2304910] Net|NetReliableNative|Event|Public|NetServer|HasDefaults 
	// Function /Script/ConZ.Item.Repair
	void Repair(float healthToRepair);                                                                                       // [0x2304880] Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.RemoveStacks
	TScriptInterface<Class> RemoveStacks(int32_t stacksToSplit);                                                             // [0x23047d0] Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.PickedUpStateDelegate__DelegateSignature
	void PickedUpStateDelegate__DelegateSignature(AItem* Item, bool pickedUp);                                               // [0x2859740] MulticastDelegate|Public|Delegate 
	// Function /Script/ConZ.Item.OnRightClicked
	void OnRightClicked();                                                                                                   // [0xb92f40] Final|Native|Private 
	// Function /Script/ConZ.Item.OnRep_WeightUsed
	void OnRep_WeightUsed();                                                                                                 // [0x23047b0] Native|Protected     
	// Function /Script/ConZ.Item.OnRep_Visibility
	void OnRep_Visibility();                                                                                                 // [0x2304790] Native|Protected     
	// Function /Script/ConZ.Item.OnRep_Stacks
	void OnRep_Stacks();                                                                                                     // [0xb92f40] Final|Native|Private 
	// Function /Script/ConZ.Item.OnRep_StackData
	void OnRep_StackData();                                                                                                  // [0xb92f40] Final|Native|Private 
	// Function /Script/ConZ.Item.OnRep_ServerEntitySetupAndId
	void OnRep_ServerEntitySetupAndId();                                                                                     // [0x2304770] Native|Protected     
	// Function /Script/ConZ.Item.OnRep_ReplicatedState
	void OnRep_ReplicatedState();                                                                                            // [0x2304750] Final|Native|Private 
	// Function /Script/ConZ.Item.OnRep_Health
	void OnRep_Health();                                                                                                     // [0x2304730] Native|Protected     
	// Function /Script/ConZ.Item.OnRep_FlagsReplicated
	void OnRep_FlagsReplicated();                                                                                            // [0x2304710] Final|Native|Private 
	// Function /Script/ConZ.Item.OnProjectileStop
	void OnProjectileStop(FHitResult& ImpactResult);                                                                         // [0x2304640] Final|Native|Public|HasOutParms 
	// Function /Script/ConZ.Item.OnDetachedFromItem
	void OnDetachedFromItem(AItem* Item);                                                                                    // [0x2304490] Native|Event|Protected|BlueprintEvent 
	// Function /Script/ConZ.Item.OnDestroyedEvent
	void OnDestroyedEvent(AActor* Self);                                                                                     // [0x2304400] Native|Public        
	// Function /Script/ConZ.Item.OnContainedItemDestroyed
	void OnContainedItemDestroyed(AActor* containedItem);                                                                    // [0x2304370] Final|Native|Public  
	// Function /Script/ConZ.Item.OnAttachedToItem
	void OnAttachedToItem(AItem* Item);                                                                                      // [0x22dfbe0] Native|Event|Protected|BlueprintEvent 
	// Function /Script/ConZ.Item.NetMulticast_SpawnDestroyedEffects
	void NetMulticast_SpawnDestroyedEffects();                                                                               // [0x22700a0] Final|Net|Native|Event|NetMulticast|Private 
	// Function /Script/ConZ.Item.NetMulticast_SetActorDropLocationAndRotation
	void NetMulticast_SetActorDropLocationAndRotation(FVector Location, FRotator Rotation);                                  // [0x2304280] Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults 
	// Function /Script/ConZ.Item.NetMulticast_EnsureSpawned
	void NetMulticast_EnsureSpawned();                                                                                       // [0x2304260] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/ConZ.Item.Multicast_Throw
	void Multicast_Throw(FVector ZeroBasedStartPosition, FRotator StartRotation, FVector StartVelocity);                     // [0x2304160] Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults 
	// Function /Script/ConZ.Item.HasPriorityForContainerItem
	bool HasPriorityForContainerItem(AItem* containerItem);                                                                  // [0x23040a0] Native|Event|Public|BlueprintEvent|Const 
	// Function /Script/ConZ.Item.GetWidgetDisplayInfo
	FWidgetDisplayInfo GetWidgetDisplayInfo();                                                                               // [0x2304060] Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetWetness
	float GetWetness();                                                                                                      // [0x2304030] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetWeightUsed
	float GetWeightUsed();                                                                                                   // [0x2304000] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetWeightRemained
	float GetWeightRemained();                                                                                               // [0x2303fd0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetWeightPerUse
	float GetWeightPerUse();                                                                                                 // [0x2303fa0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetWeight
	float GetWeight();                                                                                                       // [0x2303f70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetWaterWeight
	float GetWaterWeight();                                                                                                  // [0x2303f30] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetUsedSlots
	int32_t GetUsedSlots();                                                                                                  // [0x2303f00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetUsedMass
	float GetUsedMass();                                                                                                     // [0x2303ed0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetTypes
	TArray<UClass*> GetTypes();                                                                                              // [0x2303e40] Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.GetTotalWeight
	float GetTotalWeight();                                                                                                  // [0x2303e10] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetTotalUses
	int32_t GetTotalUses();                                                                                                  // [0x2303de0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetSupportingHandIKLocation
	FVector GetSupportingHandIKLocation();                                                                                   // [0x2303da0] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetStacksCount
	int32_t GetStacksCount();                                                                                                // [0x2303d60] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetSizeY
	int32_t GetSizeY();                                                                                                      // [0x2303d20] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetSizeX
	int32_t GetSizeX();                                                                                                      // [0x2303ce0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetPrisonerAnimationSet
	EPrisonerAnimationSet GetPrisonerAnimationSet();                                                                         // [0x22de730] Native|Event|Public|BlueprintEvent|Const 
	// Function /Script/ConZ.Item.GetOutsideInventoryIcon
	UTexture2D* GetOutsideInventoryIcon();                                                                                   // [0x2303cb0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetObstructionTestCapsules
	void GetObstructionTestCapsules(TArray<FItemObstructionTestCapsule>& capsules);                                          // [0x2303c00] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetNormalizedMaxHealth
	float GetNormalizedMaxHealth();                                                                                          // [0x2303bd0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetNormalizedHealth
	float GetNormalizedHealth();                                                                                             // [0x2303ba0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetNoiseLoudnessWhenPickedUp
	float GetNoiseLoudnessWhenPickedUp();                                                                                    // [0x2303b60] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetNoiseLoudnessWhenDropped
	float GetNoiseLoudnessWhenDropped();                                                                                     // [0x2303b20] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetNoiseLoudnessOnGroundImpact
	float GetNoiseLoudnessOnGroundImpact();                                                                                  // [0x2303ae0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetMeshComponentForAttachmentToItem
	UMeshComponent* GetMeshComponentForAttachmentToItem(AItem* Item);                                                        // [0x2303a40] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetMeshComponent
	UMeshComponent* GetMeshComponent();                                                                                      // [0x2303a10] Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetMaxHealth
	float GetMaxHealth();                                                                                                    // [0x23039e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetInventoryIconInHands
	UTexture2D* GetInventoryIconInHands();                                                                                   // [0x2303840] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetInventoryIcon
	UTexture2D* GetInventoryIcon();                                                                                          // [0x2303810] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetInventoryGridSizeY
	int32_t GetInventoryGridSizeY();                                                                                         // [0x23037e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetInventoryGridSizeX
	int32_t GetInventoryGridSizeX();                                                                                         // [0x23037b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetIgnoreSupportingHandIK
	bool GetIgnoreSupportingHandIK();                                                                                        // [0x2303780] Native|Event|Public|BlueprintEvent|Const 
	// Function /Script/ConZ.Item.GetHealth
	float GetHealth();                                                                                                       // [0x2303750] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetDescription
	FText GetDescription();                                                                                                  // [0x2303710] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetDefaultMaxHealth
	float GetDefaultMaxHealth();                                                                                             // [0x23036e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetContainerDamagePercentage
	float GetContainerDamagePercentage();                                                                                    // [0x23036b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetCaption
	FText GetCaption();                                                                                                      // [0x2303670] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.GetAllContainedItems
	TArray<AItem*> GetAllContainedItems(bool recursive);                                                                     // [0x2303590] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.FindCharacterAndItemAnimation
	FCharacterAndItemAnimation FindCharacterAndItemAnimation(UObject* Context, EPrisonerMontage prisonerMontageType);        // [0x23034b0] Native|Event|Public|BlueprintEvent|Const 
	// Function /Script/ConZ.Item.FindAnimationMontage
	UAnimMontage* FindAnimationMontage(UObject* Context, EPrisonerMontage prisonerMontageType);                              // [0x23033e0] Native|Event|Public|BlueprintEvent|Const 
	// Function /Script/ConZ.Item.DropAt
	bool DropAt(APawn* dropper, FVector dropLocation, FRotator dropRotation);                                                // [0x23032a0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ConZ.Item.DropAround
	bool DropAround(AActor* Actor, APawn* dropper, float Radius);                                                            // [0x2303190] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.Drop
	void Drop(APawn* dropper, bool wasThrown, bool dropDown);                                                                // [0x2303080] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.DetachFromAll
	void DetachFromAll();                                                                                                    // [0x2303060] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.DestroyInternal
	void DestroyInternal();                                                                                                  // [0x2303040] Native|Protected|BlueprintCallable 
	// Function /Script/ConZ.Item.DebugTextChangedDelegate__DelegateSignature
	void DebugTextChangedDelegate__DelegateSignature(AItem* Item);                                                           // [0x2859740] MulticastDelegate|Public|Delegate 
	// Function /Script/ConZ.Item.CanStackWith
	bool CanStackWith(UObject* Item);                                                                                        // [0x2302fa0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.CanStack
	bool CanStack();                                                                                                         // [0x2302f60] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.CanBeMeleeWeapon
	bool CanBeMeleeWeapon();                                                                                                 // [0xaa7a70] Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Script/ConZ.Item.CanBeDroppedBy
	bool CanBeDroppedBy(AConZCharacter* Character);                                                                          // [0x2302e90] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Item.CanBeCraftedByCharactrer
	bool CanBeCraftedByCharactrer(ACharacter* Character);                                                                    // [0x2302df0] Native|Event|Public|BlueprintEvent|Const 
	// Function /Script/ConZ.Item.CanAutoAddItem
	bool CanAutoAddItem(AItem* Item, char& column, char& row);                                                               // [0x2302cc0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/ConZ.Item.CanAddItem
	bool CanAddItem(AItem* Item, char column, char row);                                                                     // [0x2302bb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.Blink
	void Blink(float Duration);                                                                                              // [0x2302b30] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.AutoAddItemToInventoryNode
	bool AutoAddItemToInventoryNode(TScriptInterface<Class> Item);                                                           // [0x2302a80] Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.AttachToCharacterHands
	bool AttachToCharacterHands(AConZCharacter* Character);                                                                  // [0x23029e0] Native|Public|BlueprintCallable 
	// Function /Script/ConZ.Item.AddStack
	void AddStack(TScriptInterface<Class> Item);                                                                             // [0x2302930] Native|Public|BlueprintCallable 
};

/// Class /Script/ConZ.AmmunitionItem
/// Size: 0x0050 (0x000910 - 0x000960)
class AAmmunitionItem : public AItem
{ 
public:
	FGameplayTag                                       AmmunitionTag;                                              // 0x0910   (0x0008)  
	FString                                            AmmunitionTypeString;                                       // 0x0918   (0x0010)  
	UClass*                                            projectileClass;                                            // 0x0928   (0x0008)  
	UStaticMesh*                                       CartridgeMesh;                                              // 0x0930   (0x0008)  
	UStaticMesh*                                       CasingMesh;                                                 // 0x0938   (0x0008)  
	UStaticMesh*                                       UsedBadRoundMesh;                                           // 0x0940   (0x0008)  
	float                                              WeaponSpreadMultiplier;                                     // 0x0948   (0x0004)  
	int32_t                                            MaxAmmoCount;                                               // 0x094C   (0x0004)  
	int32_t                                            _ammoCount;                                                 // 0x0950   (0x0004)  
	int32_t                                            _ammoCountOwnerHelper;                                      // 0x0954   (0x0004)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0958   (0x0008)  MISSED


	/// Functions
	// Function /Script/ConZ.AmmunitionItem.SetAmmoCount
	void SetAmmoCount(int32_t Count, ERPCType broadcastRPCType);                                                             // [0x224f660] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.AmmunitionItem.OnRep_AmmoCountOwnerHelper
	void OnRep_AmmoCountOwnerHelper();                                                                                       // [0x224f440] Final|Native|Private 
	// Function /Script/ConZ.AmmunitionItem.OnRep_AmmoCount
	void OnRep_AmmoCount();                                                                                                  // [0x224f420] Final|Native|Private|Const 
	// Function /Script/ConZ.AmmunitionItem.NetMulticast_SetAmmoCount
	void NetMulticast_SetAmmoCount(int32_t Count);                                                                           // [0x224f000] Final|Net|NetReliableNative|Event|NetMulticast|Private 
	// Function /Script/ConZ.AmmunitionItem.GetSpreadMultiplierForWeapon
	float GetSpreadMultiplierForWeapon(AWeapon* Weapon);                                                                     // [0x224eee0] Native|Event|Public|BlueprintEvent|Const 
	// Function /Script/ConZ.AmmunitionItem.GetAmmoCount
	int32_t GetAmmoCount();                                                                                                  // [0x224eeb0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.AmmunitionItem.Client_SetAmmoCount
	void Client_SetAmmoCount(int32_t Count);                                                                                 // [0x224edd0] Final|Net|NetReliableNative|Event|Private|NetClient 
};

/// Class /Script/ConZ.AmmunitionArrow
/// Size: 0x0020 (0x000960 - 0x000980)
class AAmmunitionArrow : public AAmmunitionItem
{ 
public:
	bool                                               DestroyOnHit;                                               // 0x0960   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0961   (0x0007)  MISSED
	UClass*                                            BrokenArrowClass;                                           // 0x0968   (0x0008)  
	float                                              _muzzleVelocityMultiplier;                                  // 0x0970   (0x0004)  
	float                                              _stiffnessFactor;                                           // 0x0974   (0x0004)  
	float                                              _flightRotationCorrectionSpeed;                             // 0x0978   (0x0004)  
	float                                              _elasticityFactorSpread;                                    // 0x097C   (0x0004)  
};

/// Class /Script/ConZ.AmmunitionBoneListAssetData
/// Size: 0x0010 (0x000028 - 0x000038)
class UAmmunitionBoneListAssetData : public UAssetUserData
{ 
public:
	TArray<FName>                                      CartridgeBoneNames;                                         // 0x0028   (0x0010)  
};

/// Class /Script/ConZ.ItemStateBase
/// Size: 0x0058 (0x000028 - 0x000080)
class UItemStateBase : public UObject
{ 
public:
	UClass*                                            ItemClass;                                                  // 0x0028   (0x0008)  
	FEntityId                                          ID;                                                         // 0x0030   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0038   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0040   (0x0030)  
	TArray<UItemComponentStateBase*>                   Components;                                                 // 0x0070   (0x0010)  
};

/// Class /Script/ConZ.ItemState
/// Size: 0x0080 (0x000080 - 0x000100)
class UItemState : public UItemStateBase
{ 
public:
	float                                              normalizedHealth;                                           // 0x0080   (0x0004)  
	float                                              MaxHealth;                                                  // 0x0084   (0x0004)  
	float                                              Weight;                                                     // 0x0088   (0x0004)  
	float                                              WeightUsed;                                                 // 0x008C   (0x0004)  
	float                                              NormalizedRadiation;                                        // 0x0090   (0x0004)  
	bool                                               IsCrafted;                                                  // 0x0094   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0095   (0x0003)  MISSED
	float                                              UncraftTime;                                                // 0x0098   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x009C   (0x0004)  MISSED
	int64_t                                            LastAccessTime;                                             // 0x00A0   (0x0008)  
	bool                                               IsPartOfEvent;                                              // 0x00A8   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x00A9   (0x0003)  MISSED
	float                                              WaterWeight;                                                // 0x00AC   (0x0004)  
	float                                              Uses;                                                       // 0x00B0   (0x0004)  
	bool                                               IsInHands;                                                  // 0x00B4   (0x0001)  
	EPrisonerHolsterSide                               HolsterSide;                                                // 0x00B5   (0x0001)  
	unsigned char                                      UnknownData03_5[0x2];                                       // 0x00B6   (0x0002)  MISSED
	int32_t                                            QuickAccessBarIndex;                                        // 0x00B8   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x00BC   (0x0004)  MISSED
	TArray<UItemStateBase*>                            CraftingParts;                                              // 0x00C0   (0x0010)  
	TArray<UItemStateBase*>                            Stacks;                                                     // 0x00D0   (0x0010)  
	TArray<FEntityId>                                  _craftingPartsIds;                                          // 0x00E0   (0x0010)  
	TArray<FEntityId>                                  _stacksIds;                                                 // 0x00F0   (0x0010)  
};

/// Class /Script/ConZ.AmmunitionBoxItemState
/// Size: 0x0010 (0x000100 - 0x000110)
class UAmmunitionBoxItemState : public UItemState
{ 
public:
	int32_t                                            AmmoCount;                                                  // 0x0100   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x0104   (0x000C)  MISSED
};

/// Class /Script/ConZ.AmmunitionBoxItem
/// Size: 0x0020 (0x000910 - 0x000930)
class AAmmunitionBoxItem : public AItem
{ 
public:
	UClass*                                            AmmunitionItemClass;                                        // 0x0910   (0x0008)  
	UClass*                                            ItemClassToSpawnWhenUnpacked;                               // 0x0918   (0x0008)  
	int32_t                                            MaxAmmoCount;                                               // 0x0920   (0x0004)  
	int32_t                                            _ammoCount;                                                 // 0x0924   (0x0004)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0928   (0x0008)  MISSED


	/// Functions
	// Function /Script/ConZ.AmmunitionBoxItem.OnRep_AmmoCount
	void OnRep_AmmoCount();                                                                                                  // [0x224f420] Final|Native|Private 
};

/// Class /Script/ConZ.AmmunitionExplosiveArrow
/// Size: 0x0070 (0x000980 - 0x0009F0)
class AAmmunitionExplosiveArrow : public AAmmunitionArrow
{ 
public:
	UAkAudioEvent*                                     _startBeepingEvent;                                         // 0x0980   (0x0008)  
	UAkAudioEvent*                                     _stopBeepingEvent;                                          // 0x0988   (0x0008)  
	float                                              _startOfBeepingBeforeDetonation;                            // 0x0990   (0x0004)  
	float                                              _innerExplosionRadius;                                      // 0x0994   (0x0004)  
	float                                              _outerExplosionRadius;                                      // 0x0998   (0x0004)  
	float                                              _explosionBaseDamage;                                       // 0x099C   (0x0004)  
	float                                              _explosionMinDamage;                                        // 0x09A0   (0x0004)  
	float                                              _explosionDistanceFalloff;                                  // 0x09A4   (0x0004)  
	float                                              _explosionTimerTime;                                        // 0x09A8   (0x0004)  
	float                                              _explosionForce;                                            // 0x09AC   (0x0004)  
	FTargetTypeDamageMultiplier                        _targetTypeMultiplier;                                      // 0x09B0   (0x0010)  
	FName                                              _detonationPointSocketName;                                 // 0x09C0   (0x0008)  
	UClass*                                            _effectsActorClass;                                         // 0x09C8   (0x0008)  
	unsigned char                                      UnknownData00_5[0x10];                                      // 0x09D0   (0x0010)  MISSED
	bool                                               _shouldStartCountdown;                                      // 0x09E0   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x09E1   (0x000F)  MISSED


	/// Functions
	// Function /Script/ConZ.AmmunitionExplosiveArrow.Server_Explode
	void Server_Explode();                                                                                                   // [0x224f640] Final|Net|NetReliableNative|Event|Private|NetServer 
};

/// Class /Script/ConZ.AmmunitionItemState
/// Size: 0x0010 (0x000100 - 0x000110)
class UAmmunitionItemState : public UItemState
{ 
public:
	int32_t                                            AmmoCount;                                                  // 0x0100   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x0104   (0x000C)  MISSED
};

/// Class /Script/ConZ.ConZCharacter
/// Size: 0x02E0 (0x0004D0 - 0x0007B0)
class AConZCharacter : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_2[0x40];                                      // 0x04D0   (0x0040)  MISSED
	UChoppingRecipeDataAsset*                          ChoppingRecipeDataAsset;                                    // 0x0510   (0x0008)  
	bool                                               IterativeChopping;                                          // 0x0518   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0519   (0x0007)  MISSED
	UClass*                                            ItemRepresentation;                                         // 0x0520   (0x0008)  
	FName                                              HeadBoneName;                                               // 0x0528   (0x0008)  
	TMap<FName, EBodyPart>                             BodyPartByBoneName;                                         // 0x0530   (0x0050)  
	float                                              HeadHeight;                                                 // 0x0580   (0x0004)  
	float                                              TorsoHeight;                                                // 0x0584   (0x0004)  
	bool                                               ShouldAutoUpdateEnvironmentDescription;                     // 0x0588   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0589   (0x0003)  MISSED
	float                                              EnvironmentDescriptionAutoUpdateInterval;                   // 0x058C   (0x0004)  
	UAkAudioEvent*                                     EnteredIndoorEnvironmentAudioEvent;                         // 0x0590   (0x0008)  
	UAkAudioEvent*                                     EnteredOutdoorEnvironmentAudioEvent;                        // 0x0598   (0x0008)  
	UAkAudioEvent*                                     EnteredUndergroundAudioEvent;                               // 0x05A0   (0x0008)  
	UAkAudioEvent*                                     LeftUndergroundAudioEvent;                                  // 0x05A8   (0x0008)  
	unsigned char                                      UnknownData03_5[0x18];                                      // 0x05B0   (0x0018)  MISSED
	UVoiceChatComponent*                               VoiceChatComponent;                                         // 0x05C8   (0x0008)  
	unsigned char                                      UnknownData04_5[0x8];                                       // 0x05D0   (0x0008)  MISSED
	float                                              _kockoutChanceModifier;                                     // 0x05D8   (0x0004)  
	EConZGender                                        _gender;                                                    // 0x05DC   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x05DD   (0x0003)  MISSED
	UCharacterSoundComponent*                          SoundComponent;                                             // 0x05E0   (0x0008)  
	unsigned char                                      UnknownData06_5[0x38];                                      // 0x05E8   (0x0038)  MISSED
	EConZPxDominanceGroup                              _physicsDominanceGroup;                                     // 0x0620   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x0621   (0x0003)  MISSED
	float                                              _activeHitTimeToLive;                                       // 0x0624   (0x0004)  
	UCurveFloat*                                       _hitDamageVsVehicleSpeedInKph;                              // 0x0628   (0x0008)  
	FHitEffects                                        _effectsOnVehicleHit;                                       // 0x0630   (0x0118)  
	unsigned char                                      UnknownData08_5[0x10];                                      // 0x0748   (0x0010)  MISSED
	bool                                               _allowMultipleDamageReportsFromProjectile;                  // 0x0758   (0x0001)  
	unsigned char                                      UnknownData09_5[0x7];                                       // 0x0759   (0x0007)  MISSED
	UPhysicsAsset*                                     _physicsAssetOnServer;                                      // 0x0760   (0x0008)  
	EAITeam                                            _aiTeam;                                                    // 0x0768   (0x0001)  
	unsigned char                                      UnknownData10_5[0x7];                                       // 0x0769   (0x0007)  MISSED
	TArray<UCharacterAction*>                          _actionsList;                                               // 0x0770   (0x0010)  
	unsigned char                                      UnknownData11_5[0x20];                                      // 0x0780   (0x0020)  MISSED
	float                                              _characterActionPlayRateMultiplier;                         // 0x07A0   (0x0004)  
	unsigned char                                      UnknownData12_5[0x4];                                       // 0x07A4   (0x0004)  MISSED
	UGrappleActionComponent*                           _grappleActionComponent;                                    // 0x07A8   (0x0008)  


	/// Functions
	// Function /Script/ConZ.ConZCharacter.SetGender
	void SetGender(EConZGender Value);                                                                                       // [0x2293b80] Final|Native|Public|BlueprintCallable 
	// Function /Script/ConZ.ConZCharacter.SetEnvironmentDescription
	void SetEnvironmentDescription(FEnvironmentDescription& Value);                                                          // [0x2293ae0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/ConZ.ConZCharacter.Server_SetEnvironmentDescription
	void Server_SetEnvironmentDescription(FEnvironmentDescription Value);                                                    // [0x22939c0] Final|Net|NetReliableNative|Event|Private|NetServer 
	// Function /Script/ConZ.ConZCharacter.Server_RequestCharacterAction
	void Server_RequestCharacterAction(FCharacterActionReplicationHelper Value);                                             // [0x2293930] Final|Net|NetReliableNative|Event|Private|NetServer 
	// Function /Script/ConZ.ConZCharacter.Server_HandleMeleeAttackCapsuleHit
	void Server_HandleMeleeAttackCapsuleHit(AConZCharacter* attacker, FMeleeAttackCapsuleHitInfo HitInfo);                   // [0x22937f0] Final|Net|NetReliableNative|Event|Private|NetServer 
	// Function /Script/ConZ.ConZCharacter.Server_CharacterActionAck
	void Server_CharacterActionAck(FCharacterActionAck ack);                                                                 // [0x2293760] Final|Net|NetReliableNative|Event|Private|NetServer 
	// Function /Script/ConZ.ConZCharacter.OnRep_GrappleActionComponent
	void OnRep_GrappleActionComponent();                                                                                     // [0x2293720] Final|Native|Private 
	// Function /Script/ConZ.ConZCharacter.OnRep_Gender
	void OnRep_Gender(EConZGender oldGender);                                                                                // [0x22936a0] Final|Native|Private 
	// Function /Script/ConZ.ConZCharacter.NetMulticast_RequestCharacterAction
	void NetMulticast_RequestCharacterAction(FCharacterActionReplicationHelper Value, bool ignoreAutonomousProxy);           // [0x2292f30] Final|Net|NetReliableNative|Event|NetMulticast|Private 
	// Function /Script/ConZ.ConZCharacter.NetMulticast_HandleMeleeAttackCapsuleHit
	void NetMulticast_HandleMeleeAttackCapsuleHit(AConZCharacter* attacker, FMeleeAttackCapsuleHitInfo HitInfo);             // [0x2292df0] Final|Net|NetReliableNative|Event|NetMulticast|Private 
	// Function /Script/ConZ.ConZCharacter.NetMulticast_CharacterActionAck
	void NetMulticast_CharacterActionAck(FCharacterActionAck ack, bool ignoreAutonomousProxy);                               // [0x2292d10] Final|Net|NetReliableNative|Event|NetMulticast|Private 
	// Function /Script/ConZ.ConZCharacter.IsHeadBone
	bool IsHeadBone(FName BoneName);                                                                                         // [0x2292c40] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.IsConscious
	bool IsConscious();                                                                                                      // [0x2292c10] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.IsAlive
	bool IsAlive();                                                                                                          // [0x2292be0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.HasCharacterAction
	bool HasCharacterAction();                                                                                               // [0x2292bb0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.GetSoundComponent
	UCharacterSoundComponent* GetSoundComponent();                                                                           // [0x2292a10] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.GetHitReactBodyPartFromHitResult
	EDetectHitCollisionType GetHitReactBodyPartFromHitResult(FHitResult& HitResult);                                         // [0x2292860] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.GetHitReactBodyPartFromBodyPart
	EDetectHitCollisionType GetHitReactBodyPartFromBodyPart(EBodyPart Value);                                                // [0x22927d0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.GetGender
	EConZGender GetGender();                                                                                                 // [0x22927a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.GetEnvironmentDescription
	FEnvironmentDescription GetEnvironmentDescription();                                                                     // [0x2292770] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.GetCharacterAction
	UCharacterAction* GetCharacterAction();                                                                                  // [0x2292680] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.GetBodyPartFromBoneName
	EBodyPart GetBodyPartFromBoneName(FName BoneName);                                                                       // [0x22925e0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ConZCharacter.Client_RequestCharacterAction
	void Client_RequestCharacterAction(FCharacterActionReplicationHelper Value, bool cancelExecutingAction);                 // [0x2292500] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/ConZ.ConZCharacter.CharacterAction_EndHandle
	void CharacterAction_EndHandle(UCharacterAction* Action);                                                                // [0x2292470] Final|Native|Private 
	// Function /Script/ConZ.ConZCharacter.ActorHitCallback
	void ActorHitCallback(AActor* Actor, AActor* OtherActor, FVector NormalImpulse, FHitResult& Hit);                        // [0x2292220] Native|Protected|HasOutParms|HasDefaults 
};

/// Class /Script/ConZ.Animal2
/// Size: 0x01E0 (0x0007B0 - 0x000990)
class AAnimal2 : public AConZCharacter
{ 
public:
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x07B0   (0x0020)  MISSED
	FText                                              SpeciesName;                                                // 0x07D0   (0x0018)  
	EAnimalSpecies                                     SpeciesType;                                                // 0x07E8   (0x0001)  
	EAnimalActivityCycle                               ActivityCycle;                                              // 0x07E9   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x07EA   (0x0002)  MISSED
	float                                              MaxHealth;                                                  // 0x07EC   (0x0004)  
	UHitReactComponent*                                HitReactComponent;                                          // 0x07F0   (0x0008)  
	FGameplayTag                                       HitReactType;                                               // 0x07F8   (0x0008)  
	FName                                              EyesViewPointSocketName;                                    // 0x0800   (0x0008)  
	UClass*                                            TrackingMarker;                                             // 0x0808   (0x0008)  
	UClass*                                            BloodTrailMarker;                                           // 0x0810   (0x0008)  
	float                                              TrackingMarkerFrequency;                                    // 0x0818   (0x0004)  
	float                                              TrackingMarkerDistance;                                     // 0x081C   (0x0004)  
	float                                              TrackingMarkerRadius;                                       // 0x0820   (0x0004)  
	float                                              TrackingMarkerDuration;                                     // 0x0824   (0x0004)  
	float                                              BleedingSpeed;                                              // 0x0828   (0x0004)  
	float                                              LightWoundDamageAmount;                                     // 0x082C   (0x0004)  
	float                                              MeleeBleedingThreshold;                                     // 0x0830   (0x0004)  
	float                                              StuckCheckDuration;                                         // 0x0834   (0x0004)  
	float                                              StuckRadius;                                                // 0x0838   (0x0004)  
	char                                               UnstuckMode;                                                // 0x083C   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x083D   (0x0003)  MISSED
	FMulticastInlineDelegate                           OnDamageTaken;                                              // 0x0840   (0x0010)  
	float                                              HeadBoneRotationSendToServerInterval;                       // 0x0850   (0x0004)  
	float                                              SightRange;                                                 // 0x0854   (0x0004)  
	bool                                               TiltMeshOnSlopes;                                           // 0x0858   (0x0001)  
	bool                                               AdjustMeshHeightOnSlopes;                                   // 0x0859   (0x0001)  
	unsigned char                                      UnknownData03_5[0x2];                                       // 0x085A   (0x0002)  MISSED
	float                                              MeshPositionLerpSpeed;                                      // 0x085C   (0x0004)  
	float                                              BleedInterval;                                              // 0x0860   (0x0004)  
	bool                                               ShouldGoToRagdolIfTakenDamage;                              // 0x0864   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0865   (0x0003)  MISSED
	float                                              RagdollDuration;                                            // 0x0868   (0x0004)  
	float                                              _health;                                                    // 0x086C   (0x0004)  
	float                                              _woundDamage;                                               // 0x0870   (0x0004)  
	unsigned char                                      UnknownData05_5[0x8];                                       // 0x0874   (0x0008)  MISSED
	int32_t                                            _packSizeMin;                                               // 0x087C   (0x0004)  
	int32_t                                            _packSizeMax;                                               // 0x0880   (0x0004)  
	unsigned char                                      UnknownData06_5[0x34];                                      // 0x0884   (0x0034)  MISSED
	EAnimalStance                                      _animalStance;                                              // 0x08B8   (0x0001)  
	unsigned char                                      UnknownData07_5[0x7];                                       // 0x08B9   (0x0007)  MISSED
	bool                                               _shouldUpdateMovementSpeedRTPCValue;                        // 0x08C0   (0x0001)  
	unsigned char                                      UnknownData08_5[0x57];                                      // 0x08C1   (0x0057)  MISSED
	bool                                               _doNotCrumble;                                              // 0x0918   (0x0001)  
	unsigned char                                      UnknownData09_5[0x3];                                       // 0x0919   (0x0003)  MISSED
	float                                              _collisionDamageMultiplierPerBodyPart;                      // 0x091C   (0x0030)  
	unsigned char                                      UnknownData10_5[0x4];                                       // 0x094C   (0x0004)  MISSED
	float                                              _delayBetweenTakeDamageSounds;                              // 0x0950   (0x0004)  
	bool                                               _canDrown;                                                  // 0x0954   (0x0001)  
	unsigned char                                      UnknownData11_5[0x3];                                       // 0x0955   (0x0003)  MISSED
	float                                              _drownDamageCycleLength;                                    // 0x0958   (0x0004)  
	float                                              _drownDamagePerCycle;                                       // 0x095C   (0x0004)  
	unsigned char                                      UnknownData12_5[0x4];                                       // 0x0960   (0x0004)  MISSED
	float                                              _baseEyeForwardDistance;                                    // 0x0964   (0x0004)  
	bool                                               _isSearched;                                                // 0x0968   (0x0001)  
	unsigned char                                      UnknownData13_5[0x3];                                       // 0x0969   (0x0003)  MISSED
	float                                              _corpseSearchDuration;                                      // 0x096C   (0x0004)  
	float                                              _corpseMaxLifeTimeInMinutes;                                // 0x0970   (0x0004)  
	float                                              _destroyCorpseTimerInterval;                                // 0x0974   (0x0004)  
	float                                              _minDistanceToPlayerPawnOrSpectatorToDestroyCorpse;         // 0x0978   (0x0004)  
	unsigned char                                      UnknownData14_6[0x14];                                      // 0x097C   (0x0014)  MISSED


	/// Functions
	// Function /Script/ConZ.Animal2.UnpackUint8
	void UnpackUint8(char pack, TArray<bool>& B);                                                                            // [0x224f730] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Animal2.PackBoolsIntoUint8
	char PackBoolsIntoUint8(TArray<bool>& B);                                                                                // [0x224f580] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.Animal2.OnRep_WoundDamage
	void OnRep_WoundDamage();                                                                                                // [0xb92f40] Final|Native|Public  
	// Function /Script/ConZ.Animal2.OnRep_Health
	void OnRep_Health();                                                                                                     // [0x224f460] Native|Protected     
	// Function /Script/ConZ.Animal2.NetMulticast_PlaySoundOnClients
	void NetMulticast_PlaySoundOnClients(EAnimal2Sound SoundToPlay);                                                         // [0x224ef80] Final|Net|NetReliableNative|Event|NetMulticast|Private 
	// Function /Script/ConZ.Animal2.GenerateBloodMarkerRPC
	void GenerateBloodMarkerRPC();                                                                                           // [0x224ee90] Net|NetReliableNative|Event|NetMulticast|Protected 
	// Function /Script/ConZ.Animal2.ClosestPrisoner
	APrisoner* ClosestPrisoner();                                                                                            // [0x224ee60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/ConZ.ConZCharacterMovementComponent
/// Size: 0x0120 (0x000AF0 - 0x000C10)
class UConZCharacterMovementComponent : public UCharacterMovementComponent
{ 
public:
	TEnumAsByte<ECollisionResponse>                    _navWalkingCollisionResponseToWorldStatic;                  // 0x0AF0   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    _navWalkingCollisionResponseToWorldDynamic;                 // 0x0AF1   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0AF2   (0x0002)  MISSED
	float                                              _maxClimbHeight;                                            // 0x0AF4   (0x0004)  
	bool                                               _queryWaterSplinesEveryFrame;                               // 0x0AF8   (0x0001)  
	unsigned char                                      UnknownData01_5[0xF7];                                      // 0x0AF9   (0x00F7)  MISSED
	float                                              _angularVelocityFilteringInterpolationSpeed;                // 0x0BF0   (0x0004)  
	unsigned char                                      UnknownData02_6[0x1C];                                      // 0x0BF4   (0x001C)  MISSED
};

/// Class /Script/ConZ.Animal2MovementComponent
/// Size: 0x0010 (0x000C10 - 0x000C20)
class UAnimal2MovementComponent : public UConZCharacterMovementComponent
{ 
public:
	float                                              GroundSlopeRotationSpeedDegrees;                            // 0x0C08   (0x0004)  
	bool                                               CorrectServerReceivedZ;                                     // 0x0C0C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x13];                                      // 0x0C0D   (0x0013)  MISSED
};

/// Class /Script/ConZ.CharacterSoundComponent
/// Size: 0x0028 (0x0000B0 - 0x0000D8)
class UCharacterSoundComponent : public UActorComponent
{ 
public:
	FName                                              AttachedSoundsAttachPointName;                              // 0x00B0   (0x0008)  
	UCharacterImpactSoundsData*                        ImpactSounds;                                               // 0x00B8   (0x0008)  
	UCharacterPainSoundsData*                          PainSounds;                                                 // 0x00C0   (0x0008)  
	float                                              MinDurationBetweenPainSounds;                               // 0x00C8   (0x0004)  
	float                                              MaxDurationBetweenPainSounds;                               // 0x00CC   (0x0004)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x00D0   (0x0008)  MISSED
};

/// Class /Script/ConZ.Animal2SoundComponent
/// Size: 0x0078 (0x0000D8 - 0x000150)
class UAnimal2SoundComponent : public UCharacterSoundComponent
{ 
public:
	UAkAudioEvent*                                     IdleAudioEvent;                                             // 0x00D8   (0x0008)  
	UAkAudioEvent*                                     AngryAudioEvent;                                            // 0x00E0   (0x0008)  
	UAkAudioEvent*                                     AttackAudioEvent;                                           // 0x00E8   (0x0008)  
	UAkAudioEvent*                                     ScaredAudioEvent;                                           // 0x00F0   (0x0008)  
	UAkAudioEvent*                                     AlertedAudioEvent;                                          // 0x00F8   (0x0008)  
	UAkAudioEvent*                                     TakeDamageAudioEvent;                                       // 0x0100   (0x0008)  
	UAkAudioEvent*                                     KillAudioEvent;                                             // 0x0108   (0x0008)  
	UAkAudioEvent*                                     AnimalFootstep;                                             // 0x0110   (0x0008)  
	float                                              FootstepSoundOverlap;                                       // 0x0118   (0x0004)  
	float                                              FixedFootstepVolume;                                        // 0x011C   (0x0004)  
	float                                              SpeedFootstepVolume;                                        // 0x0120   (0x0004)  
	float                                              MinSilenceTimeout;                                          // 0x0124   (0x0004)  
	float                                              MaxSilenceTimeout;                                          // 0x0128   (0x0004)  
	unsigned char                                      UnknownData00_6[0x24];                                      // 0x012C   (0x0024)  MISSED
};

/// Class /Script/ConZ.Animal2AnimInstance
/// Size: 0x0030 (0x0002C0 - 0x0002F0)
class UAnimal2AnimInstance : public UAnimInstance
{ 
public:
	UCurveFloat*                                       InverseLocomotionBias;                                      // 0x02B8   (0x0008)  
	float                                              MaximumLeaningAngle;                                        // 0x02C0   (0x0004)  
	int32_t                                            IdleStanceIndex;                                            // 0x02C4   (0x0004)  
	EAnimalStance                                      stance;                                                     // 0x02C8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02C9   (0x0003)  MISSED
	FRotator                                           SlopeRootTiltRotation;                                      // 0x02CC   (0x000C)  
	float                                              ABPSpeed;                                                   // 0x02D8   (0x0004)  
	float                                              ABPTurn;                                                    // 0x02DC   (0x0004)  
	float                                              MoveVelocity;                                               // 0x02E0   (0x0004)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x02E4   (0x0008)  MISSED
	bool                                               _isRagdolled;                                               // 0x02EC   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x02ED   (0x0003)  MISSED


	/// Functions
	// Function /Script/ConZ.Animal2AnimInstance.AnimNotify_RFootDownRear
	void AnimNotify_RFootDownRear();                                                                                         // [0x2253580] Native|Event|Public|BlueprintEvent 
	// Function /Script/ConZ.Animal2AnimInstance.AnimNotify_RFootDown
	void AnimNotify_RFootDown();                                                                                             // [0x2253580] Native|Event|Public|BlueprintEvent 
	// Function /Script/ConZ.Animal2AnimInstance.AnimNotify_LFootDownRear
	void AnimNotify_LFootDownRear();                                                                                         // [0x2253580] Native|Event|Public|BlueprintEvent 
	// Function /Script/ConZ.Animal2AnimInstance.AnimNotify_LFootDown
	void AnimNotify_LFootDown();                                                                                             // [0x2253580] Native|Event|Public|BlueprintEvent 
	// Function /Script/ConZ.Animal2AnimInstance.AnimNotify_IntroEnd
	void AnimNotify_IntroEnd();                                                                                              // [0x2253560] Native|Event|Public|BlueprintEvent 
	// Function /Script/ConZ.Animal2AnimInstance.AnimNotify_IdleEnd
	void AnimNotify_IdleEnd();                                                                                               // [0x2253540] Native|Event|Public|BlueprintEvent 
};

/// Class /Script/ConZ.ComplexAnimalAIController
/// Size: 0x01C0 (0x000328 - 0x0004E8)
class AComplexAnimalAIController : public AAIController
{ 
public:
	EAnimalAgressivness                                Agressivness;                                               // 0x0328   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0329   (0x0003)  MISSED
	float                                              SightIntimidateRadius;                                      // 0x032C   (0x0004)  
	float                                              SightAttackRadius;                                          // 0x0330   (0x0004)  
	float                                              FoeChargeVelocity;                                          // 0x0334   (0x0004)  
	bool                                               ShouldForceChargeRotation;                                  // 0x0338   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0339   (0x0003)  MISSED
	float                                              AnimalVelocityThatMakesThisAnimalFlee;                      // 0x033C   (0x0004)  
	float                                              FleeDistance;                                               // 0x0340   (0x0004)  
	float                                              FleeTime;                                                   // 0x0344   (0x0004)  
	float                                              TrotTime;                                                   // 0x0348   (0x0004)  
	float                                              TimeToAttackWhenAggro;                                      // 0x034C   (0x0004)  
	float                                              TimeToQuitObserve;                                          // 0x0350   (0x0004)  
	float                                              MinReactionTime;                                            // 0x0354   (0x0004)  
	float                                              MaxReactionTime;                                            // 0x0358   (0x0004)  
	float                                              MovingUpdateInterval;                                       // 0x035C   (0x0004)  
	float                                              AttackingUpdateInetrval;                                    // 0x0360   (0x0004)  
	float                                              PathSegmentLength_OBSOLETE;                                 // 0x0364   (0x0004)  
	float                                              MinPaceDuration_OBSOLETE;                                   // 0x0368   (0x0004)  
	int32_t                                            MaxNumWalks_OBSOLETE;                                       // 0x036C   (0x0004)  
	int32_t                                            MaxNumTrots_OBSOLETE;                                       // 0x0370   (0x0004)  
	float                                              PathDirectionCounterResetTime_OBOLETE;                      // 0x0374   (0x0004)  
	float                                              MoveSegmentLength;                                          // 0x0378   (0x0004)  
	float                                              BackOffDistance;                                            // 0x037C   (0x0004)  
	float                                              AttackTrackingDistance;                                     // 0x0380   (0x0004)  
	float                                              PredictionFactor;                                           // 0x0384   (0x0004)  
	bool                                               BackAndForthStuckCheck;                                     // 0x0388   (0x0001)  
	char                                               AttackAttempts;                                             // 0x0389   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x038A   (0x0002)  MISSED
	float                                              ActionChangedDelay;                                         // 0x038C   (0x0004)  
	float                                              CloseAttackRepeatDelay;                                     // 0x0390   (0x0004)  
	float                                              AttackChainDelay;                                           // 0x0394   (0x0004)  
	int32_t                                            BlockedPathRetryAttempts;                                   // 0x0398   (0x0004)  
	float                                              DirectionLockTime;                                          // 0x039C   (0x0004)  
	float                                              MinWalkTimeDuringRoaming;                                   // 0x03A0   (0x0004)  
	float                                              MaxWalkTimeDuringRoaming;                                   // 0x03A4   (0x0004)  
	float                                              MinStandTimeDuringRoaming;                                  // 0x03A8   (0x0004)  
	float                                              MaxStandTimeDuringRoaming;                                  // 0x03AC   (0x0004)  
	float                                              IntimidateTime;                                             // 0x03B0   (0x0004)  
	float                                              IntimidateAnimationEndTime;                                 // 0x03B4   (0x0004)  
	float                                              AlertActionTime;                                            // 0x03B8   (0x0004)  
	float                                              AlertStartupTime;                                           // 0x03BC   (0x0004)  
	float                                              AlertAllowedAgainTime;                                      // 0x03C0   (0x0004)  
	float                                              DoNotDespawnTime;                                           // 0x03C4   (0x0004)  
	UAISenseConfig_Sight*                              NormalAISenseSight;                                         // 0x03C8   (0x0008)  
	UAISenseConfig_Hearing*                            NormalAISenseHearing;                                       // 0x03D0   (0x0008)  
	UAISenseConfig_Hearing*                            RelaxedAISenseHearing;                                      // 0x03D8   (0x0008)  
	UAISenseConfig_Hearing*                            AlertedAISenseHearing;                                      // 0x03E0   (0x0008)  
	UAISenseConfig_Sight*                              SleepAISenseSight;                                          // 0x03E8   (0x0008)  
	AComplexAnimal2*                                   _animal;                                                    // 0x03F0   (0x0008)  
	unsigned char                                      UnknownData03_5[0x78];                                      // 0x03F8   (0x0078)  MISSED
	float                                              _roamRadius;                                                // 0x0470   (0x0004)  
	float                                              _healthPercentageToFlee;                                    // 0x0474   (0x0004)  
	float                                              _damageMagnitudeHealthPercentageToFlee;                     // 0x0478   (0x0004)  
	float                                              _distanceFromFoeToStartIgnoring;                            // 0x047C   (0x0004)  
	unsigned char                                      UnknownData04_6[0x68];                                      // 0x0480   (0x0068)  MISSED


	/// Functions
	// Function /Script/ConZ.ComplexAnimalAIController.UpdatePerception
	void UpdatePerception(TArray<AActor*>& actorsPerceived);                                                                 // [0x22889a0] Final|Native|Private|HasOutParms 
	// Function /Script/ConZ.ComplexAnimalAIController.StartFullAlert
	void StartFullAlert();                                                                                                   // [0x22886e0] Final|Native|Public  
	// Function /Script/ConZ.ComplexAnimalAIController.QuitObserve
	void QuitObserve();                                                                                                      // [0x22884e0] Final|Native|Public  
	// Function /Script/ConZ.ComplexAnimalAIController.OnTakeDamageHandler
	void OnTakeDamageHandler(AActor* damageActor, float Damage, FVector HitLocation, APawn* eventInstigator);                // [0x2288290] Final|Native|Private|HasDefaults 
	// Function /Script/ConZ.ComplexAnimalAIController.OnActionChangedHandler
	void OnActionChangedHandler(EAnimalAction CurrentAction, EAnimalAction PrevAction);                                      // [0x2288180] Native|Protected     
	// Function /Script/ConZ.ComplexAnimalAIController.GetMode
	EAnimalMode GetMode();                                                                                                   // [0x2287e90] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ConZ.ComplexAnimalAIController.ChangeMode
	void ChangeMode(EAnimalMode NewMode);                                                                                    // [0x2287b20] Native|Public|BlueprintCallable 
};

/// Class /Script/ConZ.AnimalContinuousChargeAttackAIController
/// Size: 0x0018 (0x0004E8 - 0x000500)
class AAnimalContinuousChargeAttackAIController : public AComplexAnimalAIController
{ 
public:
	float                                              LockAttackDirectionDistance;                                // 0x04E8   (0x0004)  
	float                                              ContinueAttackDistance;                                     // 0x04EC   (0x0004)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x04F0   (0x0010)  MISSED
};

/// Class /Script/ConZ.BaseItemTag
/// Size: 0x0000 (0x000030 - 0x000030)
class UBaseItemTag : public UDataAsset
{ 
public:
};

/// Class /Script/ConZ.AnimalHandlingItemTag
/// Size: 0x0000 (0x000030 - 0x000030)
class UAnimalHandlingItemTag : public UBaseItemTag
{ 
public:
};

/// Class /Script/ConZ.Skill
/// Size: 0x0080 (0x000030 - 0x0000B0)
class USkill : public UDataAsset
{ 
public:
	FText                                              Caption;                                                    // 0x0030   (0x0018)  
	ESkillReplicationID                                ReplicationID;                                              // 0x0048   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0049   (0x0003)  MISSED
	float                                              ComboBonus;                                                 // 0x004C   (0x0004)  
	float                                              NoSkillBonus;                                               // 0x0050   (0x0004)  
	float                                              BasicBonus;                                                 // 0x0054   (0x0004)  
	float                                              MediumBonus;                                                // 0x0058   (0x0004)  
	float                                              AdvancedBonus;                                              // 0x005C   (0x0004)  
	float                                              DisplayActionMessages;                                      // 0x0060   (0x0004)  
	bool                                               IsAvailableInCharacterCreation;                             // 0x0064   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0065   (0x0003)  MISSED
	UTexture2D*                                        _skillIcon;                                                 // 0x0068   (0x0008)  
	unsigned char                                      UnknownData02_5[0x34];                                      // 0x0070   (0x0034)  MISSED
	float                                              _skillFamePointsMultiplier;                                 // 0x00A4   (0x0004)  
	UClass*                                            _uiDataClass;                                               // 0x00A8   (0x0008)  
};

/// Class /Script/ConZ.IntelligenceSkill
/// Size: 0x0000 (0x0000B0 - 0x0000B0)
class UIntelligenceSkill : public USkill
{ 
public:
};

/// Class /Script/ConZ.AnimalHandlingSkill
/// Size: 0x0010 (0x0000B0 - 0x0000C0)
class UAnimalHandlingSkill : public UIntelligenceSkill
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x00B0   (0x0010)  MISSED
};

/// Class /Script/ConZ.AnimNotify_BoatRow
/// Size: 0x0008 (0x000038 - 0x000040)
class UAnimNotify_BoatRow : public UAnimNotify
{ 
public:
	uint32_t                                           Flags;                                                      // 0x0038   (0x0004)  
	float                                              _rowCycleLength;                                            // 0x003C   (0x0004)  
};

/// Class /Script/ConZ.AnimNotify_CharacterActionEnd
/// Size: 0x0000 (0x000038 - 0x000038)
class UAnimNotify_CharacterActionEnd : public UAnimNotify
{ 
public:
};

/// Class /Script/ConZ.AnimNotify_CharacterActionMarker
/// Size: 0x0000 (0x000038 - 0x000038)
class UAnimNotify_CharacterActionMarker : public UAnimNotify
{ 
public:
};

/// Class /Script/ConZ.AnimNotify_CharacterActionNotify
/// Size: 0x0008 (0x000038 - 0x000040)
class UAnimNotify_CharacterActionNotify : public UAnimNotify
{ 
public:
	ECharacterActionNotifyType                         CharacterActionNotifyType;                                  // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/ConZ.AnimNotify_ClimbingFinished
/// Size: 0x0000 (0x000038 - 0x000038)
class UAnimNotify_ClimbingFinished : public UAnimNotify
{ 
public:
};

/// Class /Script/ConZ.AnimNotify_ConditionalPlayParticleEffectForItem
/// Size: 0x0058 (0x000038 - 0x000090)
class UAnimNotify_ConditionalPlayParticleEffectForItem : public UAnimNotify
{ 
public:
	UParticleSystem*                                   PSTemplate;                                                 // 0x0038   (0x0008)  
	FVector                                            LocationOffset;                                             // 0x0040   (0x000C)  
	FRotator                                           RotationOffset;                                             // 0x004C   (0x000C)  
	FVector                                            Scale;                                                      // 0x0058   (0x000C)  
	unsigned char                                      UnknownData00_5[0x1C];                                      // 0x0064   (0x001C)  MISSED
	bool                                               Attached;                                                   // 0x0080:0 (0x0001)  
	unsigned char                                      UnknownData01_4[0x3];                                       // 0x0081   (0x0003)  MISSED
	FName                                              SocketName;                                                 // 0x0084   (0x0008)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x008C   (0x0004)  MISSED


	/// Functions
	// Function /Script/ConZ.AnimNotify_ConditionalPlayParticleEffectForItem.ShouldPlayParticleEffectForItem
	bool ShouldPlayParticleEffectForItem(AItem* Item);                                                                       // [0x22535a0] Native|Event|Public|BlueprintEvent|Const 
};

/// Class /Script/ConZ.AnimNotify_FishingActionNotify
/// Size: 0x0008 (0x000038 - 0x000040)
class UAnimNotify_FishingActionNotify : public UAnimNotify
{ 
public:
	EFishingActionNotifyType                           FishingActionNotifyType;                                    // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/ConZ.AnimNotify_MagazineUpdateAmmunitionMeshes
/// Size: 0x0018 (0x000038 - 0x000050)
class UAnimNotify_MagazineUpdateAmmunitionMeshes : public UAnimNotify
{ 
public:
	bool                                               showReversed;                                               // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0039   (0x0007)  MISSED
	TArray<int32_t>                                    ammoIndices;                                                // 0x0040   (0x0010)  
};

/// Class /Script/ConZ.AnimNotify_MakeNoise
/// Size: 0x0010 (0x000038 - 0x000048)
class UAnimNotify_MakeNoise : public UAnimNotify
{ 
public:
	ENoiseLevel                                        noiseLevel;                                                 // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0039   (0x0003)  MISSED
	FName                                              NoiseTag;                                                   // 0x003C   (0x0008)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0044   (0x0004)  MISSED
};

/// Class /Script/ConZ.AnimNotify_PlaySoundBySurface
/// Size: 0x0010 (0x000038 - 0x000048)
class UAnimNotify_PlaySoundBySurface : public UAnimNotify
{ 
public:
	UAkAudioEvent*                                     AudioEvent;                                                 // 0x0038   (0x0008)  
	TEnumAsByte<ECollisionChannel>                     TraceChannel;                                               // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0041   (0x0007)  MISSED
};

/// Class /Script/ConZ.AnimNotify_PlaySoundOnOwner
/// Size: 0x0008 (0x000038 - 0x000040)
class UAnimNotify_PlaySoundOnOwner : public UAnimNotify
{ 
public:
	UAkAudioEvent*                                     AudioEvent;                                                 // 0x0038   (0x0008)  
};

/// Class /Script/ConZ.AnimNotify_SmokableItemEquip
/// Size: 0x0000 (0x000038 - 0x000038)
class UAnimNotify_SmokableItemEquip : public UAnimNotify
{ 
public:
};

/// Class /Script/ConZ.AnimNotify_SmokableItemSwitchMeshParent
/// Size: 0x0008 (0x000038 - 0x000040)
class UAnimNotify_SmokableItemSwitchMeshParent : public UAnimNotify
{ 
public:
	EDesiredParent                                     DesiredParentSocket;                                        // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/ConZ.AnimNotify_SmokableItemUnequip
/// Size: 0x0000 (0x000038 - 0x000038)
class UAnimNotify_SmokableItemUnequip : public UAnimNotify
{ 
public:
};

/// Class /Script/ConZ.AnimNotify_SpawnDefecationEffects
/// Size: 0x0000 (0x000038 - 0x000038)
class UAnimNotify_SpawnDefecationEffects : public UAnimNotify
{ 
public:
};

/// Class /Script/ConZ.AnimNotify_SpawnDiarrheaEffects
/// Size: 0x0000 (0x000038 - 0x000038)
class UAnimNotify_SpawnDiarrheaEffects : public UAnimNotify
{ 
public:
};

/// Class /Script/ConZ.AnimNotify_VehicleDoorOpenOrClose
/// Size: 0x0000 (0x000038 - 0x000038)
class UAnimNotify_VehicleDoorOpenOrClose : public UAnimNotify
{ 
public:
};

/// Class /Script/ConZ.AnimNotify_WaterPaddle
/// Size: 0x0028 (0x000038 - 0x000060)
class UAnimNotify_WaterPaddle : public UAnimNotify
{ 
public:
	UParticleSystem*                                   ParticleSystem;                                             // 0x0038   (0x0008)  
	UAkAudioEvent*                                     AudioEvent;                                                 // 0x0040   (0x0008)  
	float                                              VolumeMultiplier;                                           // 0x0048   (0x0004)  
	float                                              PitchMultiplier;                                            // 0x004C   (0x0004)  
	bool                                               IsUnderwater;                                               // 0x0050   (0x0001)  
	bool                                               IsAttached;                                                 // 0x0051   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0052   (0x0002)  MISSED
	FName                                              AttachPointName;                                            // 0x0054   (0x0008)  
	bool                                               DebugMode;                                                  // 0x005C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x005D   (0x0003)  MISSED
};

/// Class /Script/ConZ.AnimNotify_WeaponActionNotify
/// Size: 0x0008 (0x000038 - 0x000040)
class UAnimNotify_WeaponActionNotify : public UAnimNotify
{ 
public:
	EWeaponActionNotifyType                            WeaponActionNotifyType;                                     // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/ConZ.AnimNotify_WeaponChamberBullet
/// Size: 0x0000 (0x000038 - 0x000038)
class UAnimNotify_WeaponChamberBullet : public UAnimNotify
{ 
public:
};

/// Class /Script/ConZ.AnimNotify_WeaponChamberBulletInternal
/// Size: 0x0000 (0x000038 - 0x000038)
class UAnimNotify_WeaponChamberBulletInternal : public UAnimNotify
{ 
public:
};

/// Class /Script/ConZ.AnimNotify_WeaponEjectCasing
/// Size: 0x0010 (0x000038 - 0x000048)
class UAnimNotify_WeaponEjectCasing : public UAnimNotify
{ 
public:
	FName                                              EmitterSocketName;                                          // 0x0038   (0x0008)  
	bool                                               AttachEmitter;                                              // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0041   (0x0007)  MISSED
};

/// Class /Script/ConZ.AnimNotify_WeaponUpdateAmmunitionMeshes
/// Size: 0x0018 (0x000038 - 0x000050)
class UAnimNotify_WeaponUpdateAmmunitionMeshes : public UAnimNotify
{ 
public:
	bool                                               showReversed;                                               // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0039   (0x0007)  MISSED
	TArray<int32_t>                                    ammoIndices;                                                // 0x0040   (0x0010)  
};

/// Class /Script/ConZ.AnimNotifyState_ChamberWeapon
/// Size: 0x0000 (0x000030 - 0x000030)
class UAnimNotifyState_ChamberWeapon : public UAnimNotifyState
{ 
public:
};

/// Class /Script/ConZ.AnimNotifyState_DrainStamina
/// Size: 0x0018 (0x000030 - 0x000048)
class UAnimNotifyState_DrainStamina : public UAnimNotifyState
{ 
public:
	EAnimNotifyStaminDrainType                         DrainType;                                                  // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              AmountToDrain;                                              // 0x0034   (0x0004)  
	float                                              Duration;                                                   // 0x0038   (0x0004)  
	float                                              RecoveryDelay;                                              // 0x003C   (0x0004)  
	float                                              RatioToRecover;                                             // 0x0040   (0x0004)  
	float                                              RecoveryTime;                                               // 0x0044   (0x0004)  
};

/// Class /Script/ConZ.AnimNotifyState_Fade
/// Size: 0x0020 (0x000030 - 0x000050)
class UAnimNotifyState_Fade : public UAnimNotifyState
{ 
public:
	float                                              _fadeOutRatio;                                              // 0x0030   (0x0004)  
	float                                              _fadeInRatio;                                               // 0x0034   (0x0004)  
	AnimNotifyState_FadeForAction                      _forAction;                                                 // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x17];                                      // 0x0039   (0x0017)  MISSED
};

/// Class /Script/ConZ.AnimNotifyState_IgnoreUsingHandCorrections
/// Size: 0x0008 (0x000030 - 0x000038)
class UAnimNotifyState_IgnoreUsingHandCorrections : public UAnimNotifyState
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0030   (0x0008)  MISSED
};

/// Class /Script/ConZ.AnimNotifyState_Melee
/// Size: 0x0040 (0x000030 - 0x000070)
class UAnimNotifyState_Melee : public UAnimNotifyState
{ 
public:
	FGameplayTag                                       _attackCapsuleAttachment;                                   // 0x0030   (0x0008)  
	float                                              _damageMultiplier;                                          // 0x0038   (0x0004)  
	EHitSeverity                                       _hitSeverity;                                               // 0x003C   (0x0001)  
	bool                                               _stopOnHit;                                                 // 0x003D   (0x0001)  
	bool                                               _ignoreLandscape;                                           // 0x003E   (0x0001)  
	EAttackType                                        _attackType;                                                // 0x003F   (0x0001)  
	FName                                              _hitDetectionMarkersRootBoneParentName;                     // 0x0040   (0x0008)  
	TArray<FMeleeHitDetectionMarker>                   _hitDetectionMarkers;                                       // 0x0048   (0x0010)  
	int32_t                                            _hitDetectionSamplingRate;                                  // 0x0058   (0x0004)  
	unsigned char                                      UnknownData00_6[0x14];                                      // 0x005C   (0x0014)  MISSED
};

/// Class /Script/ConZ.AnimNotifyState_NoScopingAllowed
/// Size: 0x0008 (0x000030 - 0x000038)
class UAnimNotifyState_NoScopingAllowed : public UAnimNotifyState
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0030   (0x0008)  MISSED
};

/// Class /Script/ConZ.AnimNotifyState_PaniniOverride
/// Size: 0x0000 (0x000030 - 0x000030)
class UAnimNotifyState_PaniniOverride : public UAnimNotifyState
{ 
public:
};

/// Class /Script/ConZ.AnimNotifyState_PhysicalAnimation
/// Size: 0x0030 (0x000030 - 0x000060)
class UAnimNotifyState_PhysicalAnimation : public UAnimNotifyState
{ 
public:
	bool                                               GotoRagdollOnEnd;                                           // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	FName                                              BodyProfileName;                                            // 0x0034   (0x0008)  
	FName                                              ConstraintProfileName;                                      // 0x003C   (0x0008)  
	FName                                              BoneName;                                                   // 0x0044   (0x0008)  
	FName                                              StrengthBlendCurveName;                                     // 0x004C   (0x0008)  
	FName                                              PhysicsBlendCurveName;                                      // 0x0054   (0x0008)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x005C   (0x0004)  MISSED
};

/// Class /Script/ConZ.AnimNotifyState_PlaySoundOnOwnerRanged
/// Size: 0x0010 (0x000030 - 0x000040)
class UAnimNotifyState_PlaySoundOnOwnerRanged : public UAnimNotifyState
{ 
public:
	UAkAudioEvent*                                     BeginAudioEvent;                                            // 0x0030   (0x0008)  
	UAkAudioEvent*                                     EndAudioEvent;                                              // 0x0038   (0x0008)  
};

/// Class /Script/ConZ.AnimNotifyState_ShowAmmunitionMeshes
/// Size: 0x0030 (0x000030 - 0x000060)
class UAnimNotifyState_ShowAmmunitionMeshes : public UAnimNotifyState
{ 
public:
	bool                                               GenerateCustomMeshComponents;                               // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0031   (0x0007)  MISSED
	TArray<FName>                                      CustomMeshComponentsBoneNames;                              // 0x0038   (0x0010)  
	bool                                               showReversed;                                               // 0x0048   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0049   (0x0007)  MISSED
	TArray<int32_t>                                    ammoIndices;                                                // 0x0050   (0x0010)  
};

/// Class /Script/ConZ.AnimNotifyState_WeaponHideMagazine
/// Size: 0x0010 (0x000030 - 0x000040)
class UAnimNotifyState_WeaponHideMagazine : public UAnimNotifyState
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0030   (0x0010)  MISSED
};

/// Class /Script/ConZ.AnimNotifyState_WeaponRevolverDrumRotationDirection
/// Size: 0x0008 (0x000030 - 0x000038)
class UAnimNotifyState_WeaponRevolverDrumRotationDirection : public UAnimNotifyState
{ 
public:
	ERotationDirection                                 RotationDirection;                                          // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Class /Script/ConZ.AnimNotifyState_WeaponRevolverIgnoreDrumRotation
/// Size: 0x0000 (0x000030 - 0x000030)
class UAnimNotifyState_WeaponRevolverIgnoreDrumRotation : public UAnimNotifyState
{ 
public:
};

/// Class /Script/ConZ.AnimNotifyState_WeaponShowAmmunitionMeshes
/// Size: 0x0018 (0x000030 - 0x000048)
class UAnimNotifyState_WeaponShowAmmunitionMeshes : public UAnimNotifyState
{ 
public:
	bool                                               showReversed;                                               // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0031   (0x0007)  MISSED
	TArray<int32_t>                                    ammoIndices;                                                // 0x0038   (0x0010)  
};

/// Class /Script/ConZ.AnimStatics
/// Size: 0x0000 (0x000028 - 0x000028)
class UAnimStatics : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/ConZ.AquaticLifeSpawningVolume
/// Size: 0x0050 (0x000258 - 0x0002A8)
class AAquaticLifeSpawningVolume : public AVolume
{ 
public:
	EWaterZoneType                                     _waterZoneType;                                             // 0x0258   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0259   (0x0007)  MISSED
	UFishSpeciesPreset*                                _fishSpeciesPreset;                                         // 0x0260   (0x0008)  
	UFishSpawningPreset*                               _fishSpawningPreset;                                        // 0x0268   (0x0008)  
	float                                              _requiredDepthForSpawning;                                  // 0x0270   (0x0004)  
	float                                              _fishSchoolManagerSpawningExtent;                           // 0x0274   (0x0004)  
	int32_t                                            _maxSchoolsPerFishSchoolManager;                            // 0x0278   (0x0004)  
	float                                              _fishingZoneIndicatorMinSpawnTime;                          // 0x027C   (0x0004)  
	float                                              _fishingZoneIndicatorMaxSpawnTime;                          // 0x0280   (0x0004)  
	float                                              _fishingZoneIndicatorMinLifetime;                           // 0x0284   (0x0004)  
	float                                              _fishingZoneIndicatorMaxLifetime;                           // 0x0288   (0x0004)  
	int32_t                                            _maxFishingZoneIndicatorPerPlayer;                          // 0x028C   (0x0004)  
	float                                              _fishingZoneIndicatorMinSpawningExtent;                     // 0x0290   (0x0004)  
	float                                              _fishingZoneIndicatorMaxSpawningExtent;                     // 0x0294   (0x0004)  
	float                                              _fishingZoneIndicatorMinRadius;                             // 0x0298   (0x0004)  
	float                                              _fishingZoneIndicatorMaxRadius;                             // 0x029C   (0x0004)  
	float                                              _requiredDepthForFishingIndicator;                          // 0x02A0   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x02A4   (0x0004)  MISSED
};

/// Class /Script/ConZ.StrengthSkill
/// Size: 0x0000 (0x0000B0 - 0x0000B0)
class UStrengthSkill : public USkill
{ 
public:
};

/// Class /Script/ConZ.RangedWeaponsSkill
/// Size: 0x0168 (0x0000B0 - 0x000218)
class URangedWeaponsSkill : public UStrengthSkill
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x00B0   (0x0010)  MISSED
	FRangedWeaponSkillExperienceAwards                 NoSkillExperienceAwards;                                    // 0x00C0   (0x0040)  
	FRangedWeaponSkillExperienceAwards                 BasicSkillExperienceAwards;                                 // 0x0100   (0x0040)  
	FRangedWeaponSkillExperienceAwards                 MediumSkillExperienceAwards;                                // 0x0140   (0x0040)  
	FRangedWeaponSkillExperienceAwards                 AdvancedSkillExperienceAwards;                              // 0x0180   (0x0040)  
	FRangedWeaponSkillExperienceAwards                 AboveAdvancedSkillExperienceAwards;                         // 0x01C0   (0x0040)  
	FRangedWeaponSkillParametersPerSkillLevel          NoSkillParameters;                                          // 0x0200   (0x0004)  
	FRangedWeaponSkillParametersPerSkillLevel          BasicSkillParameters;                                       // 0x0204   (0x0004)  
	FRangedWeaponSkillParametersPerSkillLevel          MediumSkillParameters;                                      // 0x0208   (0x0004)  
	FRangedWeaponSkillParametersPerSkillLevel          AdvancedSkillParameters;                                    // 0x020C   (0x0004)  
	FRangedWeaponSkillParametersPerSkillLevel          AboveAdvancedSkillParameters;                               // 0x0210   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0214   (0x0004)  MISSED
};

/// Class /Script/ConZ.ArcherySkill
/// Size: 0x0068 (0x000218 - 0x000280)
class UArcherySkill : public URangedWeaponsSkill
{ 
public:
	float                                              _drawWeightNoSkillValue;                                    // 0x0218   (0x0004)  
	float                                              _drawWeightBasicSkillValue;                                 // 0x021C   (0x0004)  
	float                                              _drawWeightMediumSkillValue;                                // 0x0220   (0x0004)  
	float                                              _drawWeightAdvancedSkillValue;                              // 0x0224   (0x0004)  
	float                                              _drawWeightAboveAvancedSkillValue;                          // 0x0228   (0x0004)  
	float                                              _holdTimeInFullDrawNoSkillValue;                            // 0x022C   (0x0004)  
	float                                              _holdTimeInFullDrawBasicSkillValue;                         // 0x0230   (0x0004)  
	float                                              _holdTimeInFullDrawMediumSkillValue;                        // 0x0234   (0x0004)  
	float                                              _holdTimeInFullDrawAdvancedSkillValue;                      // 0x0238   (0x0004)  
	float                                              _holdTimeInFullDrawAboveAvancedSkillValue;                  // 0x023C   (0x0004)  
	float                                              _armsShakeMultiplierNoSkillValue;                           // 0x0240   (0x0004)  
	float                                              _armsShakeMultiplierBasicSkillValue;                        // 0x0244   (0x0004)  
	float                                              _armsShakeMultiplierMediumSkillValue;                       // 0x0248   (0x0004)  
	float                                              _armsShakeMultiplierAdvancedSkillValue;                     // 0x024C   (0x0004)  
	float                                              _armsShakeMultiplierAboveAvancedSkillValue;                 // 0x0250   (0x0004)  
	float                                              _tuneBowDurationNoSkillValue;                               // 0x0254   (0x0004)  
	float                                              _tuneBowDurationBasicSkillValue;                            // 0x0258   (0x0004)  
	float                                              _tuneBowDurationMediumSkillValue;                           // 0x025C   (0x0004)  
	float                                              _tuneBowDurationAdvancedSkillValue;                         // 0x0260   (0x0004)  
	float                                              _tuneBowDurationAboveAvancedSkillValue;                     // 0x0264   (0x0004)  
	float                                              _drawCenterDotExtraTimeLimitNoSkillValue;                   // 0x0268   (0x0004)  
	float                                              _drawCenterDotExtraTimeLimitBasicSkillValue;                // 0x026C   (0x0004)  
	float                                              _drawCenterDotExtraTimeLimitMediumSkillValue;               // 0x0270   (0x0004)  
	float                                              _drawCenterDotExtraTimeLimitAdvancedSkillValue;             // 0x0274   (0x0004)  
	float                                              _drawCenterDotExtraTimeLimitAboveAvancedSkillValue;         // 0x0278   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x027C   (0x0004)  MISSED
};

/// Class /Script/ConZ.ArchitecturalCategoriesDatabase
/// Size: 0x0010 (0x000030 - 0x000040)
class UArchitecturalCategoriesDatabase : public UDataAsset
{ 
public:
	TArray<UArchitecturalCategory*>                    ArchitecturalCategories;                                    // 0x0030   (0x0010)  
};

/// Class /Script/ConZ.ArchitecturalCategory
/// Size: 0x0028 (0x000030 - 0x000058)
class UArchitecturalCategory : public UDataAsset
{ 
public:
	FText                                              CategoryName;                                               // 0x0030   (0x0018)  
	TArray<UBaseBuildingBlockCraftableItem*>           BaseBuildingModules;                                        // 0x0048   (0x0010)  
};

/// Class /Script/ConZ.ArrayStatics
/// Size: 0x0000 (0x000028 - 0x000028)
class UArrayStatics : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/ConZ.ReplenishableResourceBaseComponent
/// Size: 0x0090 (0x000590 - 0x000620)
class UReplenishableResourceBaseComponent : public UInstancedStaticMeshComponent
{ 
public:
	FReplenishableResourceDescription                  _replenishableResourceDescription;                          // 0x0590   (0x0088)  
	FName                                              _replenishableResourceAmountMaterialParameterName;          // 0x0618   (0x0008)  
};

/// Class /Script/ConZ.ATMReplenishableResourceComponent
/// Size: 0x0000 (0x000620 - 0x000620)
class UATMReplenishableResourceComponent : public UReplenishableResourceBaseComponent
{ 
public:
};

/// Class /Script/ConZ.ItemComponent
/// Size: 0x0018 (0x0000B0 - 0x0000C8)
class UItemComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x00B0   (0x0018)  MISSED
};

/// Class /Script/ConZ.AttachableItemComponent
/// Size: 0x0098 (0x0000C8 - 0x000160)
class UAttachableItemComponent : public UItemComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x00C8   (0x0018)  MISSED
	FTransform                                         _attachRelativeTransform;                                   // 0x00E0   (0x0030)  
	float                                              _damage;                                                    // 0x0110   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0114   (0x0004)  MISSED
	FText                                              _interactionText;                                           // 0x0118   (0x0018)  
	unsigned char                                      UnknownData02_6[0x30];                                      // 0x0130   (0x0030)  MISSED


	/// Functions
	// Function /Script/ConZ.AttachableItemComponent.OnBaseElementDestroyed
	void OnBaseElementDestroyed(FDbIntegerId BaseElementId);                                                                 // [0x2256e10] Final|Native|Private 
	// Function /Script/ConZ.AttachableItemComponent.NetMulticast_OnBaseElementDestroyed
	void NetMulticast_OnBaseElementDestroyed();                                                                              // [0x2256df0] Final|Net|Native|Event|NetMulticast|Private 
};

/// Class /Script/ConZ.AttachmentSocketMountType
/// Size: 0x0000 (0x000028 - 0x000028)
class UAttachmentSocketMountType : public UObject
{ 
public:
};

/// Class /Script/ConZ.AttachmentSocketMountTypePrisonerHand
/// Size: 0x0000 (0x000028 - 0x000028)
class UAttachmentSocketMountTypePrisonerHand : public UAttachmentSocketMountType
{ 
public:
};

/// Class /Script/ConZ.AudibleButtonComponent
/// Size: 0x0050 (0x000028 - 0x000078)
class UAudibleButtonComponent : public UObject
{ 
public:
	TMap<EButtonEventType, UAkAudioEvent*>             _audioEvents;                                               // 0x0028   (0x0050)  
};

/// Class /Script/ConZ.AudioDeviceDisplay
/// Size: 0x0008 (0x000260 - 0x000268)
class UAudioDeviceDisplay : public UUserWidget
{ 
public:
	UTextBlock*                                        _deviceName;                                                // 0x0260   (0x0008)  
};

/// Class /Script/ConZ.AudioSettingsManager
/// Size: 0x0000 (0x000028 - 0x000028)
class UAudioSettingsManager : public UObject
{ 
public:
};

/// Class /Script/ConZ.AudioStatics
/// Size: 0x0000 (0x000028 - 0x000028)
class UAudioStatics : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/ConZ.ItemAnimInstance
/// Size: 0x0010 (0x0002C0 - 0x0002D0)
class UItemAnimInstance : public UAnimInstance
{ 
public:
	EPrisonerStance                                    _owningPrisonerStance;                                      // 0x02C0   (0x0001)  
	bool                                               _isOwningPrisonerInFirstPersonView;                         // 0x02C1   (0x0001)  
	unsigned char                                      UnknownData00_6[0xE];                                       // 0x02C2   (0x000E)  MISSED
};

/// Class /Script/ConZ.WeaponAttachmentMagazineAnimInstance
/// Size: 0x0010 (0x0002D0 - 0x0002E0)
class UWeaponAttachmentMagazineAnimInstance : public UItemAnimInstance
{ 
public:
	int32_t                                            _ammoCount;                                                 // 0x02D0   (0x0004)  
	bool                                               _hasAmmo;                                                   // 0x02D4   (0x0001)  
	bool                                               _isAttachedToWeapon;                                        // 0x02D5   (0x0001)  
	EMagazineAmmoCountType                             _ammoCountType;                                             // 0x02D6   (0x0001)  
	bool                                               ShouldPlayIdleEmpty;                                        // 0x02D7   (0x0001)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x02D8   (0x0008)  MISSED
};

/// Class /Script/ConZ.AutoCrossbowMagazineAnimInstance
/// Size: 0x0010 (0x0002E0 - 0x0002F0)
class UAutoCrossbowMagazineAnimInstance : public UWeaponAttachmentMagazineAnimInstance
{ 
public:
	float                                              _followerBoneLocationOffset;                                // 0x02E0   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x02E4   (0x000C)  MISSED
};

/// Class /Script/ConZ.AvailabilityGrid
/// Size: 0x225530 (0x000028 - 0x225558)
class UAvailabilityGrid : public UObject
{ 
public:
	FGameplayTag                                       _waterImageAssetTag;                                        // 0x0028   (0x0008)  
	unsigned char                                      UnknownData00_6[0x225528];                                  // 0x0030   (0x225528)  MISSED
};

/// Class /Script/ConZ.DexteritySkill
/// Size: 0x0000 (0x0000B0 - 0x0000B0)
class UDexteritySkill : public USkill
{ 
public:
};

/// Class /Script/ConZ.VehicleHandlingSkill
/// Size: 0x0000 (0x0000B0 - 0x0000B0)
class UVehicleHandlingSkill : public UDexteritySkill
{ 
public:
};

/// Class /Script/ConZ.AviationSkill
/// Size: 0x0528 (0x0000B0 - 0x0005D8)
class UAviationSkill : public UVehicleHandlingSkill
{ 
public:
	FVehicleHandlingExperienceAwards                   NoSkillExperienceAwards;                                    // 0x00B0   (0x0008)  
	FVehicleHandlingExperienceAwards                   BasicSkillExperienceAwards;                                 // 0x00B8   (0x0008)  
	FVehicleHandlingExperienceAwards                   MediumSkillExperienceAwards;                                // 0x00C0   (0x0008)  
	FVehicleHandlingExperienceAwards                   AdvancedSkillExperienceAwards;                              // 0x00C8   (0x0008)  
	FVehicleHandlingExperienceAwards                   AboveAdvancedSkillExperienceAwards;                         // 0x00D0   (0x0008)  
	FAviationSkillParametersPerSkillLevel              NoSkillParameters;                                          // 0x00D8   (0x0100)  
	FAviationSkillParametersPerSkillLevel              BasicSkillParameters;                                       // 0x01D8   (0x0100)  
	FAviationSkillParametersPerSkillLevel              MediumSkillParameters;                                      // 0x02D8   (0x0100)  
	FAviationSkillParametersPerSkillLevel              AdvancedSkillParameters;                                    // 0x03D8   (0x0100)  
	FAviationSkillParametersPerSkillLevel              AboveAdvancedSkillParameters;                               // 0x04D8   (0x0100)  
};

/// Class /Script/ConZ.AwarenessSkill
/// Size: 0x0320 (0x0000B0 - 0x0003D0)
class UAwarenessSkill : public UIntelligenceSkill
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x00B0   (0x0010)  MISSED
	UAkAudioEvent*                                     EnterFocusModeAudioEvent;                                   // 0x00C0   (0x0008)  
	UAkAudioEvent*                                     LeaveFocusModeAudioEvent;                                   // 0x00C8   (0x0008)  
	float                                              _updateTime;                                                // 0x00D0   (0x0004)  
	float                                              _serverUpdateTime;                                          // 0x00D4   (0x0004)  
	float                                              _staminaConsumption;                                        // 0x00D8   (0x0004)  
	FAwarenessSkillExperienceAwards                    NoSkillExperienceAwards;                                    // 0x00DC   (0x000C)  
	FAwarenessSkillExperienceAwards                    BasicSkillExperienceAwards;                                 // 0x00E8   (0x000C)  
	FAwarenessSkillExperienceAwards                    MediumSkillExperienceAwards;                                // 0x00F4   (0x000C)  
	FAwarenessSkillExperienceAwards                    AdvancedSkillExperienceAwards;                              // 0x0100   (0x000C)  
	FAwarenessSkillExperienceAwards                    AboveAdvancedSkillExperienceAwards;                         // 0x010C   (0x000C)  
	FAwarenessSkillParametersPerSkillLevel             NoSkillParameters;                                          // 0x0118   (0x0058)  
	FAwarenessSkillParametersPerSkillLevel             BasicSkillParameters;                                       // 0x0170   (0x0058)  
	FAwarenessSkillParametersPerSkillLevel             MediumSkillParameters;                                      // 0x01C8   (0x0058)  
	FAwarenessSkillParametersPerSkillLevel             AdvancedSkillParameters;                                    // 0x0220   (0x0058)  
	FAwarenessSkillParametersPerSkillLevel             AboveAdvancedSkillParameters;                               // 0x0278   (0x0058)  
	unsigned char                                      UnknownData01_6[0x100];                                     // 0x02D0   (0x0100)  MISSED


	/// Functions
	// Function /Script/ConZ.AwarenessSkill.EnterFocusMode
	void EnterFocusMode();                                                                                                   // [0x22566c0] Final|Native|Public  
};

/// Class /Script/ConZ.BadAdjustableSeparator
/// Size: 0x0010 (0x000260 - 0x000270)
class UBadAdjustableSeparator : public UUserWidget
{ 
public:
	USizeBox*                                          UpperSizeBox;                                               // 0x0260   (0x0008)  
	float                                              HeightOverride;                                             // 0x0268   (0x0004)  
	bool                                               TradingRelated;                                             // 0x026C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x026D   (0x0003)  MISSED
};

/// Class /Script/ConZ.BankAccountRegistry
/// Size: 0x00C8 (0x0000B0 - 0x000178)
class UBankAccountRegistry : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0xC8];                                      // 0x00B0   (0x00C8)  MISSED
};

/// Class /Script/ConZ.PlayerRpcChannelServerRequest
/// Size: 0x0000 (0x000028 - 0x000028)
class UPlayerRpcChannelServerRequest : public UObject
{ 
public:
};

/// Class /Script/ConZ.BankAccountRegistryRequest
/// Size: 0x0020 (0x000028 - 0x000048)
class UBankAccountRegistryRequest : public UPlayerRpcChannelServerRequest
{ 
public:
	unsigned char                                      UnknownData00_1[0x20];                                      // 0x0028   (0x0020)  MISSED
};

/// Class /Script/ConZ.PlayerRpcChannelServerResponse
/// Size: 0x0000 (0x000028 - 0x000028)
class UPlayerRpcChannelServerResponse : public UObject
{ 
public:
};

/// Class /Script/ConZ.BankAccountRegistryResponse
/// Size: 0x0008 (0x000028 - 0x000030)
class UBankAccountRegistryResponse : public UPlayerRpcChannelServerResponse
{ 
public:
	UBankAccountRegistryResponseDataObject*            _payload;                                                   // 0x0028   (0x0008)  
};

/// Class /Script/ConZ.BankAccountRegistryResponseDataObject
/// Size: 0x0078 (0x000028 - 0x0000A0)
class UBankAccountRegistryResponseDataObject : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x78];                                      // 0x0028   (0x0078)  MISSED
};

/// Class /Script/ConZ.BankAccountRegistryStatics
/// Size: 0x0000 (0x000028 - 0x000028)
class UBankAccountRegistryStatics : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/ConZ.BankATMAccountInfo
/// Size: 0x00A0 (0x000260 - 0x000300)
class UBankATMAccountInfo : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0260   (0x0018)  MISSED
	UTextBlock*                                        _accountNumber;                                             // 0x0278   (0x0008)  
	UTextBlock*                                        _accountName;                                               // 0x0280   (0x0008)  
	UTextBlock*                                        _cardType;                                                  // 0x0288   (0x0008)  
	UTextBlock*                                        _renewalAmount;                                             // 0x0290   (0x0008)  
	UHorizontalBox*                                    _goldAmountHorizontalBox;                                   // 0x0298   (0x0008)  
	UTextBlock*                                        _goldAmount;                                                // 0x02A0   (0x0008)  
	UBankATMPointingButton*                            _btnReturn;                                                 // 0x02A8   (0x0008)  
	TMap<EBankCardType, FSlateColor>                   _cardTypeFontColor;                                         // 0x02B0   (0x0050)  
};

/// Class /Script/ConZ.BankATMAccountSummary
/// Size: 0x0028 (0x000260 - 0x000288)
class UBankATMAccountSummary : public UUserWidget
{ 
public:
	UTextBlock*                                        _accountBalance;                                            // 0x0260   (0x0008)  
	UHorizontalBox*                                    _ATMOperationalTransactionLimitHorizontalBox;               // 0x0268   (0x0008)  
	UTextBlock*                                        _ATMOperationalTransactionLimit;                            // 0x0270   (0x0008)  
	UHorizontalBox*                                    _cardOperationalTransactionLimitHorizontalBox;              // 0x0278   (0x0008)  
	UTextBlock*                                        _cardOperationalTransactionLimit;                           // 0x0280   (0x0008)  
};

/// Class /Script/ConZ.BankATMBoughtCard
/// Size: 0x0160 (0x000260 - 0x0003C0)
class UBankATMBoughtCard : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0260   (0x0018)  MISSED
	EBankATMCardUIType                                 _cardQualityType;                                           // 0x0278   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0279   (0x0007)  MISSED
	TMap<EBankATMCardUIType, FSlateBrush>              _cardBrushes;                                               // 0x0280   (0x0050)  
	FBankATMBoughtCardStateVisual                      _normalVisuals;                                             // 0x02D0   (0x0040)  
	FBankATMBoughtCardStateVisual                      _hoveredVisuals;                                            // 0x0310   (0x0040)  
	FBankATMBoughtCardStateVisual                      _pressedVisuals;                                            // 0x0350   (0x0040)  
	UOverlay*                                          _visualOverlay;                                             // 0x0390   (0x0008)  
	UImage*                                            _imgCardBackground;                                         // 0x0398   (0x0008)  
	UTextBlock*                                        _textCardType;                                              // 0x03A0   (0x0008)  
	UTextBlock*                                        _textCardNumber;                                            // 0x03A8   (0x0008)  
	UWidgetSwitcher*                                   _optionsCircleSwitcher;                                     // 0x03B0   (0x0008)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x03B8   (0x0008)  MISSED
};

/// Class /Script/ConZ.BankATMBuyableCard
/// Size: 0x0088 (0x000260 - 0x0002E8)
class UBankATMBuyableCard : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0260   (0x0018)  MISSED
	EBankATMCardUIType                                 _cardQualityType;                                           // 0x0278   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0279   (0x0003)  MISSED
	FBankATMBuyableCardStateVisual                     _normalVisuals;                                             // 0x027C   (0x000C)  
	FBankATMBuyableCardStateVisual                     _hoveredAndPressedVisuals;                                  // 0x0288   (0x000C)  
	FBankATMBuyableCardStateVisual                     _disabledVisuals;                                           // 0x0294   (0x000C)  
	UWidgetSwitcher*                                   _visualStateSwitcher;                                       // 0x02A0   (0x0008)  
	UImage*                                            _toggleablePlusCircle;                                      // 0x02A8   (0x0008)  
	UTextBlock*                                        _textCardType;                                              // 0x02B0   (0x0008)  
	UTextBlock*                                        _textFreeRenewals;                                          // 0x02B8   (0x0008)  
	UTextBlock*                                        _textDigitsOfPin;                                           // 0x02C0   (0x0008)  
	UTextBlock*                                        _textOperationalTransactionLimit;                           // 0x02C8   (0x0008)  
	UTextBlock*                                        _textGoldPurchaseAvailable;                                 // 0x02D0   (0x0008)  
	UTextBlock*                                        _textCardCost;                                              // 0x02D8   (0x0008)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x02E0   (0x0008)  MISSED
};

/// Class /Script/ConZ.BankATMCardManagementOptionsScreen
/// Size: 0x0070 (0x000260 - 0x0002D0)
class UBankATMCardManagementOptionsScreen : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x50];                                      // 0x0260   (0x0050)  MISSED
	UBankATMPointingButton*                            _btnRenew;                                                  // 0x02B0   (0x0008)  
	UBankATMPointingButton*                            _btnDelete;                                                 // 0x02B8   (0x0008)  
	UBankATMPointingButton*                            _btnReturn;                                                 // 0x02C0   (0x0008)  
	UBankATMErrorPopup*                                _popupMessage;                                              // 0x02C8   (0x0008)  
};

/// Class /Script/ConZ.BankATMCarouselCard
/// Size: 0x0088 (0x000260 - 0x0002E8)
class UBankATMCarouselCard : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0260   (0x0018)  MISSED
	UWidgetSwitcher*                                   _typeSwitcher;                                              // 0x0278   (0x0008)  
	UTextBlock*                                        _numberLabel;                                               // 0x0280   (0x0008)  
	UImage*                                            _ownershipIcon;                                             // 0x0288   (0x0008)  
	UPanelWidget*                                      _expirationNotice;                                          // 0x0290   (0x0008)  
	FColor                                             _stolenCardColor;                                           // 0x0298   (0x0004)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x029C   (0x0008)  MISSED
	FBankATMCarouselCardStateVisual                    _normalVisuals;                                             // 0x02A4   (0x0010)  
	FBankATMCarouselCardStateVisual                    _hoveredVisuals;                                            // 0x02B4   (0x0010)  
	FBankATMCarouselCardStateVisual                    _pressedVisuals;                                            // 0x02C4   (0x0010)  
	FBankATMCarouselCardStateVisual                    _disabledVisuals;                                           // 0x02D4   (0x0010)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x02E4   (0x0004)  MISSED
};

/// Class /Script/ConZ.BankATMChooseTransaction
/// Size: 0x00B0 (0x000260 - 0x000310)
class UBankATMChooseTransaction : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x78];                                      // 0x0260   (0x0078)  MISSED
	UBankATMPointingButton*                            _btnWithdraw;                                               // 0x02D8   (0x0008)  
	UBankATMPointingButton*                            _btnDeposit;                                                // 0x02E0   (0x0008)  
	UBankATMPointingButton*                            _btnTransfer;                                               // 0x02E8   (0x0008)  
	UBankATMPointingButton*                            _btnEjectCard;                                              // 0x02F0   (0x0008)  
	UBankATMPointingButton*                            _btnAccountInfo;                                            // 0x02F8   (0x0008)  
	UBankATMPointingButton*                            _btnBuyGold;                                                // 0x0300   (0x0008)  
	UBankATMPointingButton*                            _btnSellGold;                                               // 0x0308   (0x0008)  
};

/// Class /Script/ConZ.BankATMEnterPin
/// Size: 0x0078 (0x000260 - 0x0002D8)
class UBankATMEnterPin : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x0260   (0x0020)  MISSED
	UWidgetSwitcher*                                   _pinEnteringSwitcher;                                       // 0x0280   (0x0008)  
	UTextBlock*                                        _enterPinTitleMessage;                                      // 0x0288   (0x0008)  
	UPanelWidget*                                      _pinSlotsPanel;                                             // 0x0290   (0x0008)  
	UClass*                                            _pinSlotClass;                                              // 0x0298   (0x0008)  
	UPanelWidget*                                      _incorrectPinWarning;                                       // 0x02A0   (0x0008)  
	UTextBlock*                                        _remainingAttemptsLabel;                                    // 0x02A8   (0x0008)  
	UBankATMPointingButton*                            _btnReturn;                                                 // 0x02B0   (0x0008)  
	UBankATMPointingButton*                            _btnSubmit;                                                 // 0x02B8   (0x0008)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x02C0   (0x0018)  MISSED
};

/// Class /Script/ConZ.BankATMErrorPopup
/// Size: 0x0020 (0x000260 - 0x000280)
class UBankATMErrorPopup : public UUserWidget
{ 
public:
	UTextBlock*                                        _popupMessage;                                              // 0x0260   (0x0008)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0268   (0x0004)  MISSED
	float                                              _fadeInTime;                                                // 0x026C   (0x0004)  
	float                                              _displayHoldTime;                                           // 0x0270   (0x0004)  
	float                                              _fadeOutTime;                                               // 0x0274   (0x0004)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0278   (0x0008)  MISSED
};

/// Class /Script/ConZ.BankATMGoldTrading
/// Size: 0x0118 (0x000260 - 0x000378)
class UBankATMGoldTrading : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x58];                                      // 0x0260   (0x0058)  MISSED
	UConZCustomInteractionButton*                      _btnEjectCard;                                              // 0x02B8   (0x0008)  
	UWidgetSwitcher*                                   _buttonSwitcher;                                            // 0x02C0   (0x0008)  
	UBankATMPointingButton*                            _btnReturn;                                                 // 0x02C8   (0x0008)  
	UBankATMPointingButton*                            _btnSubmit;                                                 // 0x02D0   (0x0008)  
	UBankATMPointingButton*                            _btnNo;                                                     // 0x02D8   (0x0008)  
	UBankATMPointingButton*                            _btnYes;                                                    // 0x02E0   (0x0008)  
	UWidgetSwitcher*                                   _subsectionSwitcher;                                        // 0x02E8   (0x0008)  
	UTextBlock*                                        _goldBuyConversionLabel;                                    // 0x02F0   (0x0008)  
	UBankATMVirtualEditbox*                            _editBuyAmount;                                             // 0x02F8   (0x0008)  
	UTextBlock*                                        _creditsLostLabel;                                          // 0x0300   (0x0008)  
	UTextBlock*                                        _goldSellConversionLabel;                                   // 0x0308   (0x0008)  
	UBankATMVirtualEditbox*                            _editSellAmount;                                            // 0x0310   (0x0008)  
	UTextBlock*                                        _creditsGainedLabel;                                        // 0x0318   (0x0008)  
	UTextBlock*                                        _questionLabel;                                             // 0x0320   (0x0008)  
	UTextBlock*                                        _errorLabel;                                                // 0x0328   (0x0008)  
	UBankATMGoldValueGraph*                            _goldValueGraph;                                            // 0x0330   (0x0008)  
	UTextBlock*                                        _goldBalanceTextBlock;                                      // 0x0338   (0x0008)  
	UTextBlock*                                        _fundsSourceWarning;                                        // 0x0340   (0x0008)  
	UAkAudioEvent*                                     _soundSuccess;                                              // 0x0348   (0x0008)  
	UAkAudioEvent*                                     _errorSuccess;                                              // 0x0350   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x0358   (0x0020)  MISSED


	/// Functions
	// Function /Script/ConZ.BankATMGoldTrading.HandleOnEjectClicked
	void HandleOnEjectClicked();                                                                                             // [0x225c1c0] Final|Native|Private 
};

/// Class /Script/ConZ.BankATMGoldValueGraph
/// Size: 0x0020 (0x000260 - 0x000280)
class UBankATMGoldValueGraph : public UUserWidget
{ 
public:
	UVerticalBox*                                      _yAxisVerticalBox;                                          // 0x0260   (0x0008)  
	UImage*                                            _graphShadedAreaImg;                                        // 0x0268   (0x0008)  
	UHorizontalBox*                                    _xAxisHorizontalBox;                                        // 0x0270   (0x0008)  
	UTextBlock*                                        _graphDescriptionTextBox;                                   // 0x0278   (0x0008)  
};

/// Class /Script/ConZ.BankATMMainPanel
/// Size: 0x0080 (0x000260 - 0x0002E0)
class UBankATMMainPanel : public UUserWidget
{ 
public:
	FDelegateProperty                                  OnMouseMoveEvent;                                           // 0x0260   (0x0010)  
	UWidget*                                           _virtualMouseCursorWidget;                                  // 0x0270   (0x0008)  
	unsigned char                                      UnknownData00_5[0x10];                                      // 0x0278   (0x0010)  MISSED
	UWidgetSwitcher*                                   _panelSwitcher;                                             // 0x0288   (0x0008)  
	UBankATMWelcomeScreen*                             _welcomeScreen;                                             // 0x0290   (0x0008)  
	UBankATMEnterPin*                                  _enterPinScreen;                                            // 0x0298   (0x0008)  
	UBankATMChooseTransaction*                         _chooseTransactionScreen;                                   // 0x02A0   (0x0008)  
	UBankATMMoneyTransfer*                             _moneyTransferScreen;                                       // 0x02A8   (0x0008)  
	UBankATMGoldTrading*                               _goldTradingScreen;                                         // 0x02B0   (0x0008)  
	UBankATMManageCards*                               _manageCardsScreen;                                         // 0x02B8   (0x0008)  
	UBankATMAccountInfo*                               _accountInfoScreen;                                         // 0x02C0   (0x0008)  
	UBankATMAccountSummary*                            _accountSummaryHeader;                                      // 0x02C8   (0x0008)  
	UPanelWidget*                                      _loadingOverlay;                                            // 0x02D0   (0x0008)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x02D8   (0x0008)  MISSED
};

/// Class /Script/ConZ.BankATMManageCards
/// Size: 0x00B0 (0x000260 - 0x000310)
class UBankATMManageCards : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x28];                                      // 0x0260   (0x0028)  MISSED
	UWidgetSwitcher*                                   _screenSwitcher;                                            // 0x0288   (0x0008)  
	UHorizontalBox*                                    _boughtCardsHorizontalBox;                                  // 0x0290   (0x0008)  
	UBankATMBoughtCard*                                _boughtCardStarter;                                         // 0x0298   (0x0008)  
	UBankATMBoughtCard*                                _boughtCardGold;                                            // 0x02A0   (0x0008)  
	UBankATMBoughtCard*                                _boughtCardClassic;                                         // 0x02A8   (0x0008)  
	UTextBlock*                                        _textNoCards;                                               // 0x02B0   (0x0008)  
	UHorizontalBox*                                    _buyableCardsHorizontalBox;                                 // 0x02B8   (0x0008)  
	UBankATMBuyableCard*                               _buyableCardClassic;                                        // 0x02C0   (0x0008)  
	UBankATMBuyableCard*                               _buyableCardGold;                                           // 0x02C8   (0x0008)  
	UTextBlock*                                        _textInventoryBalance;                                      // 0x02D0   (0x0008)  
	UTextBlock*                                        _textAccountBalance;                                        // 0x02D8   (0x0008)  
	UBankATMPointingButton*                            _btnBack;                                                   // 0x02E0   (0x0008)  
	UBankATMCardManagementOptionsScreen*               _cardManagementOptionsScreen;                               // 0x02E8   (0x0008)  
	UBankATMYesNoConfirmationScreen*                   _purchaseConfirmationScreen;                                // 0x02F0   (0x0008)  
	UBankATMYesNoConfirmationScreen*                   _cancellationConfirmationScreen;                            // 0x02F8   (0x0008)  
	UBankATMYesNoConfirmationScreen*                   _renewalConfirmationScreen;                                 // 0x0300   (0x0008)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0308   (0x0008)  MISSED
};

/// Class /Script/ConZ.Minigame
/// Size: 0x00D8 (0x000220 - 0x0002F8)
class AMinigame : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x30];                                      // 0x0220   (0x0030)  MISSED
	int32_t                                            _testingMode;                                               // 0x0250   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0254   (0x0004)  MISSED
	USceneComponent*                                   _rootComponent;                                             // 0x0258   (0x0008)  
	USceneCaptureComponent2D*                          _captureCam;                                                // 0x0260   (0x0008)  
	USceneCaptureComponent2D*                          _captureMaskCam;                                            // 0x0268   (0x0008)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x0270   (0x0008)  MISSED
	UMinigameWidget*                                   _minigameWidget;                                            // 0x0278   (0x0008)  
	UClass*                                            _minigameWidgetClass;                                       // 0x0280   (0x0008)  
	unsigned char                                      UnknownData03_5[0x28];                                      // 0x0288   (0x0028)  MISSED
	float                                              _introDuration;                                             // 0x02B0   (0x0004)  
	float                                              _outroDurationOnFail;                                       // 0x02B4   (0x0004)  
	float                                              _outroDurationOnSuccess;                                    // 0x02B8   (0x0004)  
	bool                                               _canBeCanceled;                                             // 0x02BC   (0x0001)  
	EPrisonerMontage                                   _simulatedMontage;                                          // 0x02BD   (0x0001)  
	unsigned char                                      UnknownData04_5[0x2];                                       // 0x02BE   (0x0002)  MISSED
	UAkAudioEvent*                                     _simulatedAudioStart;                                       // 0x02C0   (0x0008)  
	UAkAudioEvent*                                     _simulatedAudioStop;                                        // 0x02C8   (0x0008)  
	TArray<UClass*>                                    _takeInHandsItemTagClasses;                                 // 0x02D0   (0x0010)  
	unsigned char                                      UnknownData05_5[0x8];                                       // 0x02E0   (0x0008)  MISSED
	TArray<TWeakObjectPtr>                             _currentlyUsedTools;                                        // 0x02E8   (0x0010)  
};

/// Class /Script/ConZ.BankATMMinigame
/// Size: 0x0060 (0x0002F8 - 0x000358)
class ABankATMMinigame : public AMinigame
{ 
public:
	UBankATMUIController*                              _uiController;                                              // 0x02F8   (0x0008)  
	UStaticMeshComponent*                              _bankATMMesh;                                               // 0x0300   (0x0008)  
	UWidgetComponent*                                  _bankATMWidget;                                             // 0x0308   (0x0008)  
	FVector                                            _zoomStartLocation;                                         // 0x0310   (0x000C)  
	FVector                                            _zoomEndLocation;                                           // 0x031C   (0x000C)  
	UCurveFloat*                                       _zoomCurve;                                                 // 0x0328   (0x0008)  
	float                                              _virtualMouseMinSensitivityModifier;                        // 0x0330   (0x0004)  
	float                                              _virtualMouseMaxSensitivityModifier;                        // 0x0334   (0x0004)  
	unsigned char                                      UnknownData00_5[0x10];                                      // 0x0338   (0x0010)  MISSED
	UStaticMesh*                                       _atmMesh;                                                   // 0x0348   (0x0008)  
	UStaticMesh*                                       _tabletMesh;                                                // 0x0350   (0x0008)  
};

/// Class /Script/ConZ.MinigameConfiguration
/// Size: 0x0020 (0x000028 - 0x000048)
class UMinigameConfiguration : public UObject
{ 
public:
	UClass*                                            minigameClass;                                              // 0x0028   (0x0008)  
	unsigned char                                      UnknownData00_6[0x18];                                      // 0x0030   (0x0018)  MISSED
};

/// Class /Script/ConZ.BankATMMinigameConfiguration
/// Size: 0x0018 (0x000048 - 0x000060)
class UBankATMMinigameConfiguration : public UMinigameConfiguration
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0048   (0x0018)  MISSED
};

/// Class /Script/ConZ.BankATMMoneyTransfer
/// Size: 0x0110 (0x000260 - 0x000370)
class UBankATMMoneyTransfer : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x40];                                      // 0x0260   (0x0040)  MISSED
	UButton*                                           _btnEjectCard;                                              // 0x02A0   (0x0008)  
	UWidgetSwitcher*                                   _buttonSwitcher;                                            // 0x02A8   (0x0008)  
	UBankATMPointingButton*                            _btnReturn;                                                 // 0x02B0   (0x0008)  
	UBankATMPointingButton*                            _btnSubmit;                                                 // 0x02B8   (0x0008)  
	UBankATMPointingButton*                            _btnNo;                                                     // 0x02C0   (0x0008)  
	UBankATMPointingButton*                            _btnYes;                                                    // 0x02C8   (0x0008)  
	UWidgetSwitcher*                                   _subsectionSwitcher;                                        // 0x02D0   (0x0008)  
	UBankATMVirtualEditbox*                            _editAccountNumber;                                         // 0x02D8   (0x0008)  
	UBankATMVirtualEditbox*                            _editTransferAmount;                                        // 0x02E0   (0x0008)  
	UBankATMVirtualEditbox*                            _editDepositAmount;                                         // 0x02E8   (0x0008)  
	UBankATMVirtualEditbox*                            _editWithdrawAmount;                                        // 0x02F0   (0x0008)  
	UTextBlock*                                        _questionLabel;                                             // 0x02F8   (0x0008)  
	UTextBlock*                                        _errorLabel;                                                // 0x0300   (0x0008)  
	UTextBlock*                                        _commissionPercentageTextBlock;                             // 0x0308   (0x0008)  
	UTextBlock*                                        _inventoryBalanceTextBlock;                                 // 0x0310   (0x0008)  
	UAkAudioEvent*                                     _soundSuccess;                                              // 0x0318   (0x0008)  
	UAkAudioEvent*                                     _errorSuccess;                                              // 0x0320   (0x0008)  
	unsigned char                                      UnknownData01_6[0x48];                                      // 0x0328   (0x0048)  MISSED


	/// Functions
	// Function /Script/ConZ.BankATMMoneyTransfer.HandleOnEjectCardButtonClicked
	void HandleOnEjectCardButtonClicked();                                                                                   // [0x225c1a0] Final|Native|Private 
};

/// Class /Script/ConZ.BankATMMyCardsButton
/// Size: 0x04C0 (0x000260 - 0x000720)
class UBankATMMyCardsButton : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0260   (0x0018)  MISSED
	UImage*                                            _background;                                                // 0x0278   (0x0008)  
	UImage*                                            _cardIcon;                                                  // 0x0280   (0x0008)  
	UTextBlock*                                        _labelMy;                                                   // 0x0288   (0x0008)  
	UTextBlock*                                        _labelCards;                                                // 0x0290   (0x0008)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0298   (0x0008)  MISSED
	FBankATMMyCardsButtonStateVisual                   _normalVisuals;                                             // 0x02A0   (0x0120)  
	FBankATMMyCardsButtonStateVisual                   _hoveredVisuals;                                            // 0x03C0   (0x0120)  
	FBankATMMyCardsButtonStateVisual                   _pressedVisuals;                                            // 0x04E0   (0x0120)  
	FBankATMMyCardsButtonStateVisual                   _disabledVisuals;                                           // 0x0600   (0x0120)  
};

/// Class /Script/ConZ.BankATMPinSlot
/// Size: 0x0050 (0x000260 - 0x0002B0)
class UBankATMPinSlot : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0260   (0x0010)  MISSED
	UWidgetSwitcher*                                   _pinNumberTypeSwitcher;                                     // 0x0270   (0x0008)  
	UTextBlock*                                        _pinNumber;                                                 // 0x0278   (0x0008)  
	UImage*                                            _animatedEntryBar;                                          // 0x0280   (0x0008)  
	UWidgetAnimation*                                  _enterNumber;                                               // 0x0288   (0x0008)  
	UWidgetAnimation*                                  _enterNumberLast;                                           // 0x0290   (0x0008)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x0298   (0x0010)  MISSED
	float                                              _caretBlinkSeconds;                                         // 0x02A8   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x02AC   (0x0004)  MISSED


	/// Functions
	// Function /Script/ConZ.BankATMPinSlot.OnCaretSettles
	void OnCaretSettles();                                                                                                   // [0x225c200] Final|Native|Private 
	// Function /Script/ConZ.BankATMPinSlot.OnCaretCoversNumber
	void OnCaretCoversNumber();                                                                                              // [0x225c1e0] Final|Native|Private 
};

/// Class /Script/ConZ.BankATMPointingButton
/// Size: 0x02C8 (0x000260 - 0x000528)
class UBankATMPointingButton : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x28];                                      // 0x0260   (0x0028)  MISSED
	FText                                              _titleText;                                                 // 0x0288   (0x0018)  
	bool                                               _isPointingRight;                                           // 0x02A0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02A1   (0x0007)  MISSED
	UImage*                                            _backgroundImage;                                           // 0x02A8   (0x0008)  
	UTextBlock*                                        _titleLabel;                                                // 0x02B0   (0x0008)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x02B8   (0x0008)  MISSED
	FBankATMPointingButtonStateVisual                  _normalVisuals;                                             // 0x02C0   (0x0098)  
	FBankATMPointingButtonStateVisual                  _hoveredVisuals;                                            // 0x0358   (0x0098)  
	FBankATMPointingButtonStateVisual                  _pressedVisuals;                                            // 0x03F0   (0x0098)  
	FBankATMPointingButtonStateVisual                  _disabledVisuals;                                           // 0x0488   (0x0098)  
	UAkAudioEvent*                                     _soundOnClicked;                                            // 0x0520   (0x0008)  
};

/// Class /Script/ConZ.BankATMUIController
/// Size: 0x00F8 (0x000028 - 0x000120)
class UBankATMUIController : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0xF8];                                      // 0x0028   (0x00F8)  MISSED
};

/// Class /Script/ConZ.BankATMVirtualEditbox
/// Size: 0x0080 (0x000260 - 0x0002E0)
class UBankATMVirtualEditbox : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0260   (0x0018)  MISSED
	FText                                              _hintText;                                                  // 0x0278   (0x0018)  
	UImage*                                            _outline;                                                   // 0x0290   (0x0008)  
	UTextBlock*                                        _hintLabel;                                                 // 0x0298   (0x0008)  
	UTextBlock*                                        _editboxLabel;                                              // 0x02A0   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x02A8   (0x0004)  MISSED
	FBankATMVirtualEditboxStateVisual                  _inactiveVisuals;                                           // 0x02AC   (0x0010)  
	FBankATMVirtualEditboxStateVisual                  _activeVisuals;                                             // 0x02BC   (0x0010)  
	FBankATMVirtualEditboxStateVisual                  _disabledVisuals;                                           // 0x02CC   (0x0010)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x02DC   (0x0004)  MISSED
};

/// Class /Script/ConZ.BankATMWelcomeScreen
/// Size: 0x0058 (0x000260 - 0x0002B8)
class UBankATMWelcomeScreen : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x0260   (0x0020)  MISSED
	UButton*                                           _btnCardsPrevious;                                          // 0x0280   (0x0008)  
	UButton*                                           _btnCardsNext;                                              // 0x0288   (0x0008)  
	UPanelWidget*                                      _cardCarousel;                                              // 0x0290   (0x0008)  
	UBankATMMyCardsButton*                             _btnMyCards;                                                // 0x0298   (0x0008)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x02A0   (0x0018)  MISSED


	/// Functions
	// Function /Script/ConZ.BankATMWelcomeScreen.HandleOnCardsPreviousClicked
	void HandleOnCardsPreviousClicked();                                                                                     // [0x22604f0] Final|Native|Private 
	// Function /Script/ConZ.BankATMWelcomeScreen.HandleOnCardsNextClicked
	void HandleOnCardsNextClicked();                                                                                         // [0x22604d0] Final|Native|Private 
};

/// Class /Script/ConZ.BankATMYesNoConfirmationScreen
/// Size: 0x0038 (0x000260 - 0x000298)
class UBankATMYesNoConfirmationScreen : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x0260   (0x0020)  MISSED
	UTextBlock*                                        _textDialog;                                                // 0x0280   (0x0008)  
	UBankATMPointingButton*                            _btnCancel;                                                 // 0x0288   (0x0008)  
	UBankATMPointingButton*                            _btnYes;                                                    // 0x0290   (0x0008)  
};

/// Class /Script/ConZ.BankCardItemComponent
/// Size: 0x0018 (0x0000C8 - 0x0000E0)
class UBankCardItemComponent : public UItemComponent
{ 
public:
	FDbIntegerId                                       _ownerUserProfileId;                                        // 0x00C8   (0x0008)  
	int64_t                                            _bankAccountNumber;                                         // 0x00D0   (0x0008)  
	EBankCardType                                      _bankCardType;                                              // 0x00D8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00D9   (0x0007)  MISSED
};

/// Class /Script/ConZ.BankCardOperationRequest
/// Size: 0x0018 (0x000028 - 0x000040)
class UBankCardOperationRequest : public UPlayerRpcChannelServerRequest
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0028   (0x0018)  MISSED
};

/// Class /Script/ConZ.BankCardOperationResponse
/// Size: 0x0008 (0x000028 - 0x000030)
class UBankCardOperationResponse : public UPlayerRpcChannelServerResponse
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Class /Script/ConZ.BankCardOwnershipRequest
/// Size: 0x0008 (0x000028 - 0x000030)
class UBankCardOwnershipRequest : public UPlayerRpcChannelServerRequest
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Class /Script/ConZ.BankCardOwnershipResponse
/// Size: 0x0058 (0x000028 - 0x000080)
class UBankCardOwnershipResponse : public UPlayerRpcChannelServerResponse
{ 
public:
	unsigned char                                      UnknownData00_1[0x58];                                      // 0x0028   (0x0058)  MISSED
};

/// Class /Script/ConZ.SedentaryNPC
/// Size: 0x0160 (0x0007B0 - 0x000910)
class ASedentaryNPC : public AConZCharacter
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x07B0   (0x0008)  MISSED
	FVector                                            _originalLocation;                                          // 0x07B8   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x07C4   (0x0004)  MISSED
	ATradeOutpostBuilding*                             _tradeOutpostBuilding;                                      // 0x07C8   (0x0008)  
	unsigned char                                      UnknownData02_5[0x18];                                      // 0x07D0   (0x0018)  MISSED
	FVector                                            _animationHeadScale;                                        // 0x07E8   (0x000C)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x07F4   (0x0004)  MISSED
	UAnimSequenceBase*                                 _faceIdleAnimation;                                         // 0x07F8   (0x0008)  
	FFloatRange                                        _headYawClampValues;                                        // 0x0800   (0x0010)  
	FFloatRange                                        _headPitchClampValues;                                      // 0x0810   (0x0010)  
	float                                              _headPitchClampCorrectionValueLower;                        // 0x0820   (0x0004)  
	float                                              _headPitchClampCorrectionValueUpper;                        // 0x0824   (0x0004)  
	float                                              _headRotationSpeedLerpFactor;                               // 0x0828   (0x0004)  
	FFloatRange                                        _eyesYawAngleRange;                                         // 0x082C   (0x0010)  
	FFloatRange                                        _eyesPitchAngleRange;                                       // 0x083C   (0x0010)  
	float                                              _eyesPitchClampCorrectionValueLower;                        // 0x084C   (0x0004)  
	float                                              _eyesPitchClampCorrectionValueUpper;                        // 0x0850   (0x0004)  
	float                                              _eyesRotationSpeedLerpFactor;                               // 0x0854   (0x0004)  
	FFloatRange                                        _blinkingPeriodRange;                                       // 0x0858   (0x0010)  
	float                                              _timeToBlinkInSeconds;                                      // 0x0868   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x086C   (0x0004)  MISSED
	TArray<UClass*>                                    _backgroundInteractions;                                    // 0x0870   (0x0010)  
	USedentaryNPCBackgroundInteraction*                _activeBackgroundInteraction;                               // 0x0880   (0x0008)  
	float                                              _interactionDistance;                                       // 0x0888   (0x0004)  
	float                                              _timeWithoutFocusPawnToClearBackgroundInteractions;         // 0x088C   (0x0004)  
	unsigned char                                      UnknownData05_5[0x58];                                      // 0x0890   (0x0058)  MISSED
	float                                              _backgroundInteractionCooldownTime;                         // 0x08E8   (0x0004)  
	unsigned char                                      UnknownData06_6[0x24];                                      // 0x08EC   (0x0024)  MISSED
};

/// Class /Script/ConZ.Banker
/// Size: 0x0010 (0x000910 - 0x000920)
class ABanker : public ASedentaryNPC
{ 
public:
	float                                              _bankTransactionCooldownTime;                               // 0x0908   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x090C   (0x0004)  MISSED
	UClass*                                            _bankMinigameClass;                                         // 0x0910   (0x0008)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0918   (0x0008)  MISSED
};

/// Class /Script/ConZ.InteractionAssetData
/// Size: 0x0008 (0x000028 - 0x000030)
class UInteractionAssetData : public UAssetUserData
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Class /Script/ConZ.BankTransactionAssetData
/// Size: 0x0008 (0x000030 - 0x000038)
class UBankTransactionAssetData : public UInteractionAssetData
{ 
public:
	UClass*                                            BankATMMinigame;                                            // 0x0030   (0x0008)  
};

/// Class /Script/ConZ.BankTransactionRequest
/// Size: 0x0038 (0x000028 - 0x000060)
class UBankTransactionRequest : public UPlayerRpcChannelServerRequest
{ 
public:
	unsigned char                                      UnknownData00_1[0x38];                                      // 0x0028   (0x0038)  MISSED
};

/// Class /Script/ConZ.BankTransactionResponse
/// Size: 0x0008 (0x000028 - 0x000030)
class UBankTransactionResponse : public UPlayerRpcChannelServerResponse
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Class /Script/ConZ.BaseMenu
/// Size: 0x0000 (0x000260 - 0x000260)
class UBaseMenu : public UUserWidget
{ 
public:
};

/// Class /Script/ConZ.BarberShopMenuWidget
/// Size: 0x01F0 (0x000260 - 0x000450)
class UBarberShopMenuWidget : public UBaseMenu
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0260   (0x0008)  MISSED
	UOverlay*                                          _overlayMenu;                                               // 0x0268   (0x0008)  
	UTrashNamedSliderWidget*                           _sliderHairStyle;                                           // 0x0270   (0x0008)  
	UCCGameUpgradeConditionDisplayWidget*              _hairStyleUpgradeConditionDisplay;                          // 0x0278   (0x0008)  
	UVerticalBox*                                      _facialHairVerticalBox;                                     // 0x0280   (0x0008)  
	UTrashNamedSliderWidget*                           _sliderMoustacheStyle;                                      // 0x0288   (0x0008)  
	UCCGameUpgradeConditionDisplayWidget*              _moustacheStyleUpgradeConditionDisplay;                     // 0x0290   (0x0008)  
	UTrashNamedSliderWidget*                           _sliderBeardStyle;                                          // 0x0298   (0x0008)  
	UCCGameUpgradeConditionDisplayWidget*              _beardStyleUpgradeConditionDisplay;                         // 0x02A0   (0x0008)  
